
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РеквизитыДокумента = БюджетныйНаСервере.ВернутьРеквизиты(Данные.Ссылка, "ВидОперации");
	Если НЕ РеквизитыДокумента = Неопределено И ЗначениеЗаполнено(РеквизитыДокумента.ВидОперации) Тогда
		Представление = Строка(РеквизитыДокумента.ВидОперации) + " " + Строка(Данные.Номер) + " от " + Строка(Данные.Дата);	
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка, ВедомостьДляЗаполнения = Ложь) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.УЧ_Инвентаризация.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
		#Область ИсходныйКод
	//Запрос.Текст = "ВЫБРАТЬ
	//|	УЧ_Инвентаризация.Дата КАК Дата,
	//|	УЧ_Инвентаризация.Номер КАК Номер,
	//|	УЧ_Инвентаризация.Организация КАК Организация,
	//|	УЧ_Инвентаризация.Предприятие КАК Предприятие,
	//|	УЧ_Инвентаризация.Склад КАК Склад,
	//|	УЧ_Инвентаризация.Товары.(
	//|		НомерСтроки КАК НомерСтроки,
	//|		Номенклатура КАК Номенклатура,
	//|		КоличествоФакт КАК КоличествоФакт,
	//|		СуммаФакт КАК СуммаФакт,
	//|		Количество КАК Количество,
	//|		Сумма КАК Сумма,
	//|		КоличествоОтклонение КАК КоличествоОтклонение,
	//|		СуммаОтклонение КАК СуммаОтклонение,
	//|		КоличествоБУ КАК КоличествоБУ,
	//|		СуммаБУ КАК СуммаБУ,
	//|		КоличествоОтклонениеБУ КАК КоличествоОтклонениеБУ,
	//|		СуммаОтклонениеБУ КАК СуммаОтклонениеБУ,
	//|		СерияНоменклатуры КАК СерияНоменклатуры,
	//|		СчетУчета КАК СчетУчета
	//|	) КАК Товары
	//|ИЗ
	//|	Документ.УЧ_Инвентаризация КАК УЧ_Инвентаризация
	//|ГДЕ
	//|	УЧ_Инвентаризация.Ссылка В(&Ссылка)"; 
	//Запрос.Параметры.Вставить("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();

	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//Шапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	//ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	//ТабДок.Очистить();

	//ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;

	//	ТабДок.Вывести(ОбластьЗаголовок);

	//	Шапка.Параметры.Заполнить(Выборка);
	//	ТабДок.Вывести(Шапка, Выборка.Уровень());

	//	ТабДок.Вывести(ОбластьТоварыШапка);
	//	ВыборкаТовары = Выборка.Товары.Выбрать();
	//	Пока ВыборкаТовары.Следующий() Цикл
	//		ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
	//		ОбластьТовары.Область(1,2,1,ТабДок.ШиринаТаблицы).ЦветФона = Новый Цвет(0, 255, 0);
	//		ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень()); 
	//	КонецЦикла;
	#КонецОбласти
	Если ВедомостьДляЗаполнения Тогда
	Запрос.Текст = "ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(УЧ_ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ВТТоварыГрупп
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка,
	|	УЧ_ИнвентаризацияТовары.Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Дата КАК Дата,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Номер КАК Номер,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Организация КАК Организация,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Предприятие КАК Предприятие,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Склад КАК Склад,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.Количество КАК Количество,
	|	УЧ_ИнвентаризацияТовары.Сумма КАК Сумма,
	|	УЧ_ИнвентаризацияТовары.КоличествоБУ КАК КоличествоБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаБУ КАК СуммаБУ,
	|	УЧ_ИнвентаризацияТовары.КоличествоОтклонениеБУ КАК КоличествоОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаОтклонениеБУ КАК СуммаОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	УЧ_ИнвентаризацияТовары.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ВТТоварыГрупп.НомерСтроки > 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РазделениеПоСчетамДляВыделенияСтроки
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварыГрупп КАК ВТТоварыГрупп
	|		ПО УЧ_ИнвентаризацияТовары.Ссылка = ВТТоварыГрупп.Ссылка
	|			И УЧ_ИнвентаризацияТовары.Номенклатура = ВТТоварыГрупп.Номенклатура
	|			И УЧ_ИнвентаризацияТовары.СерияНоменклатуры = ВТТоварыГрупп.СерияНоменклатуры
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.МоментВремени,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Предприятие),
	|	МАКСИМУМ(Склад)
	|ПО
	|	Ссылка";

	Иначе
	Запрос.Текст = "ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	КОЛИЧЕСТВО(УЧ_ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ВТТоварыГрупп
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка,
	|	УЧ_ИнвентаризацияТовары.Номенклатура,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УЧ_ИнвентаризацияТовары.Ссылка.Дата КАК Дата,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Номер КАК Номер,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Организация КАК Организация,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Предприятие КАК Предприятие,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Склад КАК Склад,
	|	УЧ_ИнвентаризацияТовары.Ссылка.Ссылка КАК Ссылка,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
	|	УЧ_ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	УЧ_ИнвентаризацияТовары.КоличествоФакт КАК КоличествоФакт,
	|	УЧ_ИнвентаризацияТовары.СуммаФакт КАК СуммаФакт,
	|	УЧ_ИнвентаризацияТовары.Количество КАК Количество,
	|	УЧ_ИнвентаризацияТовары.Сумма КАК Сумма,
	|	УЧ_ИнвентаризацияТовары.КоличествоОтклонение КАК КоличествоОтклонение,
	|	УЧ_ИнвентаризацияТовары.СуммаОтклонение КАК СуммаОтклонение,
	|	УЧ_ИнвентаризацияТовары.КоличествоБУ КАК КоличествоБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаБУ КАК СуммаБУ,
	|	УЧ_ИнвентаризацияТовары.КоличествоОтклонениеБУ КАК КоличествоОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СуммаОтклонениеБУ КАК СуммаОтклонениеБУ,
	|	УЧ_ИнвентаризацияТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	УЧ_ИнвентаризацияТовары.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ВТТоварыГрупп.НомерСтроки > 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РазделениеПоСчетамДляВыделенияСтроки
	|ИЗ
	|	Документ.УЧ_Инвентаризация.Товары КАК УЧ_ИнвентаризацияТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварыГрупп КАК ВТТоварыГрупп
	|		ПО УЧ_ИнвентаризацияТовары.Ссылка = ВТТоварыГрупп.Ссылка
	|			И УЧ_ИнвентаризацияТовары.Номенклатура = ВТТоварыГрупп.Номенклатура
	|			И УЧ_ИнвентаризацияТовары.СерияНоменклатуры = ВТТоварыГрупп.СерияНоменклатуры
	|ГДЕ
	|	УЧ_ИнвентаризацияТовары.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УЧ_ИнвентаризацияТовары.Ссылка.МоментВремени,
	|	УЧ_ИнвентаризацияТовары.НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Предприятие),
	|	МАКСИМУМ(Склад)
	|ПО
	|	Ссылка";
    КонецЕсли;
	Запрос.Параметры.Вставить("Ссылка", Ссылка); 
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			Если ВыборкаТовары.РазделениеПоСчетамДляВыделенияСтроки Тогда
				ОбластьТовары.Область(1,2,1,ТабДок.ШиринаТаблицы).ЦветФона = Новый Цвет(192, 220, 192); 
			КонецЕсли;
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень()); 
			ОбластьТовары.Область(1,2,1,ТабДок.ШиринаТаблицы).ЦветФона = Новый Цвет(255, 255, 255);
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
