
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Добавить(
	"УпрГруппа",
	Тип("ГруппаФормы"),
	ЭтаФорма);
	
	
	
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Поведение  = ПоведениеОбычнойГруппы.Свертываемая;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет; 
	
	ГруппаПероваяСтрока = Элементы.Добавить(
	"УпрГруппаПерваяСтрока",
	Тип("ГруппаФормы"),
	Группа);

	ГруппаПероваяСтрока.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПероваяСтрока.Поведение  = ПоведениеОбычнойГруппы.Обычное;
	ГруппаПероваяСтрока.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПероваяСтрока.Отображение = ОтображениеОбычнойГруппы.Нет; 
	
	ГруппаВтораяСтрокаСтрока = Элементы.Добавить(
	"УпрГруппаВтораяСтрока",
	Тип("ГруппаФормы"),
	Группа);

	ГруппаВтораяСтрокаСтрока.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВтораяСтрокаСтрока.Поведение  = ПоведениеОбычнойГруппы.Обычное;
	ГруппаВтораяСтрокаСтрока.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаВтораяСтрокаСтрока.Отображение = ОтображениеОбычнойГруппы.Нет;


	
	Группа.Заголовок = "Реквизиты (Управленка):";
	
	ПолеВвода = Элементы.Добавить("Вес", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Вес";
	
	ПолеВвода = Элементы.Добавить("ВесНетто", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВесНетто";
	
	ПолеВвода = Элементы.Добавить("Объем", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Объем";
	
	ПолеВвода = Элементы.Добавить("Кратность", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Кратность";
	
	ПолеВвода = Элементы.Добавить("МинимальнаяПартия", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.МинимальнаяПартия";
	
	ПолеВвода = Элементы.Добавить("СрокГодности", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СрокГодности";
	
	ПолеВвода = Элементы.Добавить("Весовой", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода.ПутьКДанным = "Объект.Весовой"; 
	
	ПолеВвода = Элементы.Добавить("ВыгружатьВСмарт", Тип("ПолеФормы"), ГруппаПероваяСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода.ПутьКДанным = "Объект.ВыгружатьВСмарт";
	
	ПолеВвода = Элементы.Добавить("ХранитсяПриОтрицательнойТемпературе", Тип("ПолеФормы"), ГруппаВтораяСтрокаСтрока);
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ПолеВвода.ПутьКДанным = "Объект.ХранитсяПриОтрицательнойТемпературе"; 

	
КонецПроцедуры

&НаКлиенте
Процедура УУ_ПриОткрытииПосле(Отказ)
	
	ОграничениеПрав = Бюджетныйнасервере.СправочникНайтиПоНаименованию("сабМониторВнедрения", "ОграничениеПравРедактированияКлючевыхСправочников", Истина);
	
	Если ЗначениеЗаполнено(ОграничениеПрав) И БюджетныйНаСервере.ВернутьРеквизит(ОграничениеПрав, "Значение") = "Да" Тогда
		
		Если Не БюджетныйНаСервере.РольДоступнаСервер("АдминистраторСистемы") Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УУ_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	КонтролироватьУникальностьАртикулов = НайтиКонтролироватьУникальностьАртикулов();
	Если КонтролироватьУникальностьАртикулов = Неопределено ИЛИ КонтролироватьУникальностьАртикулов = ЛОЖЬ Тогда
	Иначе
		Если СокрЛП(Объект.Артикул) <> "" Тогда
			
			ЕстьДубль = ПоискАртикула(СокрЛП(Объект.Артикул));
			
			Если ЕстьДубль Тогда
				Оповещение = Новый ОписаниеОповещения();
				ПоказатьПредупреждение(Оповещение, "Указанный артикул уже используется. Введите другой.");
				Отказ = ЕстьДубль;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиКонтролироватьУникальностьАртикулов()
	Возврат Справочники.сабМониторВнедрения.НайтиПоНаименованию("КонтролироватьУникальностьАртикулов", Истина).Значение;
КонецФункции

&НаСервере
Функция ПоискАртикула(Артикул)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	СОКРЛП(Номенклатура.Артикул) = &Артикул
	|	И Номенклатура.Ссылка <> &ЭтаСсылка";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("ЭтаСсылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;			
	КонецЦикла;
	Возврат Ложь;
КонецФункции
