
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТекПользователь Из Параметры.ТекСписок Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Пользователь = ТекПользователь;
		НоваяСтрока.Оповещен = Истина;
	КонецЦикла;
	ЗадачаОповещения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	МассивВозвращаемых = Новый Массив;
	Для каждого ТекСтрока Из ТЗ Цикл
		Если НЕ ТекСтрока.Оповещен Тогда
			МассивВозвращаемых.Добавить(ТекСтрока.Пользователь);	
		КонецЕсли;		
	КонецЦикла;
	Закрыть(Новый Структура("СписокПользователей, ЗадачаОповещения", МассивВозвращаемых, ЗадачаОповещения));
КонецПроцедуры

&НаКлиенте
Процедура ТЗПриАктивизацииСтроки(Элемент)
	Если НЕ Элементы.ТЗ.ТекущиеДанные = Неопределено Тогда
		Элементы.ТЗПользователль.ТолькоПросмотр = Элементы.ТЗ.ТекущиеДанные.Оповещен;
	КонецЕсли;
КонецПроцедуры
