
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	ТекФорма = ПолучитьФорму("Документ.Д_ЗаявкаНаИзменениеУсловийКлиента.ФормаОбъекта", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	ТекФорма.Объект.ВидСЗ = БПСервер.ПолучитьВидСЗ("СогласованиеУсловийКлиента");
	ТекФорма.Объект.Комментарий = "Утверждение новых условий по клиентам"; 
	Для каждого ТекКонтрагент Из ПараметрКоманды Цикл

		ТекРеквизиты = БюджетныйНаСервере.ПолучитьТекущиеУсловияКонтрагента(ТекКонтрагент, ТекущаяДата());
		
		НоваяСтрока = ТекФорма.Объект.УсловияКлиента.Добавить();
		НоваяСтрока.Контрагент = ТекКонтрагент;
		НоваяСтрока.Дата = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекРеквизиты);
	КонецЦикла; 
	ТекФорма.Открыть();
КонецПроцедуры
