
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ(&МассивПодразделений)";
	Запрос.УстановитьПараметр("МассивПодразделений", Подразделения.ВыгрузитьКолонку("Подразделение")); 
	
	ВыборкаПоПодразделениям = Запрос.Выполнить().Выбрать();
	
	Движения.ВД_КонтрактныеУсловия.Записывать = Истина;
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ВД_КонтрактныеУсловия.Добавить();
			Движение.Период = Дата;
			Движение.Предприятие = Предприятие;
			Движение.Подразделение = ВыборкаПоПодразделениям.Ссылка;
			Движение.Условие = Статья;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Контрагент = Контрагент;
			Движение.Договор = Договор;
			Движение.Значение = Ставка;
			Движение.ВидРассчетаРоялти = ВидРассчета;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры
