
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		//Отказ = сабОперОбщегоНазначения.ПроверкаСозданияНаОснованииНаСервере(ДанныеЗаполнения, Наименование, СтандартнаяОбработка, ТипЗнч(Ссылка));
		//Если НЕ Отказ = Неопределено Тогда
		//	Возврат;		
		//КонецЕсли;
		
		Владелец = ДанныеЗаполнения.Ссылка;
		
		//ищем заявку для дозаполнения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Д_ЗаявкаНаСогласованиеДоговора.Ссылка КАК Ссылка,
		               |	Д_ЗаявкаНаСогласованиеДоговора.ДатаДоговора КАК ДатаДоговора,
		               |	Д_ЗаявкаНаСогласованиеДоговора.Текстовка КАК Текстовка,
		               |	Д_ЗаявкаНаСогласованиеДоговора.НомерДоговора КАК НомерДоговора
		               |ИЗ
		               |	Документ.Д_ЗаявкаНаСогласованиеДоговора КАК Д_ЗаявкаНаСогласованиеДоговора
		               |ГДЕ
		               |	Д_ЗаявкаНаСогласованиеДоговора.ПометкаУдаления = ЛОЖЬ
		               |	И Д_ЗаявкаНаСогласованиеДоговора.Договор = &Договор";
		
		Запрос.УстановитьПараметр("Договор", ДанныеЗаполнения.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Комментарий = Выборка.Текстовка;
			Дата = Выборка.ДатаДоговора;
			Номер = Выборка.НомерДоговора;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаСогласованиеДоговора") Тогда
		
		Отказ = сабОперОбщегоНазначения.ПроверкаСозданияНаОснованииНаСервере(ДанныеЗаполнения, Наименование, СтандартнаяОбработка, ТипЗнч(Ссылка));
		Если Отказ.Признак = "##УжеСоздан" Тогда
			ВызватьИсключение "На основании Заявка на согласование договора уже введено " + Отказ.Ссылка;
		ИначеЕсли Отказ.Признак = "##НеПроведен" Тогда
			ВызватьИсключение "Документ Заявка на согласование договора не проведен. Ввод на основании не возможен.";
		КонецЕсли;
		
		Владелец = ДанныеЗаполнения.Договор;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Комментарий = ДанныеЗаполнения.Текстовка;
		ДокументОснование = ДанныеЗаполнения;
		Код = ДанныеЗаполнения.НомерДоговора;
		Дата = ДанныеЗаполнения.ДатаДоговора;
		
		РеквВладельца = БюджетныйНаСервере.ВернутьРеквизиты(Владелец, "Организация, Подразделение", Ложь);
		Доп = ?(ЗначениеЗаполнено(РеквВладельца.Организация), Строка(РеквВладельца.Организация), "") + ?(ЗначениеЗаполнено(РеквВладельца.Подразделение), ", " + Строка(РеквВладельца.Подразделение), "");
		Наименование = Строка("Доп. соглашение") + " №" + Код + " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + ?(ЗначениеЗаполнено(Доп), " (" + Доп + ")", "");  
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	НаборЗаписей = РегистрыСведений.ОтсрочкаПоДоговорам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Дата);
	НаборЗаписей.Отбор.Договор.Установить(Ссылка.Владелец);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.Период = Дата;
	Запись.Договор = Владелец;
	Запись.Отсрочка = Отсрочка;
	Запись.Предоплата = Предоплата;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//подписка на событие
	БюджетныйНаСервере.ПередЗаписиЭлементовСправочниковПриЗаписи(ЭтотОбъект, Отказ);
КонецПроцедуры
