
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ(&Подразделения)
	|	И СтруктураПредприятия.Владелец = &Предприятие";
	Запрос.УстановитьПараметр("Подразделения", Подразделение);
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	ТаблицаПодразделений = Запрос.Выполнить().Выгрузить();
	
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ВыборкаПоПодразделениям Из ТаблицаПодразделений Цикл
		Для Каждого ТекСтрокаЦены Из Цены Цикл
			Движение = Движения.ЦеныНоменклатуры.Добавить();
			Движение.Подразделение = ВыборкаПоПодразделениям.Ссылка;
			Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
			Движение.Предприятие = Предприятие;
			Движение.ВидЦены = ТекСтрокаЦены.ВидЦены;
			Движение.Цена = ТекСтрокаЦены.Цена;
			Движение.Период = Дата;
			Движение.Наценка = ТекСтрокаЦены.Наценка;
			Движение.НаценкаРуб = ТекСтрокаЦены.НаценкаРуб;
			Движение.ПервичныйВидЦен = ТекСтрокаЦены.ПервичныйВидЦен;
			Движение.ПервичнаяЦена = ТекСтрокаЦены.ПервичнаяЦена;
			Движение.ФиксированнаяЦена = ТекСтрокаЦены.ФиксированнаяЦена;
			Движение.МРЦ = ТекСтрокаЦены.МРЦ;
		КонецЦикла;
	КонецЦикла;

	Если ВидОперации = Перечисления.ВидыОперацийУстановкаЦен.УстановкаЦенПоставщика Тогда
		ДвиженияПоРегиструНоменклатурыПоставщика(ТаблицаПодразделений);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДвиженияПоРегиструНоменклатурыПоставщика(ТаблицаПодразделений)
	
	Движения.НоменклатураПоставщика.Записывать = Истина;
	Для Каждого ВыборкаПоПодразделениям Из ТаблицаПодразделений Цикл
		Для Каждого ТекСтрокаЦены Из Цены Цикл
			Движение = Движения.НоменклатураПоставщика.Добавить();
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
			Движение.Период = Дата;
			Движение.Автор = ПараметрыСеанса.ТекущийПользователь;
			Движение.Подразделение = ВыборкаПоПодразделениям.Ссылка;
			Движение.Предприятие = Предприятие;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры
