
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Статус") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Статус", Параметры.Статус); 
	КонецЕсли; 
	Если Параметры.Свойство("УжеВыбрано") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("УжеВыбрано", Параметры.УжеВыбрано); 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаказы", Ложь); 
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("УжеВыбрано", Новый Массив); 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаказы", Истина); 
    КонецЕсли;

	
КонецПроцедуры
