
&НаКлиенте
Процедура СписокИсполнителейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ПустаяСтрока(Элемент.ТекущиеДанные.Приложение) Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Приложение);			
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Авторы = БПСервер.ПолучитьМассивПользователей();
	Список.Параметры.УстановитьЗначениеПараметра("Автор", Авторы);
	Список2.Параметры.УстановитьЗначениеПараметра("Автор", Авторы);
	Список.Параметры.УстановитьЗначениеПараметра("Кому", Кому);
	Список2.Параметры.УстановитьЗначениеПараметра("Кому", Кому);
КонецПроцедуры

&НаКлиенте
Процедура Список2Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.БП_Оповещение.Форма.ФормаИсполненного", Новый Структура("Ключ", Элементы.Список2.ТекущаяСтрока));
КонецПроцедуры

&НаКлиенте
Процедура КомуПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("Кому", Кому);
	Список2.Параметры.УстановитьЗначениеПараметра("Кому", Кому);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры
