

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьЗакрытыеОтгрузки", ПоказатьЗакрытыеОтгрузки);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия);
	
	Если Параметры.Свойство("ДатаДокумента") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаДокумента", Параметры.ДатаДокумента);
	Иначе	
		Список.Параметры.УстановитьЗначениеПараметра("ДатаДокумента", ТекущаяДата());
	КонецЕсли;
	Если Параметры.Свойство("Контрагент") Тогда		
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Неопределено);
	КонецЕсли;
	Если Параметры.Свойство("Договор") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Договор", Параметры.Договор);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Договор", Неопределено);
	КонецЕсли;
	//Если Параметры.Свойство("ТекСумма") Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("ТекСумма", Параметры.ТекСумма);
	//Иначе
	//	Список.Параметры.УстановитьЗначениеПараметра("ТекСумма", 0);		
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьЗакрытыеОтгрузкиПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьЗакрытыеОтгрузки", ПоказатьЗакрытыеОтгрузки);
КонецПроцедуры

