
&НаКлиенте
Процедура ТекЧасНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекЗнач = ВыбратьИзСписка(ЧасСп, Элементы.ТекЧас, ТекЧас);
	Если НЕ ТекЗнач = Неопределено Тогда
		ТекЧас = ТекЗнач.Значение;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата = ТекущаяДата();
	КонецЕсли;
	//Элементы.Реквизит1.НачалоПериодаОтображения = ТекДата;	
	ТекЧас = Час(ТекДата) + 1;
	Если ТекЧас > 23 Тогда
		ТекЧас = 0;
	КонецЕсли;
	ТекМинута = 0;
	
	Для Мин = 0 По 59 Цикл
		МинСп.Добавить(Мин);	
	КонецЦикла;
	
	Для Час = 0 По 23 Цикл
		ЧасСп.Добавить(Час);	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ТекМинутаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекЗнач = ВыбратьИзСписка(МинСп, Элементы.ТекМинута, ТекМинута);
	Если НЕ ТекЗнач = Неопределено Тогда
		ТекМинута = ТекЗнач.Значение;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ТевВремя = НачалоДня(ТекДата) + ТекЧас * 60 * 60 + ТекМинута * 60;
	Закрыть(ТевВремя);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекДата") Тогда
		ТекДата = Параметры.ТекДата;	
	КонецЕсли;
	Если Параметры.Свойство("ВидКалендаря") Тогда
		Если Параметры.ВидКалендаря = "Дата" Тогда
			Элементы.Группа1.Видимость = Ложь;		
		КонецЕсли;	
	КонецЕсли;
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы;
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1Выбор(Элемент, ВыбраннаяДата)
	Если Элементы.Группа1.Видимость = Ложь Тогда
		ОК(Неопределено);
	КонецЕсли;
КонецПроцедуры
