&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//ответ = ОткрытьФормуМодально("Обработка.КурсыВалютРБК.Форма.Форма");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Объект.СчетаПодлежащиеПереоценке) Тогда 
		ЗаполнитьСчетаТЧ();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СчетКурсовйРазницы) Тогда 
		Объект.СчетКурсовйРазницы = ПланыСчетов.Учетный.Счет91();
	КонецЕсли;
	БюджетныйНаСервере.ДействияПриСозданииФормыДокумента(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаТЧ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Учетный.Ссылка КАК Счет
	               |ИЗ
	               |	ПланСчетов.Учетный КАК Учетный
	               |ГДЕ
	               |	НЕ Учетный.Забалансовый
	               |	И Учетный.Валютный
	               |	И Учетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Учетный.ДоходыИРасходы)
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Объект.СчетаПодлежащиеПереоценке.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура СчетКурсовйРазницыПриИзменении(Элемент)
	Если Объект.СчетКурсовйРазницы = ПолучитьСчет59() Тогда 
		Объект.СчетаПодлежащиеПереоценке.Очистить();
		ДобавитьВТЧСчет58();
		Элементы.Статья.Видимость=Ложь;
	Иначе 
		Объект.СчетаПодлежащиеПереоценке.Очистить();
		ЗаполнитьСчетаТЧ();
		Элементы.Статья.Видимость = Истина;
	КонецЕсли;       	
КонецПроцедуры
	
&НаСервере
Функция ПолучитьСчет59()
	Возврат ПланыСчетов.Учетный._59_2;
КонецФункции

&НаСервере
Процедура ДобавитьВТЧСчет58()
	Строка = Объект.СчетаПодлежащиеПереоценке.Добавить();
	Строка.Счет = ПланыСчетов.Учетный.ФинансовыеВложения;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	сабОбщегоНазначения.ОтобразитьСостояниеДокумента(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	сабОбщегоНазначения.ОтобразитьСостояниеДокумента(ЭтаФорма);
КонецПроцедуры
