
&НаСервере
Процедура УУ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	сабОграничитьВводРучныхОпераций = Справочники.сабМониторВнедрения.ПолучитьЗначениеНастройки("сабОграничитьВводРучныхОпераций");
	
	Если сабОграничитьВводРучныхОпераций И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) И Параметры.ЗначениеКопирования.СпособЗаполнения = "Вручную" Тогда
		Отказ = Истина;
		Сообщить("Установлено ограничение на ввод операций вручную, копирование запрещено.");
	КонецЕсли;
	
КонецПроцедуры
