
&Вместо("ИсключаемыеИзПерепроведенияДокументыБезусловно")
Функция УУ_ИсключаемыеИзПерепроведенияДокументыБезусловно()
	
	Результат = ПродолжитьВызов();
	МассивРасширений = РасширенияКонфигурации.Получить();
	Для Каждого ЭлементМассива из МассивРасширений Цикл  
		Если ЭлементМассива.Имя <> "модульУправленка" Тогда  
			Продолжить;
		КонецЕсли;
		ДвоичныеДанныеРасширения = ЭлементМассива.ПолучитьДанные(); 		
		Если ДвоичныеДанныеРасширения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МетаданныеРасширения = Новый ОбъектМетаданныхКонфигурация(ДвоичныеДанныеРасширения); 
		Массив = Новый Массив;
		Для Каждого ЭлементМетаданныхРасширения из МетаданныеРасширения.Документы Цикл 
			ПолноеИмяМетаданных = ЭлементМетаданныхРасширения.ПолноеИмя();
			ОсновнойОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
			Если ОсновнойОбъектМетаданных <> Неопределено Тогда
				Если ОсновнойОбъектМетаданных.РасширениеКонфигурации() <> Неопределено Тогда
					Результат.Вставить(ЭлементМетаданныхРасширения.Имя);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;			                  
	Возврат Результат; 
	
КонецФункции
