
&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ	
	               |	ДатыЗапретаИзменения.ДатаЗапрета КАК ГлобальнаяДатаЗапрета
	               |ИЗ
	               |	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	               |ГДЕ
	               |	ДатыЗапретаИзменения.Объект = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ПоВсемОбъектам)
	               |	И ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ПоВсемПользователям)";
	ГлобальныеДатыЗапрета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГлобальнаяДатаЗапрета");
	
	Элементы.ДатаЗапрета.СписокВыбора.Добавить('00010101', "За все время");
	Для Каждого ТекДата Из ГлобальныеДатыЗапрета Цикл
		Элементы.ДатаЗапрета.СписокВыбора.Добавить(ТекДата, Формат(ТекДата, "ДЛФ=DD"));
	КонецЦикла;		
	
	//ПараметрДата     = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата").Параметр;
	//ДоступныеЗначенияДаты = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(ПараметрДата).ДоступныеЗначения;
	//ДоступныеЗначенияДаты.Очистить();
	//Для Каждого ТекДата Из ГлобальныеДатыЗапрета Цикл
	//	ДоступныеЗначенияДаты.Добавить(ТекДата, Формат(ТекДата, "ДЛФ=DD"));
	//КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗапретаПриИзменении(Элемент)
	
	ПараметрСКД = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Дата");
	ПараметрСКД.Значение = ДатаЗапрета;
	ПараметрСКД.Использование = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
