
Процедура ПриКопировании(ОбъектКопирования)
	// Вставить содержимое обработчика.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БюджетныйДвиженияССубконто.Период,
	|	БюджетныйДвиженияССубконто.Регистратор,
	|	БюджетныйДвиженияССубконто.НомерСтроки,
	|	БюджетныйДвиженияССубконто.Активность,
	|	БюджетныйДвиженияССубконто.СчетДт,
	|	БюджетныйДвиженияССубконто.СубконтоДт1,
	|	БюджетныйДвиженияССубконто.ВидСубконтоДт1,
	|	БюджетныйДвиженияССубконто.СубконтоДт2,
	|	БюджетныйДвиженияССубконто.ВидСубконтоДт2,
	|	БюджетныйДвиженияССубконто.СубконтоДт3,
	|	БюджетныйДвиженияССубконто.ВидСубконтоДт3,
	|	БюджетныйДвиженияССубконто.СчетКт,
	|	БюджетныйДвиженияССубконто.СубконтоКт1,
	|	БюджетныйДвиженияССубконто.ВидСубконтоКт1,
	|	БюджетныйДвиженияССубконто.СубконтоКт2,
	|	БюджетныйДвиженияССубконто.ВидСубконтоКт2,
	|	БюджетныйДвиженияССубконто.СубконтоКт3,
	|	БюджетныйДвиженияССубконто.ВидСубконтоКт3,
	|	БюджетныйДвиженияССубконто.Предприятия,
	|	БюджетныйДвиженияССубконто.СценарийПлана,
	|	БюджетныйДвиженияССубконто.Сумма,
	|	БюджетныйДвиженияССубконто.КоличествоДт,
	|	БюджетныйДвиженияССубконто.КоличествоКт,
	|	БюджетныйДвиженияССубконто.КоличествоКРХДт,
	|	БюджетныйДвиженияССубконто.КоличествоКРХКт,
	|	БюджетныйДвиженияССубконто.Содержание
	|ИЗ
	|	РегистрБухгалтерии.Бюджетный.ДвиженияССубконто(, , Регистратор = &Регистратор, , ) КАК БюджетныйДвиженияССубконто";
	
	Запрос.УстановитьПараметр("Регистратор", ОбъектКопирования.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.Бюджетный.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры



