
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТекущееПредприятие", Параметры.Предприятия);
	Если Параметры.Свойство("ТипИсточника") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТипИсточника", Параметры.ТипИсточника);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ТипИсточника", NULL);
	КонецЕсли;
	
	
	ОграниченныеИсточники = БюджетныйНаСервере.ПолучитьДоступныеИточники();
	Список.Параметры.УстановитьЗначениеПараметра("Источники", ОграниченныеИсточники.Ограничение);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеИсточники",ОграниченныеИсточники.ДоступныеИсточники);
	//Список.Параметры.УстановитьЗначениеПараметра("НачДата",НачалоМесяца(НачалоМесяца(ТекущаяДата()) - 1));
КонецПроцедуры
