
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	ДокументРезультат.Очистить();
//	
//	ПараметрыОтчета = Новый Структура;
//	
//	Для Каждого ЭлементНастройки из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы цикл
//		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") тогда
//			если Строка(ЭлементНастройки.Параметр) = "ВыбПериод" тогда
//				ПараметрыОтчета.Вставить("ВыбПериод", ЭлементНастройки.Значение);	
//			ИначеЕсли Строка(ЭлементНастройки.Параметр) = "ЭквивалентнаяВалюта" тогда
//				ПараметрыОтчета.Вставить("ЭквивалентнаяВалюта", ЭлементНастройки.Значение);	
//			ИначеЕсли Строка(ЭлементНастройки.Параметр) = "ДатаКурса" тогда
//				ПараметрыОтчета.Вставить("ДатаКурса", ЭлементНастройки.Значение);				
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	
//	СКД = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
//	
//	Источник = новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
//	КомпоновщикНастроек2 = Новый КомпоновщикНастроекКомпоновкиДанных;
//	КомпоновщикНастроек2.Инициализировать(Источник);
//	КомпоновщикНастроек2.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
//	КомпоновщикНастроек2.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
//	
//	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек2.ПолучитьНастройки();
//	
//	Для Каждого ТекЭлемент Из НастройкиДляКомпоновкиМакета.ПараметрыДанных.Элементы Цикл
//		Если Строка(ТекЭлемент.Параметр) = "Период" Тогда
//			ТекЭлемент.Значение = ПараметрыОтчета.ВыбПериод
//		КонецЕсли;
//		Если Строка(ТекЭлемент.Параметр) = "НачалоПериода" Тогда
//			ТекЭлемент.Значение = ПараметрыОтчета.ВыбПериод.ДатаНачала
//		КонецЕсли;
//		Если Строка(ТекЭлемент.Параметр) = "КонецПериода" Тогда
//			ТекЭлемент.Значение = ПараметрыОтчета.ВыбПериод.ДатаОкончания
//		КонецЕсли;		
//		Если Строка(ТекЭлемент.Параметр) = "ЭквивалентнаяВалюта" Тогда
//			СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НастройкиДляКомпоновкиМакета, "ЭквивалентнаяВалюта", ?(ЗначениеЗаполнено(ТекЭлемент.Значение), ТекЭлемент.Значение, УЧ_Сервер.НациональнаяВалюта()));
//		КонецЕсли;
//		Если Строка(ТекЭлемент.Параметр) = "ДатаКурса" Тогда
//			СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НастройкиДляКомпоновкиМакета, "ДатаКурса", ?(ЗначениеЗаполнено(ТекЭлемент.Значение), ТекЭлемент.Значение, ТекущаяДата()));
//		КонецЕсли;	
//		
//	КонецЦикла;
//		
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиДляКомпоновкиМакета, ДанныеРасшифровки, Неопределено);

//	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);    
//	
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
//	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
//		
//	СтандартнаяОбработка = Ложь;
//	
//КонецПроцедуры
