
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидОперации") Тогда
		ЭлементыДляУдаления = Новый Массив;
		
		ЭлементыОтбора = Список.Отбор.Элементы;
		ПолеКомпоновки = Новый ПолеКомпоновкиДанных("ВидОперации");
		Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
				И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
				ЭлементыДляУдаления.Добавить(ЭлементОтбора);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлементОтбораДляУдаления Из ЭлементыДляУдаления Цикл
			ЭлементыОтбора.Удалить(ЭлементОтбораДляУдаления);
		КонецЦикла;	
		
		//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидОперации");	
		//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		//ЭлементОтбора.Использование  = Истина;
		//Если Параметры.ВидОперации = "ZОтчеты" Тогда
		//	ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыОперацийРеализация.ZОтчет;
		//	Элементы.Контрагент.Видимость = Ложь;
		//	Элементы.Договор.Видимость = Ложь;
		//	Элементы.ПодразделениеВн.Видимость = Ложь;
		//ИначеЕсли Параметры.ВидОперации = "РеализацияТМЦ" Тогда
		//	СписокЗначений = Новый СписокЗначений;
		//	СписокЗначений.Добавить(Перечисления.ВидыОперацийРеализация.Товары);
		//	СписокЗначений.Добавить(Перечисления.ВидыОперацийРеализация.ПустаяСсылка());
		//	ЭлементОтбора.ПравоеЗначение = СписокЗначений;

		//КонецЕсли;	
	КонецЕсли;
		
	//добавляем информацию по строкам
	//сабДобавитьИнформациюПоСтрокам();
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//ПодключитьОбработчикОжидания("ОбновитьИнформациюПоСтрокам",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		Если Параметр.Свойство("ФормаВладелецУИД") И Параметр.ФормаВладелецУИД = ЭтаФорма.УникальныйИдентификатор Тогда
			сабОбщегоНазначения.ПрикрепитьФайлКДокументу(Параметр); 
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольДокументооборота(Команда)
	ОткрытьФорму("Документ.УЧ_Реализация.Форма.ФормаДокументооборота");
КонецПроцедуры


&НаКлиенте
Процедура ГрупповоеКопирование(Команда)
	ОткрытьФорму("Документ.УЧ_Реализация.Форма.ФормаГрупповогоКопирования");
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

