
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Этаформа.Параметры.Свойство("ВидСубнонто") И Этаформа.Параметры.ВидСубнонто = "Сотрудники" Тогда 
		ВидСубконтоСотрудники = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Сотрудники", Истина);
		
		Если ЗначениеЗаполнено(ВидСубконтоСотрудники) Тогда
			
			Попытка 				
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ЗапретитьИспользоватьВПроводках", Этаформа.Параметры.ЗапретитьИспользоватьВПроводках, ВидСравненияКомпоновкиДанных.Равно, Истина, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ); 		
				
				НовыйЭлементГруппаИли = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				НовыйЭлементГруппаИли.Использование = Истина;
				НовыйЭлементГруппаИли.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				НовыйЭлементГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(НовыйЭлементГруппаИли, "ВидСубконто1", ВидСубконтоСотрудники, ВидСравненияКомпоновкиДанных.Равно, Истина, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ); 		
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(НовыйЭлементГруппаИли, "ВидСубконто2", ВидСубконтоСотрудники, ВидСравненияКомпоновкиДанных.Равно, Истина, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ); 		
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(НовыйЭлементГруппаИли, "ВидСубконто3", ВидСубконтоСотрудники, ВидСравненияКомпоновкиДанных.Равно, Истина, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ); 		
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
