
&НаКлиенте
Процедура УстановитьИЗакрыть(Команда)
	
	ВРаботе = (Команда.Имя = "ВзятьВРаботу");
	

	ЗаписатьЗадачу();
	Оповестить("ОбновитьСписокЗадач");
	ЭтаФорма.Закрыть();
	Оповестить("ЗакрытьФормуСправочники");
	
	Если НЕ НеДелатьЗапросНаНовыйСрок Тогда
		
		Если ВРаботе Тогда
			БПСервер.СоздатьОповещение(ТекАвтор, "Пользователь " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + " взял в работу задачу """ + Строка(ТекЗадача) + """:
			|Комментарий: " + Строка(Комментарий), "Оповещение о взятии задания в работу", Заявка, Истина, , ТекЗадача);
		Иначе
			БПСервер.СоздатьОповещение(ТекАвтор, "Пользователь " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + " приостоновил работу по задаче """ + Строка(ТекЗадача) + """:
			|Комментарий: " + Строка(Комментарий), "Оповещение о приостановке работы по заданию", Заявка, Истина, , ТекЗадача);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗадачу()
	
	ТекОб = ТекЗадача.Скопировать();
	ТекОб.Вработе = Вработе;
	Если НеДелатьЗапросНаНовыйСрок Тогда
		ТекОб.СрокВыполнения = НовыйСрокВыполнения;
	КонецЕсли;
	ТекОб.Дата = ТекущаяДата();
	ТекОб.БизнесПроцесс = ТекЗадача.БизнесПроцесс;
	ТекОб.ТочкаМаршрута = ТекЗадача.ТочкаМаршрута;
	ТекОб.Записать();
	
	БПСервер.ВыполнитьЗадачу(ТекЗадача, , Истина, "Взял в работу. " + Строка(Комментарий));	
	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекЗадача = Параметры.Ключ;
	ТекРеквизиты = БюджетныйНаСервере.ВернутьРеквизиты(ТекЗадача, "БизнесПроцесс, Заявка, СрокВыполнения, ВРаботе, Описание, ДатаНачала"); 
	БизнесПроцесс = ТекРеквизиты.БизнесПроцесс;
	Заявка = ТекРеквизиты.Заявка;
	Описание = ТекРеквизиты.Описание;
	
	Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
		ТекАвтор = БизнесПроцесс.Автор;
		ТекЗаявка = БизнесПроцесс;
	Иначе
		ТекАвтор = Заявка.Автор;
		ТекЗаявка = Заявка;
	КонецЕсли;
	
	ВРаботе = ТекРеквизиты.ВРаботе;
	Элементы.ФормаУстановитьИЗакрыть.Видимость = НЕ ВРаботе;
	Элементы.ВременноОтложитьВыполнение.Видимость = ВРаботе;


КонецПроцедуры

