
&НаКлиенте
Процедура УУ_ЗаполнитьПосле(Команда)
	УдалитьЛишниеПоЗППроекту();
КонецПроцедуры

&НаСервере
Процедура УдалитьЛишниеПоЗППроекту()
	МассивВсеФЛ = ОбщегоНазначения.ВыгрузитьКолонку(Объект.Состав,"ФизическоеЛицо");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация КАК Организация,
		|	МАКСИМУМ(ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ДатаОткрытияЛицевогоСчета) КАК ДатаОткрытияЛицевогоСчета
		|ПОМЕСТИТЬ втПоследнийЗарплатныйПроект
		|ИЗ
		|	РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам КАК ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам
		|ГДЕ
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо В(&ФизическоеЛицо)
		|	И ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо,
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПоследнийЗарплатныйПроект.ФизическоеЛицо КАК ФизическоеЛицо,
		|	втПоследнийЗарплатныйПроект.Организация КАК Организация,
		|	втПоследнийЗарплатныйПроект.ДатаОткрытияЛицевогоСчета КАК ДатаОткрытияЛицевогоСчета,
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ЗарплатныйПроект КАК ЗарплатныйПроект
		|ИЗ
		|	втПоследнийЗарплатныйПроект КАК втПоследнийЗарплатныйПроект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам КАК ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам
		|		ПО втПоследнийЗарплатныйПроект.ФизическоеЛицо = ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо
		|			И втПоследнийЗарплатныйПроект.Организация = ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация
		|			И втПоследнийЗарплатныйПроект.ДатаОткрытияЛицевогоСчета = ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ДатаОткрытияЛицевогоСчета";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", МассивВсеФЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЗарплатныйПроект <> Объект.ЗарплатныйПроект Тогда
			СтруктураДляПоиска = Новый Структура("ФизическоеЛицо", ВыборкаДетальныеЗаписи.ФизическоеЛицо);
			
			ТабличнаяЧасть = Объект.Состав;
			МассивИсключаемыхСтрок = ТабличнаяЧасть.НайтиСтроки(СтруктураДляПоиска);
			Для Каждого Строка Из МассивИсключаемыхСтрок Цикл
				ТабличнаяЧасть.Удалить(Строка);
			КонецЦикла;
			
			ТабличнаяЧасть = Объект.Зарплата;
			МассивИсключаемыхСтрок = ТабличнаяЧасть.НайтиСтроки(СтруктураДляПоиска);
			Для Каждого Строка Из МассивИсключаемыхСтрок Цикл
				ТабличнаяЧасть.Удалить(Строка);
			КонецЦикла;
			
			ТабличнаяЧасть = Объект.ФизическиеЛица;
			МассивИсключаемыхСтрок = ТабличнаяЧасть.НайтиСтроки(СтруктураДляПоиска);
			Для Каждого Строка Из МассивИсключаемыхСтрок Цикл
				ТабличнаяЧасть.Удалить(Строка);
			КонецЦикла;
			
			ТабличнаяЧасть = Объект.НДФЛ;
			МассивИсключаемыхСтрок = ТабличнаяЧасть.НайтиСтроки(СтруктураДляПоиска);
			Для Каждого Строка Из МассивИсключаемыхСтрок Цикл
				ТабличнаяЧасть.Удалить(Строка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
