
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Группа = Элементы.Добавить(
	//"УпрГруппа",
	//Тип("ГруппаФормы"),
	//Этаформа.Элементы.ГруппаОсновныеРеквизиты);
	//
	//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Поведение  = ПоведениеОбычнойГруппы.Свертываемая;
	//Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	//Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	//
	//Группа.Заголовок = "Реквизиты (Управленка):";
	
	ПолеВвода = Элементы.Добавить("Касса", Тип("ПолеФормы"), Этаформа.Элементы.ГруппаОсновныеРеквизиты); 
	ПолеВвода.Заголовок = "Касса";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Касса"; 
	
КонецПроцедуры
