&НаСервере
Функция ВыполненоСервер(ПроверкаУспешно, ПричинаВозврата)
	
	БП = Объект.Заявка.ПолучитьОбъект();
	СтруктураПоиска = Новый Структура("Исполнитель", Объект.Автор);
	НайдденныеСтроки = БП.СписокИсполнителей.НайтиСтроки(СтруктураПоиска);
	Для каждого ТекСтрока Из НайдденныеСтроки Цикл
		ТекСтрока.ПричинаВозврата = ПричинаВозврата;
		ТекСтрока.Исполнено = ПроверкаУспешно;
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура("Исполнено", Ложь);
	Если НЕ БП.СписокИсполнителей.НайтиСтроки(СтруктураПоиска).Количество() Тогда
		БП.Завершен = Истина;
		БП.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		БП.Записать();	
	КонецЕсли;
	
	
	
	
	БПСервер.ВыполнитьЗадачу(Объект.Ссылка,0, ПроверкаУспешно, Комментарии);
	
	Если Не ПроверкаУспешно Тогда
		СоздатьЗадачуИсполнителю(БП.Ссылка);	
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаСервере
Процедура СоздатьЗадачуИсполнителю(БП)
	
		Задача = Задачи.Задача.СоздатьЗадачу();		
		Задача.Заявка = БП;
		Задача.Дата = ТекущаяДата();
		Задача.Наименование = "Доработать по заданию";
		
		//Задача.БизнесПроцесс  = ЭтотОбъект.Ссылка;
		//Задача.ТочкаМаршрута  = ТочкаМаршрутаБизнесПроцесса;
		
		Задача.Автор = ПараметрыСеанса.ТекущийПользователь;
		Задача.Описание = Объект.Описание;
		Задача.Исполнитель = Объект.Автор;
		Задача.Записать();

	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаСогласована(Команда)
	//Если Записать() Тогда
		Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
			//Результат = ВыполненоСервер(Истина, "");
			Результат = БПСервер.ВыполнитьКомандуЗадачиБП(Объект.Ссылка, "ЗаявкаСогласована", ПолучитьСтруктуруРеквизитовФормы(), Истина);
			ОповеститьОбИзменении(Объект.Заявка);
			Оповестить("ОбновитьСписокЗадач");
			Если Результат Тогда
				Закрыть();			
			КонецЕсли;
		КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииСервер()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура НаДоработку(Команда)
	
	Если Не ЗначениеЗаполнено(Комментарии) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена причина возврата на доработку", , "Комментарии",, );	
		Возврат;
	КонецЕсли;
	//Если Записать() Тогда
	Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
		//Результат = ВыполненоСервер(Ложь, ПричинаВозврата);
		Результат = БПСервер.ВыполнитьКомандуЗадачиБП(Объект.Ссылка, "НаДоработку", ПолучитьСтруктуруРеквизитовФормы(Истина), Истина);
		ОповеститьОбИзменении(Объект.Ссылка);
		Оповестить("ОбновитьСписокЗадач");
		Если Результат Тогда
			Закрыть();			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Если ИмяСобытия = "ПрикрепленныеФайлы" Тогда	
	//	ОбщегоНазначенияКлиентСервер.ОбновитьКоличествоПрикрепленныхФайлов(ЭтаФорма);
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БП = Объект.Заявка.ПолучитьОбъект();
	
	Документ = БП.Документ;
	Если Объект.Автор = БП.Автор Тогда
		ТекИсполнитель = Объект.Исполнитель;
	Иначе
		ТекИсполнитель = Объект.Автор;
	КонецЕсли;
	
	Тема = БП.Тема;
	
	СтруктураПоиска = Новый Структура("Исполнитель", ТекИсполнитель);
	НайдденныеСтроки = БП.СписокИсполнителей.НайтиСтроки(СтруктураПоиска);
	Для каждого ТекСтрока Из НайдденныеСтроки Цикл
		КомментарииИсполнителя = ТекСтрока.Комментарии;
		Приложение = ТекСтрока.Приложение;	
		Пользователь = ТекСтрока.Пользователь;	
		ПричинаВозврата = ТекСтрока.ПричинаВозврата;	
		СрокИсполнения = ТекСтрока.СрокИсполнения;	
		ДатаВыполнения = ТекСтрока.ДатаВыполнения;	
	КонецЦикла;
	
	Если БюджетныйНаСервере.ПолучитьПользователя() = Объект.Автор И НЕ Объект.Исполнитель = БюджетныйНаСервере.ПолучитьПользователя() Тогда //если исполнитель = текущему пользователю, то не показывать кнопку ОК
		Элементы.ЗаявкаСогласована.Видимость = Ложь;	
		Элементы.НаДоработку.Видимость = Ложь;	
	КонецЕсли;
	Если ПричинаВозврата = "" Тогда
		Элементы.ПричинаВозврата.Видимость = Ложь;	
	КонецЕсли;
	Если ДатаВыполнения > СрокИсполнения Тогда
		//Элементы.ДатаВыполнения.Нач;
		Элементы.ДатаВыполнения.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруРеквизитовФормы(КомментарийРавноПричинеВозврата = Ложь)
	
	Результат = новый Структура();
	
	Результат.Вставить("Комментарий", Комментарии);
	Если КомментарийРавноПричинеВозврата Тогда
		Результат.Вставить("ПричинаВозврата", Комментарии);
	Иначе
		Результат.Вставить("ПричинаВозврата", ПричинаВозврата);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции



















