
&НаКлиенте
Процедура Выбрать(Команда)
	ТекДанные = Элементы.Список.ДанныеСтроки(Элементы.Список.ТекущаяСтрока);
	Оповестить("ОбновитьУИДВЗАявке", ТекДанные.УИДСтроки);
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	Д_ЗаявкаНаОплатуЗаявкаБезнал.НомерСтроки
	//			   |ИЗ
	//			   |	Документ.Д_ЗаявкаНаОплату.ЗаявкаБезнал КАК Д_ЗаявкаНаОплатуЗаявкаБезнал
	//			   |ГДЕ
	//			   |	Д_ЗаявкаНаОплатуЗаявкаБезнал.Ссылка = &Ссылка
	//			   |	И Д_ЗаявкаНаОплатуЗаявкаБезнал.УИДСтроки = &ТекущаяСтрока";
	//
	//Запрос.УстановитьПараметр("Ссылка", Параметры.ДокОснование);
	//Запрос.УстановитьПараметр("ТекущаяСтрока", Параметры.ТекущаяСтрока);
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	//ИндексСтроки = Выборка.НомерСтроки - 1;	
	//	
	//КонецЦикла;
	
	
	Список.Параметры.УстановитьЗначениеПараметра("ДокОснование", Параметры.ДокОснование);
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеСтрокиГрафика", ПоказатьВсеСтрокиДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеСтрокиГрафикаПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеСтрокиГрафика", ПоказатьВсеСтрокиДокумента);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Список.ТекущаяСтрока = ИндексСтроки;
КонецПроцедуры
