
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВладелецФормы.Объект.ОбъемПроизводстваДетально.Количество() Тогда
		Для каждого ТекСтрока Из ВладелецФормы.Объект.ОбъемПроизводстваДетально Цикл
			НоваяСтрока = ГрафикПроизводства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);	
		КонецЦикла;
	КонецЕсли;
	ДатаДокумента = ВладелецФормы.Объект.Дата;
	Заполнить(0);
	ОбъемИтого = ОбъемИтого();
	ФиксСтруктура = Новый ФиксированнаяСтруктура(Новый Структура("Месяц, Номенклатура", Месяц, Номенклатура));
	Элементы.ГрафикПроизводства.ОтборСтрок = ФиксСтруктура;
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИЗакрыть(Команда)
	Если НЕ ОбъемИтого = ОбъемМесячный Тогда
		Если Вопрос("Исходный объем на месяц не совпадает с детальным. Привести в соответствие исходный объем?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
			
		
		КонецЕсли; 
	КонецЕсли;
	ВладелецФормы.Объект.ОбъемПроизводстваДетально.Очистить();
	Для каждого ТекСтрока Из ГрафикПроизводства Цикл
		НоваяСтрока = ВладелецФормы.Объект.ОбъемПроизводстваДетально.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	ВладелецФормы.Модифицированность = Истина;
	Оповестить("ЕстьДетализация", Новый Структура("Месяц, Номенклатура", Месяц, Номенклатура),ВладелецФормы);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(ДниПростоя)
	КоличествоСтрок = ГрафикПроизводства.НайтиСтроки(Новый Структура("Месяц, Номенклатура", Месяц, Номенклатура, Истина)).Количество();
	Если НЕ КоличествоСтрок Тогда
		
		КоличествоДней = КоличествоДней();
		Для ИндексДня = 1 По КоличествоДней Цикл
			НоваяСтрока = ГрафикПроизводства.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Месяц = Месяц;
			НоваяСтрока.День = ИндексДня;
			Если ИндексДня = КоличествоДней Тогда //последняя строка с учетом округлений
				НоваяСтрока.Объем = ОбъемМесячный - ОбъемИтого();
			Иначе
				НоваяСтрока.Объем = Окр(ОбъемМесячный / КоличествоДней, 0);
			КонецЕсли;
			НоваяСтрока.ОбъемПоУмолчанию = НоваяСтрока.Объем;
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоДней()
	РазницаМесяцев = Месяц(Месяц) - Месяц(ДатаДокумента);
	Возврат Окр((КонецМесяца(ДобавитьМесяц(ДатаДокумента, РазницаМесяцев)) - НачалоМесяца(ДобавитьМесяц(ДатаДокумента, РазницаМесяцев))) / (60 * 60 * 24), 0);
КонецФункции // ()

&НаКлиенте
Функция ОбъемИтого()
	ОтобранныеСтроки = ГрафикПроизводства.НайтиСтроки(Новый Структура("Месяц, Номенклатура", Месяц, Номенклатура));
	ОбъемИтого = 0;
	Для каждого ТекСтрока Из ОтобранныеСтроки Цикл
		ОбъемИтого = ОбъемИтого + ТекСтрока.Объем;
	КонецЦикла; 
    Возврат ОбъемИтого;
	

КонецФункции // ()
 

&НаКлиенте
Процедура ПересчитатьОбъемы()
	КоличествоДней = КоличествоДней();
	ОтобранныеСтроки = ГрафикПроизводства.НайтиСтроки(Новый Структура("Месяц, Номенклатура", Месяц, Номенклатура, Истина));
	КоличествоСтрок = ГрафикПроизводства.НайтиСтроки(Новый Структура("Месяц, Номенклатура, Простой", Месяц, Номенклатура, Истина)).Количество();
	Для каждого ТекСтрока Из ОтобранныеСтроки Цикл
		Если ТекСтрока.Простой Тогда
			ТекСтрока.Объем = 0;
		Иначе	
			ТекСтрока.Объем = Окр(ОбъемМесячный / (КоличествоДней - КоличествоСтрок), 0);
		КонецЕсли;
	КонецЦикла;
	Если ОтобранныеСтроки.Количество() Тогда
		ТекСтрока.Объем = ТекСтрока.Объем + (ОбъемМесячный -ОбъемИтого());
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъемМесячный = Параметры.Объем;
	Номенклатура = Параметры.Номенклатура;
	Месяц = Параметры.Месяц;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПроизводстваПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбъемИтого = ОбъемИтого();
	ПересчитатьОбъемы();
КонецПроцедуры
