Функция ПолучитьСтатьюНДС(Предприятие) Экспорт
	
	ТекСтатья = Предприятие.УчетнаяПолитика.СтатьяНДС;
	Если Не ЗначениеЗаполнено(ТекСтатья) Тогда
		ТекСтатья = Справочники.СтатьиЗатрат.НайтиПоНаименованию("НДС", Истина);
	КонецЕсли;

	Возврат ТекСтатья;	

КонецФункции // ()

Функция ПолучитьСтатьюВыручки(Предприятие) Экспорт
	
	ТекСтатья = Предприятие.УчетнаяПолитика.СтатьяВыручки;
	Если Не ЗначениеЗаполнено(ТекСтатья) Тогда
		ТекСтатья = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Выручка от реализации", Истина);
	КонецЕсли;

	Возврат ТекСтатья;	

КонецФункции // ()
