Функция СчетКорректировкиСеб(Предприятие) Экспорт
	
	СчетКорректировкиСебестоимости = Предприятие.УчетнаяПолитика.СчетКорректировкиСебестоимости;
	Если Не ЗначениеЗаполнено(СчетКорректировкиСебестоимости) Тогда
		СчетКорректировкиСебестоимости = ПланыСчетов.Учетный.НайтиПоКоду("94");	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетКорректировкиСебестоимости) Тогда
		СчетКорректировкиСебестоимости = ПланыСчетов.Учетный.Счет9002();	
	КонецЕсли;
	
	Возврат СчетКорректировкиСебестоимости; 

КонецФункции // ()
