
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	Если ТипЗнч(ПараметрКоманды) = Тип("ЗадачаСсылка.Задача") Тогда
		СтруктураПараметров = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрКоманды, "БизнесПроцесс, Заявка");
		ТекБП = СтруктураПараметров.БизнесПроцесс;
		ПараметрКоманды = СтруктураПараметров.Заявка;
	Иначе
		ТекБП = БПСервер.НайтиТекущийБПСервер(ПараметрКоманды);
	КонецЕсли;
	
	Если НЕ ТекБП = Неопределено Тогда
		БПВФинальнойСтадии = БюджетныйНаСервере.ВернутьРеквизит(ТекБП, "Завершен") ИЛИ БПСервер.СравнитьСтадию("Действие5", ПараметрКоманды);
		
		ПараметрыФормы = Новый Структура("ТекЗаявка, БПВФинальнойСтадии, БизнесПроцесс", ПараметрКоманды, БПВФинальнойСтадии, ТекБП);
		СтруктураФормы = Неопределено;

		ОткрытьФорму("Справочник.СогласованиеОбщее.Форма.ФормаОповещения", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,, Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("БПВФинальнойСтадии, ПараметрКоманды, ТекБП", БПВФинальнойСтадии, ПараметрКоманды, ТекБП)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		ПоказатьПредупреждение(Неопределено, "Данный документ не имеет запущенных бизнес-процессов!");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	БПВФинальнойСтадии = ДополнительныеПараметры.БПВФинальнойСтадии;
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	ТекБП = ДополнительныеПараметры.ТекБП;
	
	
	СтруктураФормы = Результат;
	
	Если НЕ СтруктураФормы = Неопределено Тогда
		ЗаписатьБПОповещаемых(ТекБП, СтруктураФормы.СписокПользователей, СтруктураФормы.СписокПользователей2);
		Если БПВФинальнойСтадии Тогда
			Если СтруктураФормы.ЗадачаОповещения Тогда
				БПСервер.СоздатьОповещение(СтруктураФормы.СписокПользователей2, "Пользователь " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + " открыл доступ к согласованному документу " + Строка(ПараметрКоманды) + ".
				|
				|Комментарии:
				|" + СтруктураФормы.Комментарий, "Доступ: " + Строка(ПараметрКоманды), ПараметрКоманды);
			КонецЕсли;
			Если СтруктураФормы.ЗадачаОповещения Тогда
				БПСервер.СоздатьОповещение(СтруктураФормы.СписокПользователей, "Пользователь " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + " открыл доступ к согласованному документу " + Строка(ПараметрКоманды) + ".
				|
				|Комментарии:
				|" + СтруктураФормы.Комментарий, "Доступ: " + Строка(ПараметрКоманды), ПараметрКоманды);
			КонецЕсли;
		Иначе
			Если СтруктураФормы.ЗадачаОповещения Тогда
				БПСервер.СоздатьОповещение(СтруктураФормы.СписокПользователей2, "Пользователь " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + " открыл доступ к документу " + Строка(ПараметрКоманды) + ".
				|
				|Комментарии:
				|" + СтруктураФормы.Комментарий, "Доступ: " + Строка(ПараметрКоманды), ПараметрКоманды);
			КонецЕсли;
		КонецЕсли;//конец условия стадий
		
	КонецЕсли;

КонецПроцедуры

// МассивПользователей  - ознакомление
// МассивПользователей2 - доступ
Процедура ЗаписатьБПОповещаемых(ТекБП, ТекМассивПользователей, ТекМассивПользователей2)
	
	ТекБПОбъект = ТекБП.ПолучитьОбъект();
		
	Если ТипЗнч(ТекБП) = Тип("СправочникСсылка.Согласование2") ИЛИ ТипЗнч(ТекБП) = Тип("БизнесПроцессСсылка.Согласование3") Тогда
		ТЧОзнакомление = ТекБПОбъект.Адресаты;
		
		Для каждого ТекПользователь Из ТекМассивПользователей Цикл       //Ознакомление
			Если ТЧОзнакомление.Найти(ТекПользователь, "СубъектСогласования") = Неопределено Тогда
				НоваяСтрока = ТекБПОбъект.Адресаты.Добавить();
				НоваяСтрока.СубъектСогласования = ТекПользователь;	
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ТЧОзнакомление = ТекБПОбъект.ДопОповещение;
		ТЧДоступ 	   = ?(ТипЗнч(ТекБП) = Тип("СправочникСсылка.СогласованиеОбщее"), ТекБПОбъект.ДоступнаПользователям, ТекБПОбъект.ДопОповещение);
		
		Для каждого ТекПользователь Из ТекМассивПользователей Цикл        //Ознакомление
			Если ТЧОзнакомление.Найти(ТекПользователь, "Пользователь") = Неопределено Тогда
				НоваяСтрока = ТЧОзнакомление.Добавить();
				НоваяСтрока.Пользователь = ТекПользователь;	
			КонецЕсли;
		КонецЦикла;
		Если БюджетныйНаСервере.РольАдминаДоступнаСервер() Или РольДоступна("ОФК") Тогда
			Для Каждого ТекСтрокаТЧ Из ТЧОзнакомление Цикл           //Удаление из ознакомления пользователей, отсутствующих в массивах
				Если ТекМассивПользователей.Найти(ТекСтрокаТЧ.Пользователь) = Неопределено И ТекМассивПользователей2.Найти(ТекСтрокаТЧ.Пользователь) = Неопределено Тогда
					ТЧОзнакомление.Удалить(ТекСтрокаТЧ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Для каждого ТекПользователь Из ТекМассивПользователей2 Цикл       //Доступ
			Если ТЧДоступ.Найти(ТекПользователь, "Пользователь") = Неопределено Тогда
				НоваяСтрока = ТЧДоступ.Добавить();
				НоваяСтрока.Пользователь = ТекПользователь;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
		
	ТекБПОбъект.Записать();
	
КонецПроцедуры





   
