
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("СпособДоставкиПоУмолчанию", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "СпособДоставкиПоУмолчанию";
	ТекЭлОб.Значение = СпособДоставкиПоУмолчанию;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ОграничениеПравРедактированияКлючевыхСправочников", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ОграничениеПравРедактированияКлючевыхСправочников";
	ТекЭлОб.Значение = ОграничениеПравРедактированияКлючевыхСправочников;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("КонтрольМинимальнойЦеныПоТипуЦен", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "КонтрольМинимальнойЦеныПоТипуЦен";
	ТекЭлОб.Значение = КонтрольМинимальнойЦеныПоТипуЦен;
	ТекЭлОб.Записать();

   	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяОбработкаБУДокументов", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ФоноваяОбработкаБУДокументов";
	ТекЭлОб.Значение = ФоноваяОбработкаБУДокументов;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяПроверкаБУДокументов", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ФоноваяПроверкаБУДокументов";
	ТекЭлОб.Значение = ФоноваяПроверкаБУДокументов;
	ТекЭлОб.Записать();

	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ИспользоватьБизнесПроцессы", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ИспользоватьБизнесПроцессы";
	ТекЭлОб.Значение = ИспользоватьБизнесПроцессы;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ПроверятьЗаполнениеДоговоровВДокументах", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ПроверятьЗаполнениеДоговоровВДокументах";
	ТекЭлОб.Значение = ПроверятьЗаполнениеДоговоровВДокументах;
	ТекЭлОб.Записать();
	
	Константы.ИспользоватьБизнесПроцессыЗаявокСотрудников.Установить(ВключитьСправочникПодразделения);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособДоставкиПоУмолчанию = Справочники.сабМониторВнедрения.НайтиПоНаименованию("СпособДоставкиПоУмолчанию", Истина).Значение; 
	ОграничениеПравРедактированияКлючевыхСправочников = справочники.сабМониторВнедрения.НайтиПоНаименованию("ОграничениеПравРедактированияКлючевыхСправочников", Истина).Значение;
	ФоноваяОбработкаБУДокументов = справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяОбработкаБУДокументов", Истина).Значение;
	ФоноваяПроверкаБУДокументов = справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяПроверкаБУДокументов", Истина).Значение;
	ИспользоватьБизнесПроцессы = справочники.сабМониторВнедрения.НайтиПоНаименованию("ИспользоватьБизнесПроцессы", Истина).Значение;
	ПроверятьЗаполнениеДоговоровВДокументах = справочники.сабМониторВнедрения.НайтиПоНаименованию("ПроверятьЗаполнениеДоговоровВДокументах", Истина).Значение;
	КонтрольМинимальнойЦеныПоТипуЦен = справочники.сабМониторВнедрения.НайтиПоНаименованию("КонтрольМинимальнойЦеныПоТипуЦен", Истина).Значение;
	
	ВключитьСправочникПодразделения = Константы.ИспользоватьБизнесПроцессыЗаявокСотрудников.Получить();
	
	ФоноваяОбработкаБУДокументовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ФоноваяОбработкаБУДокументовПриИзмененииНаСервере()
	Элементы.ФоноваяПроверкаБУДокументов.Доступность = ФоноваяОбработкаБУДокументов;
	Если Не ФоноваяОбработкаБУДокументов Тогда
		ФоноваяПроверкаБУДокументов = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФоноваяОбработкаБУДокументовПриИзменении(Элемент)
	ФоноваяОбработкаБУДокументовПриИзмененииНаСервере();
КонецПроцедуры
