
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	ОбновитьИнтерфейсПриИзмененииФункциональныхОпций();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("СпособДоставкиПоУмолчанию", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "СпособДоставкиПоУмолчанию";
	ТекЭлОб.Значение = СпособДоставкиПоУмолчанию;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ОграничениеПравРедактированияКлючевыхСправочников", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ОграничениеПравРедактированияКлючевыхСправочников";
	ТекЭлОб.Значение = ОграничениеПравРедактированияКлючевыхСправочников;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ПроверятьЗаполнениеГоденДо", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ПроверятьЗаполнениеГоденДо";
	ТекЭлОб.Значение = ПроверятьЗаполнениеГоденДо;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ФормироватьНачисленияПоЗОтчетам", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ФормироватьНачисленияПоЗОтчетам";
	ТекЭлОб.Значение = ФормироватьНачисленияПоЗОтчетам;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ФормироватьСтрокиГрафикаОплат", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ФормироватьСтрокиГрафикаОплат";
	ТекЭлОб.Значение = ФормироватьСтрокиГрафикаОплат;
	ТекЭлОб.Записать();

	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("КонтрольМинимальнойЦеныПоТипуЦен", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "КонтрольМинимальнойЦеныПоТипуЦен";
	ТекЭлОб.Значение = КонтрольМинимальнойЦеныПоТипуЦен;
	ТекЭлОб.Записать();

   	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяОбработкаБУДокументов", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ФоноваяОбработкаБУДокументов";
	ТекЭлОб.Значение = ФоноваяОбработкаБУДокументов;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ОбрабатыватьНепроведенныеБУДокументы", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ОбрабатыватьНепроведенныеБУДокументы";
	ТекЭлОб.Значение = ОбрабатыватьНепроведенныеБУДокументы;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ОбрабатыватьНепроведенныеУУДокументы", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ОбрабатыватьНепроведенныеУУДокументы";
	ТекЭлОб.Значение = ОбрабатыватьНепроведенныеУУДокументы;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяПроверкаБУДокументов", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ФоноваяПроверкаБУДокументов";
	ТекЭлОб.Значение = ФоноваяПроверкаБУДокументов;
	ТекЭлОб.Записать();

	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ИспользоватьБизнесПроцессы", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ИспользоватьБизнесПроцессы";
	ТекЭлОб.Значение = ИспользоватьБизнесПроцессы;
	ТекЭлОб.Записать();
	Константы.ИспользоватьБизнесПроцессыИЗадачи.Установить(ИспользоватьБизнесПроцессы);
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ПроверятьЗаполнениеДоговоровВДокументах", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ПроверятьЗаполнениеДоговоровВДокументах";
	ТекЭлОб.Значение = ПроверятьЗаполнениеДоговоровВДокументах;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ИспользоватьФО", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "ИспользоватьФО";
	ТекЭлОб.Значение = Истина;
	ТекЭлОб.Записать(); 
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("СоздаватьСчетаПокупателямСДатойРеализации", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "СоздаватьСчетаПокупателямСДатойРеализации";
	ТекЭлОб.Значение = СоздаватьСчетаПокупателямСДатойРеализации;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("НеУчитыватьРезервыПриходаДляКонтроляОстатковВЗаказахКлиентов", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "НеУчитыватьРезервыПриходаДляКонтроляОстатковВЗаказахКлиентов";
	ТекЭлОб.Значение = НеУчитыватьРезервыПриходаДляКонтроляОстатковВЗаказахКлиентов;
	ТекЭлОб.Записать();
	
	ТекЭл = Справочники.сабМониторВнедрения.НайтиПоНаименованию("СрезОстатковНаДатуЗаказа", Истина);
	
	Если ЗначениеЗаполнено(ТекЭл) Тогда
		ТекЭлОб = ТекЭл.ПолучитьОбъект();
	Иначе
		ТекЭлОб = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	
	ТекЭлОб.Наименование = "СрезОстатковНаДатуЗаказа";
	ТекЭлОб.Значение = СрезОстатковНаДатуЗаказа;
	ТекЭлОб.Записать();

	
	Константы.сабПодсистемаКазначейство.Установить(сабПодсистемаКазначейство);
	Константы.сабПодсистемаБюджетирование.Установить(сабПодсистемаБюджетирование);
	Константы.сабПодсистемаДокументооборот.Установить(сабПодсистемаДокументооборот);
	Константы.сабПодсистемаОперативныйУчет.Установить(сабПодсистемаОперативныйУчет);
	Константы.сабОперативныйРежимРаботы.Установить(сабОперативныйРежимРаботы);
	
	Константы.ИспользоватьБизнесПроцессыЗаявокСотрудников.Установить(ВключитьСправочникПодразделения);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособДоставкиПоУмолчанию = Справочники.сабМониторВнедрения.НайтиПоНаименованию("СпособДоставкиПоУмолчанию", Истина).Значение; 
	ОграничениеПравРедактированияКлючевыхСправочников = справочники.сабМониторВнедрения.НайтиПоНаименованию("ОграничениеПравРедактированияКлючевыхСправочников", Истина).Значение;
	ПроверятьЗаполнениеГоденДо = справочники.сабМониторВнедрения.НайтиПоНаименованию("ПроверятьЗаполнениеГоденДо", Истина).Значение;
	ФормироватьНачисленияПоЗОтчетам = справочники.сабМониторВнедрения.НайтиПоНаименованию("ФормироватьНачисленияПоЗОтчетам", Истина).Значение;
	ФормироватьСтрокиГрафикаОплат = справочники.сабМониторВнедрения.НайтиПоНаименованию("ФормироватьСтрокиГрафикаОплат", Истина).Значение;
	ФоноваяОбработкаБУДокументов = справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяОбработкаБУДокументов", Истина).Значение;
	ФоноваяПроверкаБУДокументов = справочники.сабМониторВнедрения.НайтиПоНаименованию("ФоноваяПроверкаБУДокументов", Истина).Значение;
	ОбрабатыватьНепроведенныеБУДокументы = справочники.сабМониторВнедрения.НайтиПоНаименованию("ОбрабатыватьНепроведенныеБУДокументы", Истина).Значение;
	ОбрабатыватьНепроведенныеУУДокументы = справочники.сабМониторВнедрения.НайтиПоНаименованию("ОбрабатыватьНепроведенныеУУДокументы", Истина).Значение;
	ИспользоватьБизнесПроцессы = справочники.сабМониторВнедрения.НайтиПоНаименованию("ИспользоватьБизнесПроцессы", Истина).Значение;
	ПроверятьЗаполнениеДоговоровВДокументах = справочники.сабМониторВнедрения.НайтиПоНаименованию("ПроверятьЗаполнениеДоговоровВДокументах", Истина).Значение;
	КонтрольМинимальнойЦеныПоТипуЦен = справочники.сабМониторВнедрения.НайтиПоНаименованию("КонтрольМинимальнойЦеныПоТипуЦен", Истина).Значение;
	СоздаватьСчетаПокупателямСДатойРеализации = справочники.сабМониторВнедрения.НайтиПоНаименованию("СоздаватьСчетаПокупателямСДатойРеализации", Истина).Значение;
	НеУчитыватьРезервыПриходаДляКонтроляОстатковВЗаказахКлиентов = справочники.сабМониторВнедрения.НайтиПоНаименованию("НеУчитыватьРезервыПриходаДляКонтроляОстатковВЗаказахКлиентов", Истина).Значение;
	СрезОстатковНаДатуЗаказа = справочники.сабМониторВнедрения.НайтиПоНаименованию("СрезОстатковНаДатуЗаказа", Истина).Значение;

	сабПодсистемаКазначейство = Константы.сабПодсистемаКазначейство.Получить();
	сабПодсистемаБюджетирование = Константы.сабПодсистемаБюджетирование.Получить();
	сабОперативныйРежимРаботы = Константы.сабОперативныйРежимРаботы.Получить();
	сабПодсистемаДокументооборот = Константы.сабПодсистемаДокументооборот.Получить();
	сабПодсистемаОперативныйУчет = Константы.сабПодсистемаОперативныйУчет.Получить();
	
	ВключитьСправочникПодразделения = Константы.ИспользоватьБизнесПроцессыЗаявокСотрудников.Получить();
	
	ФоноваяОбработкаБУДокументовПриИзмененииНаСервере();
	
	ТекСтрокаЛицензии = Справочники.сабМониторВнедрения.НайтиПоНаименованию("Ключ лицензии", Истина);
	СтруктураЛицензий = РегистрыСведений.сабСоответствияОрганизацийПредприятиям.ПроверитьЛицензиюМодуля();
	Если СтруктураЛицензий.ПолныеЛицензии.Найти(ТекСтрокаЛицензии.Значение) = Неопределено Тогда
		Элементы.ИспользоватьБизнесПроцессы.Доступность = Ложь;
		Элементы.ВключитьСправочникПодразделения.Доступность = Ложь;
		Элементы.сабПодсистемаДокументооборот.Доступность = Ложь;
	Иначе
		Элементы.Декорация1.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ФоноваяОбработкаБУДокументовПриИзмененииНаСервере()
	Элементы.ФоноваяПроверкаБУДокументов.Доступность = ФоноваяОбработкаБУДокументов;
	Если Не ФоноваяОбработкаБУДокументов Тогда
		ФоноваяПроверкаБУДокументов = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФоноваяОбработкаБУДокументовПриИзменении(Элемент)
	ФоноваяОбработкаБУДокументовПриИзмененииНаСервере();
КонецПроцедуры
