
&НаКлиенте
Процедура ОК(Команда)
	МассивРецензентов = Новый Массив;
	Для каждого ТекРецензент Из Рецензенты Цикл
		МассивРецензентов.Добавить(ТекРецензент.Пользователь);
	КонецЦикла; 
	Закрыть(МассивРецензентов);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Рецензенты.Очистить();
	Если Параметры.Свойство("Рецензенты") Тогда
		Для каждого ТекРецензент Из Параметры.Рецензенты Цикл
			НоваяСтрока = Рецензенты.Добавить();
			НоваяСтрока.Пользователь = ТекРецензент;		
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РецензентыПользовательПриИзменении(Элемент)
	НетВБазе = БюджетныйНаСервере.ВернутьРеквизит(Элементы.Рецензенты.ТекущиеДанные.Пользователь, "НеУчаствуетВДокументообороте");
	Если НетВБазе Тогда
		Если Вопрос("Пользователь " + Строка(Элементы.Рецензенты.ТекущиеДанные.Пользователь) + " не участвует в документообороте, т.к. не имеет доступа к базе. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Элементы.Рецензенты.ТекущиеДанные.Пользователь = "";
			Возврат;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

