
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	СписокТипов = Новый СписокЗначений;
	Номен = Параметры.Ключ;
	Ссылки = Новый Массив;
	Ссылки.Добавить(Номен);
	ТабСсылки = НайтиПоСсылкам(Ссылки);
	Для каждого Стр из ТабСсылки цикл 
		Если НЕ Метаданные.Документы.Содержит(Стр.Метаданные) тогда
			Продолжить;
		иначе
			Если Стр.Метаданные.Синоним = "Регламентная операция" ИЛИ Стр.Метаданные.Синоним = "Счет покупателю" ИЛИ Стр.Метаданные.Синоним = "Закрытие периода (упр)" тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СписокСсылок.Добавить();
			НоваяСтрока.Документ = Стр.Данные;
			НоваяСтрока.ТипДокумента = Стр.Метаданные.Синоним;
			Если СписокТипов.НайтиПоЗначению(Стр.Метаданные.Синоним) = Неопределено тогда 
				СписокТипов.Добавить(Стр.Метаданные.Синоним);	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	СписокСсылок.Сортировать("Документ");
	
	Если СписокТипов.НайтиПоЗначению("Оприходование ТМЦ (упр)") = Неопределено тогда
		СписокТипов.Добавить("Оприходование ТМЦ (упр)");	
	КонецЕсли;
	Если СписокТипов.НайтиПоЗначению("Списание ТМЦ (упр)") = Неопределено тогда
		СписокТипов.Добавить("Списание ТМЦ (упр)");	
	КонецЕсли; 
	Если СписокТипов.НайтиПоЗначению("Инвентаризация ТМЦ (упр)") = Неопределено тогда
		СписокТипов.Добавить("Инвентаризация ТМЦ (упр)");	
	КонецЕсли; 
	
	Для каждого СтрокаСписка из СписокТипов цикл 
		Элементы.ТипДокумента.СписокВыбора.Добавить(СтрокаСписка.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	Элементы.СписокСсылок.ОтборСтрок = Новый ФиксированнаяСтруктура("ТипДокумента",ТипДокумента); 
КонецПроцедуры
