
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "Организация") = БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "ОрганизацияПолучатель") Тогда
		Сообщение = Новый СообщениеПользователю;
		
		ОбработчикОповещения = Новый ОписаниеОповещения("ПодтверждениеВопроса", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды));
		ПоказатьВопрос(ОбработчикОповещения, "При перемещении внутри одной организации необходимо печатать ТОРГ-13. Вы уверены, что хотите продолжить?", РежимДиалогаВопрос.ДаНет);
		//Сообщение.Текст = "При перемещении внутри одной организации необходимо печатать ТОРГ-13";
		//Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ПечатьТОРГ12НаСервереНаКлиенте(ПараметрКоманды)
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПечатьТОРГ12НаСервереНаКлиенте(ДополнительныеПараметры.ПараметрКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТОРГ12НаСервереНаКлиенте(ПараметрыКоманды)
	
	ТабДок = ПечатьТОРГ12НаСервере(ПараметрыКоманды);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.АвтоМасштаб = Истина;
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента");
	ФормаПечати.Результат = ТабДок;
	ФормаПечати.Открыть();
	
	

КонецПроцедуры
 


Функция ПечатьТОРГ12НаСервере(ПараметрКоманды)
	
	Возврат Документы.УЧ_ПеремещениеТоваров.ПечатьТОРГ12(ПараметрКоманды);
	
КонецФункции