
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПолучитьФорму("Отчет.НоменклатураПоПоступлениюВРозничныхЦенах.ФормаОбъекта");
	КомпоновщикНастроек = Форма.Отчет.КомпоновщикНастроек;

	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "Регистратор", ПараметрКоманды);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек.ПользовательскиеНастройки, "Период", БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "Дата"));	
	
	//Установим Отбор
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = "Документ" Тогда
			ИдНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементНастроек Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ЭлементНастроек.ИдентификаторПользовательскойНастройки = ИдНастройки Тогда
			ЭлементНастроек.ПравоеЗначение = ПараметрКоманды;
			ЭлементНастроек.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Форма.СкомпоноватьРезультат();
	
	Форма.Открыть();

КонецПроцедуры

