
&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	СписокЗначенией = Новый СписокЗначений;
	СписокЗначенией.Добавить("Файл");
	СписокЗначенией.Добавить("Внутренний документ");
	ТекЗнач = ВыбратьИзСписка(СписокЗначенией,,);
	Если Не ТекЗнач = Неопределено Тогда
		Если ТекЗнач.Значение = "Файл" Тогда
			ОткрытьФорму("Справочник.Файлы.ФормаВыбора",,Элемент);
		Иначе
			ТекФорма = ПолучитьФорму("ЖурналДокументов.ВнутренниеДокументы.ФормаСписка", Новый Структура("РежимВыбора", Истина) ,Элемент);
			//ТекФорма.Элементы.Список.РежимВыбора = Истина;
			ТекФорма.Открыть();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.Объект) Тогда
		Элементы.Объект.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Объект.УстановитьДействие("НачалоВыбора", "ОбъектНачалоВыбора");
		Запись.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПрикрепленныеФайлы");
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	БПСервер.ПроверитьВозможностьУдаленияЗаписиРегистраПрикрепленныхОбъектов(Запись);
КонецПроцедуры
