&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЕстьДубль() Тогда
		Оповещение = Новый ОписаниеОповещения();
		ПоказатьПредупреждение(Оповещение, "Элемент справочника с данным типом документа уже введен. Текущий элемент записан не будет");
		Отказ = Истина;
	КонецЕсли;
	Объект.Наименование = Объект.ТипДокументаДляОповещения;
КонецПроцедуры

&НаСервере
Функция ЕстьДубль()
	
	Спр = Справочники.сабСписокОповещаемыхПриСозданииДокумента.НайтиПоНаименованию(Объект.ТипДокументаДляОповещения);
	Если (Спр <> Объект.Ссылка) И (ЗначениеЗаполнено(Спр)) Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции     