Процедура НоваяСтрокаРегистраБух(
	Движения,
	Дата,
	Предприятие,
	Сценарий,
	Содержание,
	СчетДт,
	СубконтоДт1,
	СубконтоДт2,
	СубконтоДт3,
	ПодразделениеДт,
	КоличествоДт,
	ВалютаДт,
	ВалСуммаДт,
	СчетКт,
	СубконтоКт1,
	СубконтоКт2,
	СубконтоКт3,
	ПодразделениеКт,
	КоличествоКт,
	ВалютаКт,
	ВалСуммаКт,
	Сумма,
	Приход,
	ФинЦФО = Неопределено,
	ФинПодразделениеЦФО = Неопределено)	
	
	Условие_79_55 = (СчетДт = ПланыСчетов.Учетный.Счет5501() И СчетКт.Родитель = ПланыСчетов.Учетный.Счет79()) ИЛИ (СчетКт = ПланыСчетов.Учетный.Счет5501() И СчетДт.Родитель = ПланыСчетов.Учетный.Счет79());
	
	Движение = Движения.Учетный.Добавить();
	Движение.Период = Дата;
	Движение.Предприятия = Предприятие;
	Движение.СценарийПлана = Сценарий;
	Движение.Содержание = Содержание;
	Если Приход Тогда
		Движение.СчетДт = СчетДт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДт,1,СубконтоДт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДт,2,СубконтоДт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДт,3,СубконтоДт3);
		
		Если СчетДт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеДт = ПодразделениеДт;	
		КонецЕсли;
		
		
		Если СчетДт.Количественный Тогда
			Движение.КоличествоДт = КоличествоДт;
		КонецЕсли;
		Если СчетДт.Валютный И (УЧ_Сервер.ДенежныйСчет(СчетДт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаДт = ВалютаДт;	
			Движение.ВалютнаяСуммаДт = ВалСуммаДт;	
		КонецЕсли;
		
		//Если СчетДт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
		
		
		
		Движение.СчетКт = СчетКт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетКт,1,СубконтоКт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетКт,2,СубконтоКт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетКт,3,СубконтоКт3);
		
		Если СчетКт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеКт = ПодразделениеКт;	
		КонецЕсли;
		Если СчетКт.Количественный Тогда
			Движение.КоличествоКт = КоличествоКт;
		КонецЕсли;
		Если СчетКт.Валютный И (УЧ_Сервер.ДенежныйСчет(СчетКт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаКт = ВалютаКт;	
			Движение.ВалютнаяСуммаКт = ВалСуммаКт;	
		КонецЕсли;
		
		//Если СчетКт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
	Иначе
		
		Движение.СчетКт = СчетДт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетДт,1,СубконтоДт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетДт,2,СубконтоДт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт,СчетДт,3,СубконтоДт3);
		
		Если СчетДт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеКт = ПодразделениеДт;	
		КонецЕсли;
		Если СчетДт.Количественный Тогда
			Движение.КоличествоКт = КоличествоДт;
		КонецЕсли;
		Если СчетДт.Валютный И (УЧ_Сервер.ДенежныйСчет(СчетДт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаКт = ВалютаДт;	
			Движение.ВалютнаяСуммаКт = ВалСуммаДт;	
		КонецЕсли;
		
		//Если СчетДт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
		
		
		
		Движение.СчетДт = СчетКт;
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетКт,1,СубконтоКт1);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетКт,2,СубконтоКт2);
		УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетКт,3,СубконтоКт3);
		
		Если СчетКт.УчетПоПодразделениям Тогда
			Движение.ПодразделениеДт = ПодразделениеКт;	
		КонецЕсли;
		Если СчетКт.Количественный Тогда
			Движение.КоличествоДт = КоличествоКт;
		КонецЕсли;
		Если СчетКт.Валютный  И (УЧ_Сервер.ДенежныйСчет(СчетКт) ИЛИ Предприятие.ВедетсяВалютныйУчет) Тогда
			Движение.ВалютаДт = ВалютаКт;	
			Движение.ВалютнаяСуммаДт = ВалСуммаКт;	
		КонецЕсли;				
		
		//Если СчетКт.УчетПоЦФО Тогда
		//	Движение.ЦФО = Предприятие;
		//	Движение.ПодразделениеЦФО = ?(ЗначениеЗаполнено(ПодразделениеДт), ПодразделениеДт, ПодразделениеКт);
		//КонецЕсли;
		
	КонецЕсли;	
	Движение.Сумма = Сумма;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Учетный.Записывать = Истина;
	
	Транзит79 = Константы.сабУЧ_ИспользоватьПереводы.Получить();
	
	Для каждого ТекСтрока Из Состав Цикл
		
		Если Транзит79 Тогда
			//выручка проекта1
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			Предприятие,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			Счет,
			ТекСтрока.Субконто1,
			ТекСтрока.Субконто2,
			ТекСтрока.Субконто3, 						//СубконтоДт3
			Подразделение, 									//ПодразделениеДт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			СчетДохода,				//счетКт
			КорСубконто1,				//СубконтоКт1	
			КорСубконто2,				//СубконтоКт2 //добавил д1 16.06.16
			КорСубконто3,				//СубконтоКт3
			Подразделение,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
			НоваяСтрокаРегистраБух(
			Движения,
			Дата, 								//дата 
			Предприятие, 							//предприятие
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина), 	//сценарий
			"(возм-е затрат) " + ?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, ?(ТекСтрока.Содержание = "", Комментарий, Комментарий + "
			|" + ТекСтрока.Содержание)),
			Счет, 							//счетДт
			ТекСтрока.Субконто1, 						//СубконтоДт1
			ТекСтрока.Субконто2, 						//СубконтоДт2
			ТекСтрока.Субконто3, 						//СубконтоДт3
			, 									//ПодразделениеДт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			ТекСтрока.Субконто1,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Ложь,
			,
			);			//СчетДт = СчетДт (приход)
			
			НоваяСтрокаРегистраБух(
			Движения,
			Дата, 								//дата 
			ТекСтрока.Субконто1, 							//предприятие
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина), 	//сценарий
			"(возм-е затрат) " + ?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, ?(ТекСтрока.Содержание = "", Комментарий, Комментарий + "
			|" + ТекСтрока.Содержание)),
			Счет, 							//счетДт
			Предприятие, 						//СубконтоДт1
			ТекСтрока.ВнутреннийДоговор, 						//СубконтоДт2
			, 						//СубконтоДт3
			, 									//ПодразделениеДт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			Предприятие,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
			//затраты проекта2
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			ТекСтрока.Субконто1,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			ТекСтрока.СчетЗатрат,
			ТекСтрока.КорСубконто1,
			ТекСтрока.КорСубконто2,
			ТекСтрока.КорСубконто3, 						//СубконтоДт3
			?(ТекСтрока.Субконто1.УчетПоПодразделениям, ТекСтрока.Подразделение, ТекСтрока.Субконто1.ВидДеятельности), 									//ПодразделениеДт
			ТекСтрока.Количество, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			Счет,				//счетКт
			Предприятие,				//СубконтоКт1	
			ТекСтрока.ВнутреннийДоговор,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			?(ТекСтрока.Субконто1.УчетПоПодразделениям, ТекСтрока.Подразделение, ТекСтрока.Субконто1.ВидДеятельности),			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
		Иначе
			//выручка проекта1
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			Предприятие,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			ТекСтрока.Субконто1,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			СчетДохода,				//счетКт
			КорСубконто1,				//СубконтоКт1	
			КорСубконто2,				//СубконтоКт2 //добавил д1 16.06.16
			КорСубконто3,				//СубконтоКт3
			Подразделение,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
			
			//затраты проекта2
			НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			ТекСтрока.Субконто1,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			?(ПустаяСтрока(Комментарий), ТекСтрока.Содержание, Комментарий + "
			|" + ТекСтрока.Содержание),
			ТекСтрока.СчетЗатрат,
			ТекСтрока.КорСубконто1,
			ТекСтрока.КорСубконто2,
			ТекСтрока.КорСубконто3, 						//СубконтоДт3
			?(ТекСтрока.Субконто1.УчетПоПодразделениям, ТекСтрока.Подразделение, ТекСтрока.Субконто1.ВидДеятельности), 									//ПодразделениеДт
			ТекСтрока.Количество, 									//КоличествоДт
			, 							//ВалютаДт
			, 					//ВалСуммаДт
			ПланыСчетов.Учетный.Счет5502(),						//счетКт
			Предприятие,				//СубконтоКт1	
			,				//СубконтоКт2 //добавил д1 16.06.16
			,				//СубконтоКт3
			,			//ПодразделениеКт
			,									//КоличествоДт
			,									//ВалютаКт
			,                                   //ВалСуммаКт
			ТекСтрока.Сумма,                     //Сумма
			Истина,
			,
			);			//СчетДт = СчетДт (приход)
		КонецЕсли;
		
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	сабОбщегоНазначенияБУХ.сабОбработкиЗаполненияУчпетныхДокументовОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
