
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Бронирование товара " + Параметры.Номенклатура +  " по складу: " + Параметры.Склад;
	Для Каждого СтрокаМассивЗаказов Из Параметры.МассивСтуктурЗабронированоПоЗаказамТЗ Цикл
		НоваяСтрокаТЗБронирование = ТЗБронирование.Добавить();
		НоваяСтрокаТЗБронирование.Заказ = СтрокаМассивЗаказов.Заказ;
		НоваяСтрокаТЗБронирование.Количество = СтрокаМассивЗаказов.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗБронированиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Заказ);   
	
КонецПроцедуры
