Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.3.1");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Вставить("РассылкаОтчетов", Истина);
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Отчет по оплаченным счетам покупателей'");
	НоваяКоманда.Идентификатор = "сабОтчетПоСчетамПокупателей";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	//НоваяКоманда.Добавить("РассылкаОтчетов", Истина);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции