
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	
	Комментарий = "";
	СтандартнаяОбработка = Истина;
	Отказ = сабОперОбщегоНазначения.ПроверкаСозданияНаОснованииНаСервере(ПараметрКоманды, Комментарий, СтандартнаяОбработка);
	Если Отказ.Признак = "##УжеСоздан" Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("Отказ, ПараметрыВыполненияКоманды, ПараметрКоманды", Отказ, ПараметрыВыполненияКоманды, ПараметрКоманды)), "На основании Заказ поставщику уже введен документ " + Отказ.Ссылка + ". Открыть созданный документ?", РежимДиалогаВопрос.ДаНетОтмена);
	ИначеЕсли Отказ.Признак = "##НеПроведен" Тогда
		ВызватьИсключение "Текущий жокумент не проведен. Ввод на основании не возможен.";
	Иначе
		ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
		ОткрытьФорму("Документ.Д_ЗаявкаНаФинансирование.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Отказ = ДополнительныеПараметры.Отказ;
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура("Ключ", Отказ.Ссылка);
		ОткрытьФорму("Документ.Д_ЗаявкаНаФинансирование.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ПараметрыФормы = Новый Структура("Основание", ДополнительныеПараметры.ПараметрКоманды);
		ОткрытьФорму("Документ.Д_ЗаявкаНаФинансирование.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

