
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Параметры.Пользователь);
	Пользователь = Параметры.Пользователь;	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ТекФорма = ПолучитьФорму("РегистрСведений.ОсновныеДолжностиПредприятия.ФормаЗаписи");
		ТекФорма.Запись.Сотрудник = Пользователь;
		ТекФорма.Открыть();
		
		
	КонецЕсли;
КонецПроцедуры
