
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПолучитьФорму("Документ.БП_Поручение.Форма.ФормаНовый");
	ДанныеФормы = Форма.Объект;
	ЗаполнитьФормуНаСервере(ДанныеФормы, ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере(ДанныеФормы, ВнутреннийДокумент)
	
	ДанныеФормы.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДанныеФормы.Документ = ВнутреннийДокумент;
	
	Если ТипЗнч(ВнутреннийДокумент) = Тип("ДокументСсылка.БП_Поручение") Тогда
		ДанныеФормы.Тема = ВнутреннийДокумент.Тема;
		ДанныеФормы.Описание = ВнутреннийДокумент.Описание;
		
		ОтобранныеСтроки = ВнутреннийДокумент.СписокИсполнителей.НайтиСтроки(Новый Структура("Исполнитель", ПараметрыСеанса.ТекущийПользователь));
		Если ОтобранныеСтроки.Количество() Тогда
			ДанныеФормы.ОбщийСрокИсполнения = ОтобранныеСтроки[0].СрокИсполнения;
		Иначе	
			ДанныеФормы.ОбщийСрокИсполнения = ВнутреннийДокумент.ОбщийСрокИсполнения;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВнутреннийДокумент) = Тип("СправочникСсылка.Задача") Тогда
		ДанныеФормы.Документ = ВнутреннийДокумент.Заявка;		
	КонецЕсли;
	
КонецПроцедуры	
