
Процедура Печать(ТабДок, Ссылка, РецензентКомментарий = Неопределено, МассивОткрытыхИсторий = Неопределено, МассивОткрытыхИсторийАвтора = Неопределено) Экспорт
	
	Макет = Документы.Д_СогласованиеМассиваДокументов.ПолучитьМакет("Печать");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаСтатус = Макет.ПолучитьОбласть("ШапкаСтатус");
	ОбластьЗаголовокНачисления = Макет.ПолучитьОбласть("ЗаголовокНачисления");
	ОбластьСтрокаНачисления = Макет.ПолучитьОбласть("СтрокаНачисления");
	ОбластьПодвалНачисления = Макет.ПолучитьОбласть("ПодвалНачисления");
	
	ТабДок.Очистить();
	
	//////////////////////////вывод СЗ на печать
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка.Дата,
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка.Номер,
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка.ВидСЗ,
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка.Предприятие КАК ПредприятиеШапка,
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка.Комментарий КАК КомментарийШапка,
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка.Автор,
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка.Кому,
	               |	Д_СогласованиеМассиваДокументовДокументы.Документ,
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка
	               |ПОМЕСТИТЬ ВТ_ДанныеПоСЗ
	               |ИЗ
	               |	Документ.Д_СогласованиеМассиваДокументов.ДокументыДляСогласования КАК Д_СогласованиеМассиваДокументовДокументы
	               |ГДЕ
	               |	Д_СогласованиеМассиваДокументовДокументы.Ссылка В(&Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПоСЗ.Дата,
	               |	ВТ_ДанныеПоСЗ.Номер,
	               |	ВТ_ДанныеПоСЗ.ВидСЗ,
	               |	ВТ_ДанныеПоСЗ.ПредприятиеШапка,
	               |	ВТ_ДанныеПоСЗ.КомментарийШапка,
	               |	ВТ_ДанныеПоСЗ.Автор,
	               |	ВТ_ДанныеПоСЗ.Кому,
	               |	ВТ_ДанныеПоСЗ.Ссылка
	               |ИЗ
	               |	ВТ_ДанныеПоСЗ КАК ВТ_ДанныеПоСЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УЧ_НачислениеЗПТабличнаяЧасть.Сотрудник,
	               |	УЧ_НачислениеЗПТабличнаяЧасть.Сумма,
	               |	УЧ_НачислениеЗПТабличнаяЧасть.ВидНачисления,
	               |	УЧ_НачислениеЗПТабличнаяЧасть.Предприятие,
	               |	УЧ_НачислениеЗПТабличнаяЧасть.Подразделение,
	               |	УЧ_НачислениеЗПТабличнаяЧасть.Комментарий,
	               |	ВТ_ДанныеПоСЗ.Ссылка
	               |ИЗ
	               |	ВТ_ДанныеПоСЗ КАК ВТ_ДанныеПоСЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УЧ_НачислениеЗП.ТабличнаяЧасть КАК УЧ_НачислениеЗПТабличнаяЧасть
	               |		ПО ВТ_ДанныеПоСЗ.Документ = УЧ_НачислениеЗПТабличнаяЧасть.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаШапка = Результат[1].Выбрать();
	ВыборкаНачисления = Результат[2].Выгрузить();
	
	//получаем прикрепленные объекты
	ВыборкаПоФайлам = БПСервер.ПолучитьПрикрепленныеОбъектыДляПечати(Ссылка);
		
	Пока ВыборкаШапка.Следующий() Цикл
		
		ОбластьЗаголовок.Параметры.Ссылка = ВыборкаШапка.Ссылка;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка.Параметры.Дата = ВыборкаШапка.Дата;
		ОбластьШапка.Параметры.Комментарий = ВыборкаШапка.КомментарийШапка;
		ОбластьШапка.Параметры.ВидСЗ = ВыборкаШапка.ВидСЗ;
		// имя пользователя и должность
		ИмяДолжность = БПСервер.ПолучитьИмяИДолжностьПользователя(ВыборкаШапка.Дата, ?(ПустаяСтрока(ВыборкаШапка.Автор), ВыборкаШапка.Предприятие.Финансист, ВыборкаШапка.Автор));
		ОбластьШапка.Параметры.ОтКого = ?(ЗначениеЗаполнено(ИмяДолжность.ПредставлениеПользователя), ИмяДолжность.ПредставлениеПользователя + " ", "") + ?(ЗначениеЗаполнено(ИмяДолжность.Должность), ИмяДолжность.Должность, "");	
		
		ОбластьШапка.Параметры.Кому = ВыборкаШапка.Кому;
		ОбластьШапка.Параметры.ЦФО = ВыборкаШапка.ПредприятиеШапка;
		ТабДок.Вывести(ОбластьШапка);
		
		// статус 
		ОбластьШапкаСтатус.Параметры.ТекущийСтатус = БПСервер.ПолучитьТекущуюТочкуМаршрута(ВыборкаШапка.Ссылка);
		ТабДок.Вывести(ОбластьШапкаСтатус);
		
		//Пока ВыборкаПоФайлам.Следующий() Цикл 
		//	ОбластьПрикрепление.Параметры.Вложение = Строка(ВыборкаПоФайлам.Файл);
		//	ОбластьПрикрепление.Параметры.РасшифровкаВложение = ВыборкаПоФайлам.Файл; //Новый Структура("Файл", ВыборкаПоФайлам.Файл)
		//	ТабДок.Вывести(ОбластьПрикрепление);
		//КонецЦикла;	
		
		ТабДок.Вывести(ОбластьЗаголовокНачисления);
		
		ТаблицаНачислений = ВыборкаНачисления.НайтиСтроки(Новый Структура("Ссылка", ВыборкаШапка.Ссылка));
		Для Каждого СтрокаНачислений Из ТаблицаНачислений Цикл
			ОбластьСтрокаНачисления.Параметры.Заполнить(СтрокаНачислений);
			ТабДок.Вывести(ОбластьСтрокаНачисления);
		КонецЦикла;	
		
		ТабДок.Вывести(ОбластьПодвалНачисления);
		
		БПСервер.ПоказатьРецензентов(ТабДок, ВыборкаШапка.Ссылка, Неопределено, Ссылка, "Штампы", РецензентКомментарий, МассивОткрытыхИсторий, МассивОткрытыхИсторийАвтора);
		
	КонецЦикла;
	
КонецПроцедуры
