
&НаКлиенте
Процедура УУ_ПослеЗаписиПосле(ПараметрыЗаписи)
	Оповестить("ОбновитьОбработкуЗаявок");
КонецПроцедуры

&НаКлиенте
Процедура УУ_ПриОткрытииПеред(Отказ) 
	//-lud 19/10/22 Вся проверка вынесена в модуль объекта, в процедуру Обработка заполнения
	//Отказ = сабОперОбщегоНазначенияНаКлиенте.ПроверкаСозданияНаОснованииНаКлиенте(Объект);
	//Если Отказ Тогда
	//	Возврат;	
	//КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Добавить(
	"УпрГруппа",
	Тип("ГруппаФормы"),
	ЭтаФорма);
	
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Поведение  = ПоведениеОбычнойГруппы.Свертываемая;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Группа.Заголовок = "Реквизиты (Управленка):";
	
	ПолеВвода = Элементы.Добавить("сабЗаявка", Тип("ПолеФормы"), Группа); 
	ПолеВвода.Заголовок = "Заявка на оплату";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Заявка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ЗаявкааПриИзмененииъ");
	
	ПолеВвода = Элементы.Добавить("сабСтрокаГрафика", Тип("ПолеФормы"), Группа); 
	ПолеВвода.Заголовок = "Строка графика заявки";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.УИДСтроки";
	
	ЗаявкаПриИзмененииъНаСервере(Ложь);
			
КонецПроцедуры

&НаСервере
Процедура ЗаявкаПриИзмененииъНаСервере(Изменять)
	
	Если ЗначениеЗаполнено(Объект.Заявка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	сабГрафикПлатежей.УИДСтрокиДокумента КАК УИДСтрокиДокумента,
		|	сабГрафикПлатежей.ДатаПлатежа КАК ДатаПлатежа,
		|	сабГрафикПлатежей.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.сабГрафикПлатежей КАК сабГрафикПлатежей
		|ГДЕ
		|	сабГрафикПлатежей.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ", Объект.Заявка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Элементы.сабСтрокаГрафика.РежимВыбораИзСписка = Истина;
		Элементы.сабСтрокаГрафика.СписокВыбора.Очистить();
		Если Изменять Тогда
			Объект.УИДСтроки = "";
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			Если Элементы.сабСтрокаГрафика.СписокВыбора.НайтиПоЗначению(Выборка.УИДСтрокиДокумента) = Неопределено Тогда
				Элементы.сабСтрокаГрафика.СписокВыбора.Добавить(Выборка.УИДСтрокиДокумента, "От " + Формат(Выборка.ДатаПлатежа, "ДФ=dd.MM.yyyy") + " на сумму " + Строка(Выборка.Сумма));
			КонецЕсли;	
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Объект.УИДСтроки) И Элементы.сабСтрокаГрафика.СписокВыбора.НайтиПоЗначению(Объект.УИДСтроки) = Неопределено Тогда
			Элементы.сабСтрокаГрафика.СписокВыбора.Добавить(Объект.УИДСтроки);
		КонецЕсли;
		
		Если Изменять И Элементы.сабСтрокаГрафика.СписокВыбора.Количество() = 1 Тогда
			Объект.УИДСтроки = Элементы.сабСтрокаГрафика.СписокВыбора[0].Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкааПриИзмененииъ(Элемент)
	ЗаявкаПриИзмененииъНаСервере(Истина);
КонецПроцедуры
