
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Новый Структура("Сотрудник, ВидНачисления", Сотрудник, ВидНачисления));
	СтруктураПараметров.Вставить("ТЧ", ПолучитьТЧ());
	
	Оповестить("УЧ_НачисленияЗПОбновитьУдержания", СтруктураПараметров);
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьТЧ()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЧ.Выгрузить());
КонецФункции // ()


&НаКлиенте
Процедура ТЧПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьЗначенияСвойств(Элементы.Тч.ТекущиеДанные, ЭтаФорма);
КонецПроцедуры
