////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
//		
//	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
//	
//	// Заполняем счета учета взаиморасчетов
//	ТаблицаСчетов = УправлениеВзаиморасчетами.ПолучитьТаблицуСчетовУчетаВзаиморасчетов(Истина, Ложь);
//	ТаблицаСчетов.Колонки.СчетРасчетов.Имя = "Счет";
//	ТаблицаСчетов.Колонки.Добавить("УчаствуетВРасчетах", Новый ОписаниеТипов("Булево"));
//	ТаблицаСчетов.ЗаполнитьЗначения(Истина, "УчаствуетВРасчетах");
//	СписокСчетов.Загрузить(ТаблицаСчетов);
//	
//КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	//Ответственный = сабОбщегоНазначения.ТекущийПользователь();
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

//Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) 
//		И ДатаНачала > ДатаОкончания Тогда
//	
//		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Поле", "Корректность",
//			НСтр("ru = 'Период по'"), , , 
//			НСтр("ru = 'Дата окончания периода сверки должна быть больше даты начала.'"));
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДатаОкончания", "Объект", Отказ);
//		
//	КонецЕсли;
//	
//КонецПроцедуры
