
Процедура ПередЗаписью(Отказ)
		
	Если Не Отказ Тогда
		Если Не ЗначениеЗаполнено(Ссылка) Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый");
		Иначе
			СсылкаНаИсточник		= ЭтотОбъект.Ссылка;
			Источник 				= ЭтотОбъект;
			МетаданныеИсточника = Источник.Метаданные();
			
			БылоИзменение = Ложь;
			
			Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
				ИмяРеквизита = Реквизит.Имя;
				Если Не СсылкаНаИсточник[ИмяРеквизита] = Источник[ИмяРеквизита] Тогда
					БылоИзменение = Истина;
					Продолжить;
				КонецЕсли;
			КонецЦикла;
			
			Если Не БылоИзменение Тогда
				Для Каждого Реквизит Из МетаданныеИсточника.СтандартныеРеквизиты Цикл
					ИмяРеквизита = Реквизит.Имя;
					Если Не СсылкаНаИсточник[ИмяРеквизита] = Источник[ИмяРеквизита] Тогда
						БылоИзменение = Истина;
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если БылоИзменение Тогда
				ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//подписка на событие
	БюджетныйНаСервере.ПередЗаписиЭлементовСправочниковПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если ЗначениеЗаполнено(Ссылка.Родитель) Тогда 
	//	Если (Ссылка.Родитель = Справочники.Д_Должности.ДолжностиКадровогоУчета Или Ссылка.Родитель.ПринадлежитЭлементу(Справочники.Д_Должности.ДолжностиКадровогоУчета))
	//		И Не (РольДоступна("Кадровик") Или РольДоступна("Администратор")) Тогда
	//		Сообщить("В папке ""Должности кадрового учета"" изменять/создавать элементы может только кадровик");
	//		Отказ = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	
	Ответственный = ОбщегоНазначения.ПолучитьОтветственногоЗаСправочник(Перечисления.ТипыПроверяемыхСправочников.Должности);
	
	Если ЗначениеЗаполнено(Ответственный) И ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый")	Тогда
		НаборЗаписей = РегистрыСведений.ПроверкаОбъектовБД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		Запись 				= НаборЗаписей.Добавить();
		Запись.Объект	 	= Ссылка;
		Запись.Проверен 	= Ложь;
		НаборЗаписей.Записать();
		ЭтотОбъект.ДополнительныеСвойства.Удалить("ЭтоНовый");
		Задача = Задачи.Задача.СоздатьЭлемент();
		Задача.Заявка = Ссылка;
		Задача.Дата = ТекущаяДата();
		Задача.Наименование = "Согласовать создание/изменение должности";
		Задача.Автор = ПараметрыСеанса.ТекущийПользователь;
		Задача.Описание = "Необходимо согласовать созданную/измененную должность";
		Задача.Исполнитель = Ответственный;
		Задача.Записать();
		//БПСервер.СоздатьОповещение(Константы.ОтветственныйЗаСправочникДолжностей.Получить(), "Был создан/изменен элемент справочника должности " + Ссылка + ", необходимо выполнить проверку", "Создана/изменена должность " + Ссылка, Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры
