
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Предприятия.Доступность = НЕ Объект.ДоступенВсемПредприятиям;
	
	ЦветКомандыУтвердительно = Объект.Ссылка.ЦветКомандыУтвердительно.Получить();
	ЦветКомандыОтрицательно = Объект.Ссылка.ЦветКомандыОтрицательно.Получить();
	ЦветКомандыСЗамечаниями = Объект.Ссылка.ЦветКомандыСЗамечаниями.Получить();
	
	//ЗаполнитьТипамиДокументов();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступенВсемПриИзменении(Элемент)
	Элементы.Предприятия.Доступность = НЕ Объект.ДоступенВсемПредприятиям;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Объект.ЦветКомандыУтвердительно = ЦветКомандыУтвердительно;
	//Объект.ЦветКомандыОтрицательно = ЦветКомандыОтрицательно;
	//Объект.ЦветКомандыСЗамечаниями = ЦветКомандыСЗамечаниями;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЦветКомандыУтвердительно = Новый ХранилищеЗначения(ЦветКомандыУтвердительно);
	ТекущийОбъект.ЦветКомандыОтрицательно = Новый ХранилищеЗначения(ЦветКомандыОтрицательно);
	ТекущийОбъект.ЦветКомандыСЗамечаниями = Новый ХранилищеЗначения(ЦветКомандыСЗамечаниями);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипамиДокументов()
	Элементы.ВидДокумента.РежимВыбораИзСписка = Истина;	
	СтруктураДоков = БПСервер.СписокВидовСЗ(Неопределено, "Все документы");
	
	ИндексКоманды = 0;
	Для Каждого ВидОперации Из СтруктураДоков Цикл
		Если ТипЗнч(ВидОперации.Ссылка) = Тип("СправочникСсылка.Д_ВидыВнутреннихДокументов") И НЕ ВидОперации.ЭтоРодитель Тогда
			Элементы.ВидДокумента.СписокВыбора.Добавить(ВидОперации.Ссылка);					
		КонецЕсли;
	КонецЦикла;
	
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Реестр заявок на оплату", "Реестр заявок на оплату"); 
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на оплату", "Заявка на оплату");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на согласование договора", "Заявка на согласование договора");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Внутренний документ", "Внутренний документ");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на отгрузку", "Заявка на отгрузку");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на кадровое движение", "Заявка на кадровое движение");
	Если Константы.сабИспользоватьПодсистемуБюджетирование.Получить() Тогда
		Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на корректировку текущего бюджета", "Заявка на корректировку текущего бюджета");
		Элементы.ВидДокумента.СписокВыбора.Добавить("Бюджет оперативный", "Бюджет оперативный");
		Элементы.ВидДокумента.СписокВыбора.Добавить("Бюджет", "Бюджет");
	КонецЕсли;
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на торговлю", "Заявка на торговлю");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Карта сделки", "Карта сделки");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на согласование договора по проведению ТММ", "Заявка на согласование договора по проведению ТММ");
	//Элементы.ВидДокумента.СписокВыбора.Добавить("Заявка на согласование договора по оплате РБ(Премии)", "Заявка на согласование договора по оплате РБ(Премии)");
	Элементы.ВидДокумента.СписокВыбора.Добавить("Согласование отпуска", "Согласование отпуска");
 	
 
 КонецПроцедуры