
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТекСтрока = ПараметрКоманды;
	
	РеквизитыСправочники = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрКоманды, "БизнесПроцесс.Автор, Заявка, Автор"); 
	
	Если ТекСтрока <> Неопределено Тогда
		ФормаОповещения = ПолучитьФорму("Документ.БП_Оповещение.Форма.ФормаНовый");
		ДанныеФормы = ФормаОповещения.Объект;
		ТекДанные = Новый Структура;
		ТекДанные.Вставить("Ссылка", ПараметрКоманды);
		ТекДанные.Вставить("Инициатор", РеквизитыСправочники.БизнесПроцессАвтор);
		ТекДанные.Вставить("Заявка", РеквизитыСправочники.Заявка);
		ТекДанные.Вставить("ЗадачаОт", РеквизитыСправочники.Автор);
		ЗаполнитьНаСервере(ДанныеФормы, ТекДанные);
		КопироватьДанныеФормы(ДанныеФормы, ФормаОповещения.Объект);
		ФормаОповещения.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ТекОбъект, ДанныеЗаполнения)
	
	ТекОбъект.Автор 				= ПараметрыСеанса.ТекущийПользователь;
	ТекОбъект.Тема 					= "Вопрос по задаче: " + Строка(ДанныеЗаполнения.Ссылка);
	ТекОбъект.Документ 				= ДанныеЗаполнения.Заявка;
	СтрокаИсполнителей 				= ТекОбъект.СписокИсполнителей.Добавить();
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Инициатор) И НЕ ДанныеЗаполнения.Инициатор = Справочники.Пользователи.Система Тогда
		СтрокаИсполнителей.Исполнитель 	= ДанныеЗаполнения.Инициатор;
	ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.ЗадачаОт) И НЕ ДанныеЗаполнения.ЗадачаОт = Справочники.Пользователи.Система Тогда
		СтрокаИсполнителей.Исполнитель 	= ДанныеЗаполнения.ЗадачаОт;
	Иначе
		Сообщить("Невозможно задать вопрос автору.");
	КонецЕсли;
	
КонецПроцедуры	