Функция ПроверитьВладельца(ВладелецФайла, ТолькоРедактирование = Истина, ВозможностьРедактированияИзАвтомаршрута = Неопределено) Экспорт
	
	Если ТипЗнч(ВладелецФайла) = Тип("ДокументСсылка.БП_Оповещение") Тогда
		Если ВладелецФайла.Стартован Тогда
			ОснованиеЗаблокирован = Истина;
		Иначе
			ОснованиеЗаблокирован = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВладелецФайла) = Тип("ДокументСсылка.Д_ОбращенияВТехПоддержку") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задача.ТочкаМаршрута
		|ИЗ
		|	Задача.Задача КАК Задача
		|ГДЕ
		|	Задача.Заявка = &Заявка
		|	И НЕ Задача.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Задача.Дата УБЫВ";
		Запрос.УстановитьПараметр("Заявка", ВладелецФайла); 
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОснованиеЗаблокирован = Ложь;
		Иначе	
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ТочкаМаршрута = БизнесПроцессы.ЗаявкиАдминистратору.ТочкиМаршрута.Действие1 ИЛИ Выборка.ТочкаМаршрута = БизнесПроцессы.ЗаявкиАдминистратору.ТочкиМаршрута.Действие3 ИЛИ Выборка.ТочкаМаршрута = БизнесПроцессы.ЗаявкиАдминистратору.ТочкиМаршрута.Действие4 Тогда
					ОснованиеЗаблокирован = Ложь;
				Иначе
					ОснованиеЗаблокирован = Истина;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	
	Иначе	
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ЕСТЬNULL(Задача.БизнесПроцесс.ОснованиеЗаблокирован, ЛОЖЬ) КАК ОснованиеЗаблокирован,
		//|	ЕСТЬNULL(Задача.Заявка.ВидСЗ.РазрешитьРедактированиеПрикрепленныхФайлов, ЛОЖЬ) КАК РазрешитьРедактированиеПрикрепленныхФайлов,
		//|	ЕСТЬNULL(Задача.Заявка.ВидСЗ.РазрешитьРедактированиеПрикрепленныхФайловДляВсех, ЛОЖЬ) КАК РазрешитьРедактированиеПрикрепленныхФайловДляВсех
		//|ИЗ
		//|	Задача.Задача КАК Задача
		//|ГДЕ
		//|	Задача.Заявка = &Заявка";
		//Запрос.УстановитьПараметр("Заявка", ВладелецФайла); 
		//Выборка = Запрос.Выполнить().Выбрать();		
		ОснованиеЗаблокирован = Ложь;
		//Пока Выборка.Следующий() Цикл
		//	Если НЕ Выборка.РазрешитьРедактированиеПрикрепленныхФайловДляВсех Тогда
		//		Если Выборка.ОснованиеЗаблокирован  Тогда
		//			Если ТолькоРедактирование Тогда
		//				Если НЕ Выборка.РазрешитьРедактированиеПрикрепленныхФайлов Тогда
		//					ОснованиеЗаблокирован = Истина;
		//				КонецЕсли;
		//			Иначе	
		//				ОснованиеЗаблокирован = Истина;
		//			КонецЕсли;
		//		КонецЕсли;
		//	ИначеЕсли НЕ  ВозможностьРедактированияИзАвтомаршрута = Неопределено Тогда
		//		ВозможностьРедактированияИзАвтомаршрута = Истина;				
		//	КонецЕсли;
		//КонецЦикла;	
	КонецЕсли;
	
	Возврат ОснованиеЗаблокирован;
	
КонецФункции

