
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТекОбъект = ЭтотОбъект;
	КУдалению = Ложь;
	
	//отрабатываем удаление
	Если НЕ ЭтотОбъект.Количество() Тогда
		ТекЗапись = РегистрыСведений.ПрикрепленныеОбъекты.СоздатьНаборЗаписей();
		
		Для каждого Текотбор Из Отбор Цикл
			ТекЗапись.Отбор.Владелец.Установить(Отбор.Владелец.Значение);	
			ТекЗапись.Отбор.Объект.Установить(Отбор.Объект.Значение);	
			ТекЗапись.Отбор.ВладелецИмяТЧ.Установить(Отбор.ВладелецИмяТЧ.Значение);	
			ТекЗапись.Отбор.ВладелецСтрокаТЧ.Установить(Отбор.ВладелецСтрокаТЧ.Значение);	
		КонецЦикла; 
		
		ТекЗапись.Прочитать();
		
		Если ТекЗапись.Количество() Тогда
			ТекОбъект = ТекЗапись;
			КУдалению = Истина;
		КонецЕсли;
		
	КонецЕсли;//конец обработки удаления
	
	
	Для каждого ТекСтрока Из ТекОбъект Цикл
		
		СтруктураПроверки = БПСервер.ПроверкаВозможностиРедактированияФайлаИПрикрепления(ТекСтрока.Объект, ТекСтрока.АдресВремХранилища, ТекСтрока.Владелец);
		
		Если СтруктураПроверки.ТекСписок.НайтиПоЗначению(ТекСтрока.Объект) = Неопределено И СтруктураПроверки.ЕстьЗапись И РегистрыСведений.ПрикрепленныеОбъекты.ПроверитьВладельца(ТекСтрока.Владелец) Тогда
			Отказ = Истина;
			Сообщить("По данному документу " + ТекСтрока.Владелец + " запущен бизнес-процесс, редактирование прикрепленных объектов запрещено!");
		КонецЕсли;
		
		Попытка
			
			Если БПСервер.ПолучитьМассивПользователей(ТекСтрока.Автор) = Неопределено Тогда
				Отказ = Истина;
				Сообщить("Только автор документа может открепить объект!");
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
		
	КонецЦикла;
	
КонецПроцедуры

