
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = ПечатьДоговорСчет(ПараметрКоманды, 50);
		
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента");
	ФормаПечати.Результат = ТабДок;
	ФормаПечати.Открыть();

КонецПроцедуры     

Функция ПечатьДоговорСчет(ПараметрКоманды, Предоплата)
	Возврат Документы.ЗаказКлиента.ПечатьДоговор(ПараметрКоманды, Предоплата);
КонецФункции

