
&Вместо("СчетаФактурыНеТребуются")
Функция УУ_СчетаФактурыНеТребуются(МассивДокументов)
	
	Если НЕ ЗначениеЗаполнено(МассивДокументов) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ВидДокументов = МассивДокументов[0].Метаданные().Имя;
	
	Попытка 
		ДокументыСчетФактураНеТребуются = Документы[ВидДокументов].СчетаФактурыНеТребуются(МассивДокументов);
	Исключение
		ДокументыСчетФактураНеТребуются = Новый Массив;
	КонецПопытки;
	
	Возврат ДокументыСчетФактураНеТребуются;
	
КонецФункции

&Вместо("ДокументыСПрослеживаемымиТоварами")
Функция УУ_ДокументыСПрослеживаемымиТоварами(МассивДокументов)

	Если НЕ ЗначениеЗаполнено(МассивДокументов) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ВидДокументов = МассивДокументов[0].Метаданные().Имя; 
	
	Попытка 
		ДокументыСПрослеживаемымиТоварами = Документы[ВидДокументов].ДокументыСПрослеживаемымиТоварами(МассивДокументов);
	Исключение                                                                                                           
		ДокументыСПрослеживаемымиТоварами = Новый Массив;
	КонецПопытки;
	
	Возврат ДокументыСПрослеживаемымиТоварами;
	
КонецФункции
