&НаКлиенте
Процедура Расписание(Команда)
	Расписание = НайтиРасписание();
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание); // создаем диалог
	//Если Диалог.ОткрытьМодально(Диалог.Расписание) Тогда // открываем, настраиваем
	//	СохранитьРасписание(Диалог.Расписание);
	//	//Расписание = Диалог.Расписание; //получаем расписание и дальше делаем с ним что угодно
	//КонецЕсли
	Диалог.Показать(Новый ОписаниеОповещения("ПоказатьДиалогЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));		
КонецПроцедуры

&НаСервере
Функция НайтиРасписание()
	
	ЗаписьРегистра = РегистрыСведений.ПараметрыРегламентныхЗаданийРасширения.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.РегламентноеЗадание= Перечисления.РегламентныеЗаданияРасширения.ЗагрузкаВыписокИзКлиентБанка;
	ЗаписьРегистра.Прочитать();
	Если ЗаписьРегистра.Выбран() Тогда
		Расписание = ЗаписьРегистра.Расписание.Получить();
	Иначе
		Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Возврат Расписание;
	
КонецФункции // НайтиРасписание()

&НаКлиенте
Процедура ПоказатьДиалогЗавершение(Расписание,ДополнительныеПараметры) Экспорт 
	СохранитьРасписание(Расписание);
КонецПроцедуры

&НаСервере
Процедура СохранитьРасписание(Расписание)
	АдресВременногоХранилищаРасписания = ПоместитьВоВременноеХранилище(Расписание, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(АдресВременногоХранилищаРасписания) Тогда
        
        ТекущийОбъект.Расписание
            = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВременногоХранилищаРасписания));
        
    КонецЕсли;    
    
КонецПроцедуры