
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
		СтандартнаяОбработка = Ложь; 
		Статья = ПолучитьСтатьюБаланса(Расшифровка);
		//СписокПредприятий = Новый СписокЗначений;
		//
		//Для Каждого ТекНаправление Из Предприятия.ПолучитьЭлементы() Цикл
		//	Если Не ТекНаправление.Пометка Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	Для Каждого ТекПр Из ТекНаправление.ПолучитьЭлементы() Цикл
		//		Если Не ТекПр.Пометка Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		СписокПредприятий.Добавить(ТекПр.Значение)
		//	КонецЦикла
		//КонецЦикла;
		//
		//КоличествоЭлементов = СписокПредприятий.Количество()-1; 

		ОСВ = ПолучитьФорму("Отчет.УЧ_РасшифровкаБаланса.Форма",,,Истина);			
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Использование = Истина; 		
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение = ?(ЗначениеЗаполнено(ЭквивалентнаяВалюта), ЭквивалентнаяВалюта, НациональнаяВалюта());
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Использование = Истина;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Значение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[3].Значение;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Использование = Истина;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[3].Значение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[4].Значение;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[3].Использование = Истина;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[4].Значение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[5].Значение;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[4].Использование = Истина;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[5].Значение = Статья;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[5].Использование = Истина;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[6].ВидСравнения = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[6].ВидСравнения;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[6].ПравоеЗначение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[6].ПравоеЗначение;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[6].Использование = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[6].Использование;
        ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[7].ВидСравнения = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[7].ВидСравнения;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[7].ПравоеЗначение = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[7].ПравоеЗначение;
		ОСВ.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[7].Использование = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[7].Использование;

		ОСВ.СкомпоноватьРезультат();
		ОСВ.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатьюБаланса(Расшифровка)
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	ДР = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Эл = ДР.Элементы.Получить(Расшифровка);
	ТекСтатья = Неопределено;
	
	Если Эл.ПолучитьПоля().Количество() Тогда
		Если Эл.ПолучитьПоля()[0].Поле = "Статья" Тогда
			ТекСтатья = Эл.ПолучитьПоля()[0].Значение;
		Иначе
			ТекСтатья = ПолучитьСтатьюВИерархии(Эл)
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекСтатья;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтатьюВИерархии(ТекЭлРасшифровки)
	
	Статья = Неопределено;
	
	Попытка 		
		Пока Не ТекЭлРасшифровки.ПолучитьПоля()[0].Поле = "Статья" Цикл 
			МассивРодителей = ТекЭлРасшифровки.ПолучитьРодителей();
			Если МассивРодителей.Количество() Тогда
				ТекЭлРасшифровки = МассивРодителей[0];
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Статья = ТекЭлРасшифровки.ПолучитьПоля()[0].Значение;
	Исключение
		МассивРодителей = ТекЭлРасшифровки.ПолучитьРодителей();
		Если МассивРодителей.Количество() Тогда
			Статья = ПолучитьСтатьюВИерархии(МассивРодителей[0])
		КонецЕсли;
	КонецПопытки;
	
	Возврат Статья
	
КонецФункции

&НаСервереБезКонтекста
Функция НациональнаяВалюта()
	Возврат УЧ_Сервер.НациональнаяВалюта();
КонецФункции

