
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ(&Подразделения)";
	Запрос.УстановитьПараметр("Подразделения", Подразделения.ВыгрузитьКолонку("Подразделение"));
	
	Движения.ВременнаяБлокировкаНоменклатурыВЗаказах.Записывать = Истина;
	
	ВыборкаПоПодразделениям = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ВременнаяБлокировкаНоменклатурыВЗаказах.Добавить();
			Движение.Предприятие = Предприятие;
			Движение.ДатаНач = ДатаНач;
			Движение.ДатаКон = ДатаКон;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Подразделение = ВыборкаПоПодразделениям.Ссылка;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры
