
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если НЕ БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "Недоступен") Тогда
		Предупреждение("Ошибка! Доступ уже открыт, пользователь оповещен.");
		Возврат;	
	КонецЕсли;
	ОткрытьДоступСервер(ПараметрКоманды);
	БПСервер.СоздатьОповещение(БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "Автор"),
	"Доступ к бюджету продаж открыт.",
	Строка(БюджетныйНаСервере.ПолучитьПользователя()) +  ": бюджет продаж готов", ПараметрКоманды, Истина);
	ОповеститьОбИзменении(ПараметрКоманды);
	
	Предупреждение("Доступ открыт. Пользователь оповещен.");
КонецПроцедуры

&НаСервере
Процедура ОткрытьДоступСервер(ПараметрКоманды)

	ТекОбъект = ПараметрКоманды.ПолучитьОбъект();
	ТекОбъект.Недоступен = Ложь;
	ТекОбъект.Записать();

КонецПроцедуры
 