
Процедура ПередЗаписью(Отказ)
	Если НЕ Ссылка.ПометкаУдаления = ПометкаУдаления Тогда //при удалении бизнес-процесса удаляем задачи
		//удаляем задачи
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Задача.Ссылка
		|ИЗ
		|	Справочник.Задача КАК Задача
		|ГДЕ
		|	Задача.Заявка = &Заявка";
		
		Запрос.УстановитьПараметр("Заявка", Ссылка);
		
		Результат = Запрос.Выполнить();
		ВыборкаЗадачи = Результат.Выбрать();
		Пока ВыборкаЗадачи.Следующий() Цикл
			ТекБП = ВыборкаЗадачи.Ссылка.ПолучитьОбъект();
			ТекБП.ПометкаУдаления = ПометкаУдаления;
			ТекБП.Записать();
		КонецЦикла;
		
	КонецЕсли;
	ДатаНачала = ДатаНачала;
	ДатаОкончания = ДатаОкончания;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ПользовательСогласовал = Ложь;
	ЗамещающийСогласовал = Ложь;
	ОтпускникОтсутствуетВБазе = Ложь;
	СотрудникЗамещающий = Справочники.Сотрудники.ПустаяСсылка();
	СотрудникОтпускник = Справочники.Сотрудники.ПустаяСсылка();
	Для каждого ТекСтрока Из ДопСогласование Цикл
		ТекСтрока.Пройден = Ложь;
		ТекСтрока.Согласовано = Ложь;
		ТекСтрока.КомментарииПользователя = "";	
	КонецЦикла; 
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ОтпускникОтсутствуетВБазе Тогда
		Если Не ЗначениеЗаполнено(Пользователь) Тогда
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ЭтотОбъект, "Не указан отпускник!",,,"Пользователь", Отказ); 
		КонецЕсли;	
		
		Если НЕ ДелегироватьЗадачиНаПодчиненных И НЕ ЗначениеЗаполнено(Замещающий) Тогда
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ЭтотОбъект, "Не указан замещающий!",,,"Замещающий", Отказ); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
