
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Предприятия", ЭтаФорма.ВладелецФормы.Объект.Док);
	ТекДата = КонецДня(БПСервер.СерверноеВремя());
	ПараметрыОтчета.Вставить("Дата1", ТекДата);
	ПараметрыОтчета.Вставить("Контрагент", ЭтаФорма.ВладелецФормы.Объект.Грузополучатель);
	ТТ = Новый ТабличныйДокумент;
	СтруктураВозврата = УЧ_Сервер.РассчитатьДЗСервер(ПараметрыОтчета, ТТ, Ложь);
	
	УсловияПоГруппе = ПолучитьУсловияПоГруппеКонтрагентов(ЭтаФорма.ВладелецФормы.Объект.Дата, ЭтаФорма.ВладелецФормы.Объект.Грузополучатель);	
	
	СтрокаГруппы = ТЗ_Детализация.ПолучитьЭлементы().Добавить();
	
	Если ЗначениеЗаполнено(УсловияПоГруппе) Тогда
		СтрокаГруппы.Контрагент =  УсловияПоГруппе.Контрагент;
		СтрокаМП = СтрокаГруппы.ПолучитьЭлементы().Добавить(); 
		СтрокаМП.ВидЗадолженности = "Месячная потребность";
		СтрокаМП.Сумма = УсловияПоГруппе.МесячнаяПотребность;
		СтрокаЦена = СтрокаГруппы.ПолучитьЭлементы().Добавить();
		СтрокаЦена.ВидЗадолженности = "Цена";
		СтрокаЦена.Сумма =	УсловияПоГруппе.Цена;
		СтрокаЛДЗ = СтрокаГруппы.ПолучитьЭлементы().Добавить();
		СтрокаЛДЗ.ВидЗадолженности = "Лимит ДЗ";
		СтрокаЛДЗ.Сумма =	УсловияПоГруппе.ЛимитДЗ;
		СтрокаЛПДЗ = СтрокаГруппы.ПолучитьЭлементы().Добавить();
		СтрокаЛПДЗ.ВидЗадолженности = "Лимит ПДЗ";
		СтрокаЛПДЗ.Сумма =	УсловияПоГруппе.ЛимитПДЗ;
		СтрокаДП = СтрокаГруппы.ПолучитьЭлементы().Добавить();
		СтрокаДП.ВидЗадолженности = "Максимальное количество дней просрочки";
		СтрокаДП.Сумма =	УсловияПоГруппе.МаксКоличествоДнейПросрочки;
		СтрокаО = СтрокаГруппы.ПолучитьЭлементы().Добавить();
		СтрокаО.ВидЗадолженности = "Отсрочка";
		СтрокаО.Сумма = УсловияПоГруппе.Отсрочка;
		СтрокаПр = СтрокаГруппы.ПолучитьЭлементы().Добавить();
		СтрокаПр.ВидЗадолженности = "Предоплата";
		СтрокаПр.Сумма = УсловияПоГруппе.Предоплата;
		СтрокаВерх = СтрокаГруппы.ПолучитьЭлементы().Добавить();
		СтрокаВерх.ВидЗадолженности = "Верх";
		СтрокаВерх.Сумма = УсловияПоГруппе.Верх; 
	КонецЕсли;
	
	СтрокаКонтрагента = СтрокаГруппы.ПолучитьЭлементы().Добавить();
	СтрокаКонтрагента.Контрагент = ПараметрыОтчета.Контрагент;
	СтрокаДЗОбщая = СтрокаКонтрагента.ПолучитьЭлементы().Добавить();
	СтрокаДЗОбщая.ВидЗадолженности = "ДЗ общая";
	СтрокаДзОбщая.Сумма = СтруктураВозврата.ДЗИтого;
	СтрокаДЗПросроченная = СтрокаКонтрагента.ПолучитьЭлементы().Добавить();
	СтрокаДЗПросроченная.ВидЗадолженности = "ДЗ просроченная";
	СтрокаДЗПросроченная.Сумма = СтруктураВозврата.ДЗПросроченная;
	СтрокаДЗПросроченнаяТр = СтрокаКонтрагента.ПолучитьЭлементы().Добавить();
	СтрокаДЗПросроченнаяТр.ВидЗадолженности = "ДЗ просроченная (транспорт)";
	СтрокаДЗПросроченнаяТр.Сумма = СтруктураВозврата.ДЗПросроченная2;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУсловияПоГруппеКонтрагентов(Дата, Контрагент)
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураКонтрагента = Новый Структура;
	СтруктураКонтрагента.Вставить("Контрагент", Контрагент.Родитель);
	
	ТЗ = РегистрыСведений.КС_УсловияКонтрагента.СрезПоследних(Дата, СтруктураКонтрагента);
	
	Если ТЗ.Количество() Тогда
		Для ИндКол = 1 По ТЗ.Колонки.Количество() - 2 Цикл
			СтруктураВозврата.Вставить(ТЗ.Колонки[ИндКол].Имя, ТЗ[0][ИндКол]);
		КонецЦикла;
	Иначе 
		Возврат Неопределено
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции