
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Возврат.Доступность = ПроверкаВ();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПр(Док)
	Возврат Док.Предприятие;	
КонецФункции


&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	ПредприятиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПредприятиеПриИзмененииНаСервере()
	сабОбщегоНазначенияКлиентСервер.СкрытьПодразделения(ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПроверкаВ()
		Объект.ФлагВозврат = Ложь;
		Возврат Ложь;
КонецФункции


&НаКлиенте
Процедура ДокОснованиеПриИзменении(Элемент)
		Элементы.Возврат.Доступность = ПроверкаВ();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БюджетныйНаСервере.ДействияПриСозданииФормыДокумента(ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	сабОбщегоНазначения.ОтобразитьСостояниеДокумента(ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	сабОбщегоНазначения.ОтобразитьСостояниеДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры


&НаКлиенте
Процедура ДокОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//
	//Если НЕ БюджетныйНаСервере.РольДоступнаСервер("Учетчик") Тогда //для неучетчиков ограничения типа
	//	Массив = Новый Массив;
	//	Массив.Добавить(Тип("ДокументСсылка.УЧ_ПоступлениеТоваров"));
	//	Массив.Добавить(Тип("ДокументСсылка.УЧ_СписаниеТоваров"));
	//	Массив.Добавить(Тип("ДокументСсылка.УЧ_ОпознаваниеПрихода"));
	//	Массив.Добавить(Тип("ДокументСсылка.УЧ_ПеремещениеТоваров"));
	//	Массив.Добавить(Тип("ДокументСсылка.УЧ_ВозвратТоваровПоставщику"));
	//	Массив.Добавить(Тип("ДокументСсылка.УЧ_ПереводТМЦ"));	
	//	
	//	Элементы.ДокОснование.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ДобавитьВСвязьПодразделение();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВСвязьПодразделение()
	МассивПараметровВыбора = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		МассивПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Предприятие", "Объект.Предприятие", РежимИзмененияСвязанногоЗначения.Очищать));
		МассивПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Подразделение", "Объект.Подразделение", РежимИзмененияСвязанногоЗначения.Очищать));
	Иначе	
		МассивПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Предприятие", "Объект.Предприятие", РежимИзмененияСвязанногоЗначения.Очищать));
	КонецЕсли;	
	Элементы.ДокОснование.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
КонецПроцедуры


