
&НаКлиенте
Процедура СписокИсполнителейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ПустаяСтрока(Элемент.ТекущиеДанные.Приложение) Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Приложение);			
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Авторы = БПСервер.ПолучитьМассивПользователей();
	Список.Параметры.УстановитьЗначениеПараметра("Автор", Авторы);
	Список2.Параметры.УстановитьЗначениеПараметра("Автор", Авторы);
	Список2.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Группа3.Видимость = НЕ Параметры.РежимВыбора;
		Элементы.Список2.РежимВыбора = Параметры.РежимВыбора;
	//Иначе
		//Элементы.Список2.РежимВыбора = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Список2Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Список2.РежимВыбора Тогда
		ОбработкаВыбора(ВыбраннаяСтрока, ЭтаФорма);
		Возврат;	
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ТекЗадача = БПСервер.ПолучитьЗадачуИсполнителяПоЗаданию(Элементы.Список2.ТекущаяСтрока);
	
	Если НЕ ТекЗадача = Неопределено Тогда // в процессе выполнения
		ОткрытьЗначение(ТекЗадача);
	Иначе
		ОткрытьФорму("Документ.БП_Поручение.ФормаОбъекта", Новый Структура("Ключ", Элементы.Список2.ТекущаяСтрока) );
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//ВыбранноеЗначение = Элементы.Список2.ТекущаяСтрока;
КонецПроцедуры

 
