
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Задача") Тогда
		СтруктураПараметров = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрКоманды, "БизнесПроцесс, Заявка");
		ТекБП = СтруктураПараметров.БизнесПроцесс;
		ПараметрКоманды = СтруктураПараметров.Заявка;
	Иначе
		ТекБП = БПСервер.НайтиТекущийБПСервер(ПараметрКоманды);
	КонецЕсли;
	
	Если НЕ ТекБП = Неопределено Тогда
		
		Если БПСервер.СтадияИсполненияОбщая(ТекБП) Тогда
			ПоказатьПредупреждение(Неопределено, "Бизнес-процесс по данному документу исполнен или находится на стадии исполнения. Изменение маршрута невозможно.");	
			Возврат;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекБП) Тогда
			ПоказатьПредупреждение(Неопределено, "Отсутствуют запущенные бизнес-процессы.");
			Возврат;
		КонецЕсли;
		
		Если Не ПользователюРазрешеноМенятьМаршрут(ТекБП) Тогда
			ПоказатьПредупреждение(Неопределено, "Изменение маршрута невозможно, т.к. вы не являетесь автором или согласователем.");
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Д_ЗаявкаНаСогласованиеДоговора") Тогда
			//Если БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "ВидСЗ") = ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.ЗаявкаНаСогласованиеДоговора") Или БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "ВидСЗ") = ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.СогласованиеДоговораСтроительствоТендер") Тогда
			//	Если Не ЕстьВозможностьИзменятьМаршрутДоговоров() Тогда
			//		Предупреждение("Изменять маршрут согласования могут только пользователи: Филиппова В, Толстых И");
			//		Возврат;
			//	КонецЕсли;		
			//КонецЕсли;
		КонецЕсли;
				
		//Если ТипЗнч(ТекБП) = Тип("СправочникСсылка.Согласование3") Тогда
		//	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Д_СлужебнаяЗаписка") И БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "ОтправлятьВсем") Тогда
		//		ПоказатьПредупреждение(Неопределено, "Невозможно изменить маршрут в произвольной СЗ в случае отправки сразу всем.");
		//		Возврат;		
		//	КонецЕсли;
		//КонецЕсли;
		
		
		ОткрытьФорму("Справочник.СогласованиеОбщее.Форма.ФормаИзмененияМаршрута2", Новый Структура("ТекущийБизнесПроцесс, ТекущийДокумент", ТекБП, ПараметрКоманды),,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		
	Иначе
		ПоказатьПредупреждение(Неопределено, "Бизнес-процесс не найден.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПользователюРазрешеноМенятьМаршрут(БП)
	
	ТекущийПользователь = БПСервер.ПолучитьМассивПользователей();
	ВозможностьИзменения = Ложь;
		
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Д_ДоступностьДокументовДокументооборота.ВсеДокументы
	               |ИЗ
	               |	РегистрСведений.Д_ДоступностьДокументовДокументооборота КАК Д_ДоступностьДокументовДокументооборота
	               |ГДЕ
	               |	Д_ДоступностьДокументовДокументооборота.Пользователь В (&Пользователь)
	               |	И Д_ДоступностьДокументовДокументооборота.ТипДокумента = &ТипДокумента";
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ТипДокумента", БП.Заявка.Метаданные().Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.ВсеДокументы Тогда
		ВозможностьИзменения = Истина;
	КонецЕсли;
	
	Если НЕ ТекущийПользователь.Найти(БП.Заявка.Автор) = Неопределено ИЛИ РольДоступна("ОФК") Или БюджетныйНаСервере.РольАдминаДоступнаСервер() Тогда
		ВозможностьИзменения = Истина;
	КонецЕсли; 
	
	Для каждого ТекСтрока Из БП.ДопСогласование Цикл
		Если НЕ ТекущийПользователь.Найти(ТекСтрока.СубъектСогласования) = Неопределено Тогда
			ВозможностьИзменения = Истина;		
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ВозможностьИзменения;
	
КонецФункции

&НаСервере
Функция ЕстьВозможностьИзменятьМаршрутДоговоров()
	
	ЗначениеСвойства = сабОбщегоНазначения.ПолучитьЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь, "Доступно изменение маршрута по договорам");
	Если ЗначениеСвойства = Неопределено Тогда
		Возврат Ложь;
	Иначе 
		Возврат ЗначениеСвойства;
	КонецЕсли;	
	
КонецФункции
