
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("БизнесПроцесс") Тогда
		БизнесПроцесс = Параметры.БизнесПроцесс;
	КонецЕсли;
	ЗаполнитьСписок(Параметры);
	
	ЗадачаОповещения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	МассивОзнакомление = Новый Массив;
	МассивДоступ = Новый Массив;
	Для каждого ТекСтрока Из ТЗ Цикл
		Если ТекСтрока.Оповещен = "После согласования" И НЕ ТекСтрока.УжеОповещен Тогда
			МассивОзнакомление.Добавить(ТекСтрока.Пользователь);
		ИначеЕсли ТекСтрока.Оповещен = "Сейчас" И НЕ ТекСтрока.УжеОповещен Тогда
			МассивДоступ.Добавить(ТекСтрока.Пользователь);	
		КонецЕсли;
		Если ПустаяСтрока(ТекСтрока.Оповещен) Тогда
			Сообщить("В строке " + Строка(ТЗ.Индекс(ТекСтрока) + 1) + " не указан вариант доступа.");
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Закрыть(Новый Структура("СписокПользователей, СписокПользователей2, ЗадачаОповещения, Комментарий", МассивОзнакомление, МассивДоступ, ЗадачаОповещения, Комментарий));
КонецПроцедуры

&НаКлиенте
Процедура ТЗПриАктивизацииСтроки(Элемент)
	//Если НЕ Элементы.ТЗ.ТекущиеДанные = Неопределено Тогда
	//	Элементы.ТЗПользователль.ТолькоПросмотр = Элементы.ТЗ.ТекущиеДанные.Оповещен;
	//КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьСписок(Параметры)
	
	Если БизнесПроцесс = Неопределено ИЛИ ТипЗнч(БизнесПроцесс) = Тип("СправочникСсылка.СогласованиеОбщее") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СогласованиеОбщееДопОповещение.Ссылка,
		|	СогласованиеОбщееДопОповещение.НомерСтроки,
		|	СогласованиеОбщееДопОповещение.Пользователь,
		|	СогласованиеОбщееДопОповещение.Оповещен КАК УжеОповещен,
		|	""После согласования"" КАК Оповещен
		|ИЗ
		|	Справочник.СогласованиеОбщее.ДопОповещение КАК СогласованиеОбщееДопОповещение
		|ГДЕ
		|	СогласованиеОбщееДопОповещение.Ссылка.Заявка = &Заявка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СогласованиеОбщееДоступнаПользователям.Ссылка,
		|	СогласованиеОбщееДоступнаПользователям.НомерСтроки,
		|	СогласованиеОбщееДоступнаПользователям.Пользователь,
		|	ИСТИНА,
		|	""Сейчас""
		|ИЗ
		|	Справочник.СогласованиеОбщее.ДоступнаПользователям КАК СогласованиеОбщееДоступнаПользователям
		|ГДЕ
		|	СогласованиеОбщееДоступнаПользователям.Ссылка.Заявка = &Заявка";
	ИначеЕсли ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.Согласование2") ИЛИ ТипЗнч(БизнесПроцесс) = Тип("БизнесПроцессСсылка.Согласование3") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Согласование2Адресаты.Ссылка,
		               |	Согласование2Адресаты.НомерСтроки,
		               |	Согласование2Адресаты.СубъектСогласования КАК Пользователь,
		               |	""После согласования"" КАК Оповещен,
		               |	Согласование2Адресаты.Согласовано КАК УжеОповещен
		               |ИЗ
		               |	Справочник.Согласование2.Адресаты КАК Согласование2Адресаты
		               |ГДЕ
		               |	Согласование2Адресаты.Ссылка.Заявка = &Заявка";
		
	Иначе
		ИмяБП = БизнесПроцесс.Метаданные().Имя;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаявкиНаЗакупкуДопОповещение.Ссылка,
		|	ЗаявкиНаЗакупкуДопОповещение.НомерСтроки,
		|	ЗаявкиНаЗакупкуДопОповещение.Пользователь,
		|	""После согласования"" КАК Оповещен
		|ИЗ
		|	Справочник." + ИмяБП + ".ДопОповещение КАК ЗаявкиНаЗакупкуДопОповещение
		|ГДЕ
		|	ЗаявкиНаЗакупкуДопОповещение.Ссылка.Заявка = &Заявка";
		
		
		
	КонецЕсли;
	
 Запрос.УстановитьПараметр("Заявка", Параметры.ТекЗаявка);
 
 Результат = Запрос.Выполнить().Выгрузить();
 
 Для каждого ТекПользователь Из Результат Цикл
	 НоваяСтрока = ТЗ.Добавить();
	 ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекПользователь);
	 Если Параметры.БПВФинальнойСтадии Тогда
	 	НоваяСтрока.УжеОповещен = Истина;	 
	 КонецЕсли;
 КонецЦикла;
 
  
КонецФункции // ()

&НаКлиенте
Процедура ТЗПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.УжеОповещен = Ложь;
		Элемент.ТекущиеДанные.Оповещен = "После согласования";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ЗаблокироватьДанныеФормыДляРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	//ОткрытьФормумодально("Справочник.Пользователи.ФормаВыбора", Новый Структура("РежимВыбора, РасширенныйПодбор, ЗакрыватьПриВыборе", Истина, Истина, Ложь), Элементы.ТЗ);
	
КонецПроцедуры
