
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаСписка" Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "Документ.Д_ОбращенияВТехПоддержку.Форма.ТехПоддержка1";
		Параметры.Вставить("ТолькоЧат", Истина);
	КонецЕсли;
	Если ВидФормы = "ФормаЗаписи" И БюджетныйНаСервере.РольАдминаДоступнаСервер() Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "РегистрСведений.Ч_СообщенияЧата.Форма.ФормаЗаписиАдмина";
		//Параметры.Вставить("ТолькоЧат", Истина);
	КонецЕсли;
	
КонецПроцедуры
