
//при записи с пометкой удаления помечаем на удаление все задачи по бизнес процессу
Процедура ПриЗаписи(Отказ)
	////Если Ссылка.ПометкаУдаления Тогда //при удалении бизнес-процесса удаляем задачи
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//				   |	Задача.Ссылка
	//				   |ИЗ
	//				   |	Справочник.Задача КАК Задача
	//				   |ГДЕ
	//				   |	Задача.Заявка = &Заявка";
	//	
	//	Запрос.УстановитьПараметр("Заявка", Ссылка);
	//	
	//	Результат = Запрос.Выполнить();
	//	Выборка = Результат.Выбрать();
	//	
	//	Пока Выборка.Следующий() Цикл
	//		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//		ЗадачаОбъект.ПометкаУдаления = ПометкаУдаления;
	//		ЗадачаОбъект.Записать();
	//	КонецЦикла;
	////КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Стартован = Ложь;
	Завершен = Ложь;
	Автор = "";
	Для каждого ТекИсполнитель Из СписокИсполнителей Цикл
		ТекИсполнитель.Исполнено = Ложь;	
		ТекИсполнитель.ДатаВыполнения = Ложь;
		ТекИсполнитель.Комментарии = "";
		ТекИсполнитель.Пользователь = "";
		ТекИсполнитель.Приложение = "";
		ТекИсполнитель.ПричинаВозврата = "";
		ТекИсполнитель.СрокИсполнения = "";	
	КонецЦикла; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ОбращенияВТехПоддержку") Тогда
	//	Документ = ДанныеЗаполнения.Ссылка;
	//КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Ссылка.Пустая() Тогда
		ДатаНачала = ТекущаяДата();	
	КонецЕсли;
	Если Завершен Тогда
		ДатаЗавершения = ТекущаяДата();	
	КонецЕсли;
	
	Если СписокИсполнителей.Количество()>1 Тогда
		ИсполнителиСтрока = "";
		Для каждого ТекСтрока Из СписокИсполнителей Цикл
			ИсполнителиСтрока = ИсполнителиСтрока + Строка(ТекСтрока.Исполнитель) + ", ";
		КонецЦикла;
		ИсполнителиСтрока = Лев(ИсполнителиСтрока, СтрДлина(ИсполнителиСтрока) - 2);
	ИначеЕсли СписокИсполнителей.Количество() Тогда
		ИсполнителиСтрока = СписокИсполнителей[0].Исполнитель;		
	КонецЕсли;
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры








