
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Список.Параметры.УстановитьЗначениеПараметра("ОграничиватьНаправления", ПараметрыСеанса.ОграничиватьНаправления);
	//Список.Параметры.УстановитьЗначениеПараметра("ДоступныеНаправления", ПараметрыСеанса.ДоступныеНаправления);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия);
	Список.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПользователи", ПараметрыСеанса.ДоступныеПользователи);
	Элементы.СотрудникиПредприятия.Видимость = Истина;
КонецПроцедуры
