
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = "Данная печатная форма недоступна. Необходимо печатать ТОРГ-2. По разъяснению обращаться в бухгалтерию";
	//Сообщение.Сообщить();
	
	ТабДок = ПечатьТорг4(ПараметрКоманды);
		
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.АвтоМасштаб = Истина;
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента");
	ФормаПечати.Результат = ТабДок;
	ФормаПечати.Открыть();
	
КонецПроцедуры

Функция ПечатьТорг4(ПараметрКоманды)
	
	Возврат Документы.УЧ_ПоступлениеТоваров.ПечатьТОРГ4(ПараметрКоманды);
	
КонецФункции