
&НаКлиенте
Процедура РазбитьПлатеж(Команда)
	
	Если Сумма > СуммаИсходная Тогда
		сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
		ЭтотОбъект,
		"Сумма превышает сумму платежа " + СуммаИсходная + ". Платеж не может быть разбит.",
		,		
		,
		"Сумма", 
		Истина);
		Возврат;
	КонецЕсли;
	
	Оповестить("сабРазбитьПлатеж", Новый Структура("Дата, Сумма, Курс, КурсКонтрагента, ВалютнаяСумма, ВалютнаяСуммаКонтрагента, КлючЗаписи, ИмяФормыВладельца", 
													Дата, Сумма, Курс, КурсКонтрагента, ВалютнаяСумма, ВалютнаяСуммаКонтрагента, КлючЗаписи, ИмяФормыВладельца));
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Курс.Видимость = Курс И НЕ Курс = 1;
	Элементы.ВалютнаяСумма.Видимость = Курс И НЕ Курс = 1;
	Элементы.Валюта.Видимость = Курс И НЕ Курс = 1;
	Элементы.ВалютнаяСуммаИсходная.Видимость = Курс И НЕ Курс = 1;
	
	Элементы.КурсКонтрагента.Видимость = КурсКонтрагента И НЕ КурсКонтрагента = 1;
	Элементы.ВалютнаяСуммаКонтрагента.Видимость = КурсКонтрагента И НЕ КурсКонтрагента = 1;
	Элементы.ВалютаКонтрагента.Видимость = КурсКонтрагента И НЕ КурсКонтрагента = 1;
	Элементы.ВалютнаяСуммаКонтрагентаИсходная.Видимость = КурсКонтрагента И НЕ КурсКонтрагента = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ВалютнаяСумма = ?(Курс, Сумма / Курс, 0);
	ВалютнаяСуммаКонтрагента = ?(КурсКонтрагента, Сумма / КурсКонтрагента, 0);
КонецПроцедуры

&НаКлиенте
Процедура КурсКонтрагентаПриИзменении(Элемент)
	Сумма = КурсКонтрагента * ВалютнаяСуммаКонтрагента;
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	Сумма = Курс * ВалютнаяСумма;
КонецПроцедуры
