
&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НовоеПредставление = ОткрытьФормуМодально("РегистрСведений.ИзмененияВ1С.Форма.ФормаНастройки", Новый Структура("ПредставлениеВыбранныхОбъектов", Запись.ОбъектМетаданных));
	
	Если Не НовоеПредставление = Неопределено Тогда
		Запись.ОбъектМетаданных = НовоеПредставление;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.РазделПрограммы.СписокВыбора.Добавить("Общее");
	Для каждого ТекПодсистема Из Метаданные.Подсистемы Цикл
		Элементы.РазделПрограммы.СписокВыбора.Добавить(ТекПодсистема.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.ДатаНачалаРабот = Дата('00010101') Тогда
		Запись.ДатаНачалаРабот = ТекущаяДата();	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.Исполнитель) Тогда
		Запись.Исполнитель = БюджетныйНаСервере.ПолучитьПользователя();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметПриИзменении(Элемент)
	//Если ТипЗнч(Запись.Предмет) = Тип("ДокументСсылка.Д_ОбращенияВТехПоддержку") И ЗначениеЗаполнено(Запись.Предмет) Тогда
	//	РеквизитыОбращения = БюджетныйНаСервере.ВернутьРеквизиты(Запись.Предмет, "Примечания, РазделПрограммы, Проект, ИсточникОбращения, ВидЗаявки, Автор, ОбъектМетаданных, Содержание");
	//	ЗаполнитьЗначенияСвойств(Запись, РеквизитыОбращения);
	//	Запись.ИнициаторРабот = РеквизитыОбращения.Автор;
	//	Запись.Заголовок = РеквизитыОбращения.Примечания;
	//КонецЕсли;
КонецПроцедуры
