
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПользователи", ПараметрыСеанса.ДоступныеПользователи);
	//Обращения.Параметры.УстановитьЗначениеПараметра("Проект", Элементы.Список.ТекущаяСтрока);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсе", ПоказатьВсе);

	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.Группа3.Видимость = НЕ Параметры.РежимВыбора;
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//Обращения.Параметры.УстановитьЗначениеПараметра("Проект", Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьВсе", ПоказатьВсе);
КонецПроцедуры
