&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Сценарий") Тогда 
		Сценарий = Параметры.Сценарий;
		Предприятие = Параметры.Предприятие;
		Номенклатура = Параметры.Номенклатура;
		Сырье = Параметры.Сырье;
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Параметр = "Объем производства, дал:";
		НоваяСтрока.Значение = Параметры.ОбъемПрва;
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Параметр = "Выход сырца из тонны крахмала, дал:";
		НоваяСтрока.Значение = Параметры.Выход;
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Параметр = "Крахмалистость средняя, %:";
		НоваяСтрока.Значение = Параметры.Крахмал;
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Параметр = "Отбор ректификата, %:";
		НоваяСтрока.Значение = Параметры.Отбор;
		
		НоваяСтрока = ТЧ.Добавить();
		НоваяСтрока.Параметр = "Доля использования сырья, %:";
		НоваяСтрока.Значение = Параметры.Доля;
	КонецЕсли;
КонецПроцедуры







