
&НаКлиенте
Процедура ОК(Команда)
	
	УсловияВладельца = ВладелецФормы.ДопУсловия;
	
	КоличествоТекУсловий = УсловияВладельца.Количество();
	
	Для Сч = 1 По КоличествоТекУсловий Цикл
		Если УсловияВладельца[КоличествоТекУсловий - Сч].ИдСтроки = ИД Тогда
			УсловияВладельца.Удалить(КоличествоТекУсловий - Сч);
		КонецЕсли;
	КонецЦикла;	
		
	Для Каждого СтрокаУсловий Из ДопУсловия Цикл
		ЗаполнитьЗначенияСвойств(ВладелецФормы.ДопУсловия.Добавить(), СтрокаУсловий);
	КонецЦикла;
	
	Оповестить("ОбновитьНадписиДопУсловий");
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИД") Тогда
		ИД = Параметры.ИД;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДопУсловияРеквизитПриИзменении(Элемент)
	
	УстановитьТип();
			
КонецПроцедуры

&НаКлиенте
Процедура ДопУсловияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.ДопУсловия.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекДанные.ИДСтроки) Тогда
			ТекДанные.ИДСтроки = ИД;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УсловияВладельца = ВладелецФормы.ДопУсловия;
	
	НайденныеСтроки = УсловияВладельца.НайтиСтроки(Новый Структура("ИДСтроки", ИД));
	Для Каждого СтрокаУсловий Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(ДопУсловия.Добавить(), СтрокаУсловий);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопУсловияПриАктивизацииСтроки(Элемент)
	
	УстановитьТип();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьТип()
	
	ТекДанныеСтроки = Элементы.ДопУсловия.ТекущиеДанные;
	Если ТекДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Элементы.ДопУсловияЗначение.РежимВыбораИзСписка = Ложь;
	
	Массив = Новый Массив;
	Если ТекДанныеСтроки.Реквизит = "Сумма документа"  Или ТекДанныеСтроки.Реквизит = "Скидка (ДДУ)" Тогда
		Массив.Добавить(Тип("Число"));
		КЧ = Новый КвалификаторыЧисла(15,2);
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = 0;		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "Источник" Тогда
		Массив.Добавить(Тип("СправочникСсылка.Кассы"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "ИнвПроект" Тогда
		Массив.Добавить(Тип("СправочникСсылка.ОбъектыСтроительства"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = ПредопределенноеЗначение("Справочник.ОбъектыСтроительства.ПустаяСсылка");		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "Автор" Тогда
		Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "АвтоДоставка" Или ТекДанныеСтроки.Реквизит = "ЖДДоставкаДоки" Или ТекДанныеСтроки.Реквизит = "АвтоДоставкаДоки" Тогда
		Массив.Добавить(Тип("Булево"));
		Если Не ЗначениеЗаполнено(ТекДанныеСтроки.Значение) Тогда
			ТекДанныеСтроки.Значение = Ложь;		
		КонецЕсли;
	ИначеЕсли ТекДанныеСтроки.Реквизит = "ТипРеализации" Тогда
		Массив.Добавить(Тип("Строка"));
		КС = Новый КвалификаторыСтроки(20);
		Элементы.ДопУсловияЗначение.РежимВыбораИзСписка = Истина;
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Спирт№1");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Спирт№2");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Спирт№2ПодДоки");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Доки");
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("ПрочаяПродукция");
	ИначеЕсли ТекДанныеСтроки.Реквизит = "ВидМероприятия" Тогда
		Массив.Добавить(Тип("Строка"));
		КС = Новый КвалификаторыСтроки(20);
		Элементы.ДопУсловияЗначение.РежимВыбораИзСписка = Истина;
		Элементы.ДопУсловияЗначение.СписокВыбора.Добавить("Скидка");
	КонецЕсли;
	Описание = Новый ОписаниеТипов(Массив,,,КЧ,КС);
	ТекДанныеСтроки.ТипЗначенияРеквизита = Описание;
	
	Элементы.ДопУсловияЗначение.ОграничениеТипа = ТекДанныеСтроки.ТипЗначенияРеквизита;	
	
КонецПроцедуры	
