
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеЛицензии = РегистрыСведений.сабСоответствияОрганизацийПредприятиям.ПроверитьУстановкуКлюча();
	//КлючУстановлен = Ложь;
	
	Если НЕ ДанныеЛицензии.КлючЛицензии Тогда
		Элементы.Группа23.Видимость = Истина;
		Элементы.Список.Видимость = Ложь;
		Элементы.Группа1.Видимость = Ложь;
		Элементы.Группа8.Видимость = Ложь;
	Иначе	
		Элементы.Группа23.Видимость = Ложь;
		Элементы.Список.Видимость = Истина;
		Элементы.Группа1.Видимость = Истина;
		Элементы.Группа8.Видимость = Истина;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЛицензии);
		Элементы.ПробныйПериод.Видимость = ДанныеЛицензии.Свойство("Ограничение") И ЗначениеЗаполнено(ДанныеЛицензии.Ограничение);		
		Элементы.ВвестиКлючРегистрации.Видимость = Элементы.ПробныйПериод.Видимость;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "Наименование" Тогда
		Если Элементы.Список.ТекущиеДанные.Наименование = "1. Настройка технических данных" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма0", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
		ИначеЕсли Элементы.Список.ТекущиеДанные.Наименование = "2. Настройка констант" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма1", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
		ИначеЕсли Элементы.Список.ТекущиеДанные.Наименование = "2. Настройка структуры предприятия" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма2", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
		ИначеЕсли Элементы.Список.ТекущиеДанные.Наименование = "3. Настройки соответствия документов" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма3", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
		ИначеЕсли Элементы.Список.ТекущиеДанные.Наименование = "4. Настройка соответствия плана счетов" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма4", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
		ИначеЕсли Элементы.Список.ТекущиеДанные.Наименование = "6. Настройка документооборота" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма5", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));
		ИначеЕсли Элементы.Список.ТекущиеДанные.Наименование = "5. Ввод остатков на начало" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма6", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));		
		ИначеЕсли Элементы.Список.ТекущиеДанные.Наименование = "6. Начало работы" Тогда
			ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма7", Новый Структура("Ключ", Элементы.Список.ТекущаяСтрока));		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СтандартнаяОбработка = Ложь;
	Если Элементы.Список.ТекущиеДанные.Код = 0 Тогда
		ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.Форма0");		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКлюч(Команда)
	Если Не ЗначениеЗаполнено(КлючПрограммы) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен ключ программы.";
		Сообщение.Поле = "КлючПрограммы";
		//Сообщение.УстановитьДанные();
		Сообщение.Сообщить();	
		Возврат;	
	КонецЕсли;
	ВвестиКлючНаСервере(КлючПрограммы);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКлючЛицензии(Команда)
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВвестиКлючЛицензииЗавершение", ЭтотОбъект, Новый Структура("КлючПрограммы", КлючПрограммы)), КлючПрограммы, "Введите ключ лицензии");
КонецПроцедуры

&НаКлиенте
Процедура ВвестиКлючЛицензииЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Ключ = ?(Строка = Неопределено, ДополнительныеПараметры.КлючПрограммы, Строка);
	
	Если НЕ Ключ = "" Тогда
		ВвестиКлючНаСервере(Ключ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВвестиКлючНаСервере(Ключ, Пробный = Ложь)
	
	Ответ = РегистрыСведений.сабСоответствияОрганизацийПредприятиям.ВвестиКлючНаСервере(Ключ, Пробный);
	
	Если НЕ СтрНайти(Ответ, "Ключ лицензии успешно установлен.") Тогда
		Сообщить(Ответ);
		Возврат;
	КонецЕсли;
	
	Сообщить("Ключ лицензии успешно установлен.");
	
	ПриСозданииНаСервере(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПробныйПериод(Команда)
	ВвестиКлючНаСервере("", Истина);
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ОткрытьФорму("Справочник.сабМониторВнедрения.Форма.ФормаСписка1");
КонецПроцедуры

