
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БюджетныйНаСервере.ДействияПриСозданииФормыСправочника(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МетодикаКонтроляОтрицательныхОстатковПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура МетодикаКонтроляОтрицательныхОстатковПриИзменении(Элемент)
	
	Элементы.ГоризонтКонтроляПоследовательности.Видимость = Объект.МетодикаКонтроляОтрицательныхОстатков = "Новая";
	
	Если Не Элемент = Неопределено И Объект.МетодикаКонтроляОтрицательныхОстатков = "Старая" Тогда
		Объект.ГоризонтКонтроляПоследовательности = 0;
	КонецЕсли;
		
КонецПроцедуры
