
&НаКлиенте
Процедура СерииНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.СерииНоменклатуры.ТекущиеДанные.Номенклатура = Номенклатура;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИЗакрыть(Команда)
	СтруктураПараметров = ПолучитьМассивСтруктур();
	Закрыть(Новый Структура("НомерСтрокиРеализации, СерииНоменклатуры", НомерСтрокиРеализации, СтруктураПараметров));
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтруктур()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(СерииНоменклатуры.Выгрузить());	
КонецФункции // ()


&НаКлиенте
Процедура СерииНоменклатурыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	КоличествоНовое = СерииНоменклатуры.Итог("Количество");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоНовое = СерииНоменклатуры.Итог("Количество"); 
	КоличествоДоИзмененияИтог = СерииНоменклатуры.Итог("КоличествоДоИзменения");
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Параметры.Свойство("СвязиПараметровВыбораМассив") Тогда
	//	Если ТипЗнч(Параметры.СвязиПараметровВыбораМассив) = Тип("ФиксированныйМассив") Тогда
	//		Если Параметры.СвязиПараметровВыбораМассив.Количество > 0 Тогда
	//			Элементы.СерииНоменклатуры.ПодчиненныеЭлементы.СерииНоменклатурыСерияНоменклатуры.СвязиПараметровВыбора = Параметры.СвязиПараметровВыбораМассив;	
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры
