
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	БП = БПСервер.ПоискБП("УтверждениеБюджета", ПараметрКоманды);
	Если НЕ БП = Неопределено Тогда
		Если БюджетныйНаСервере.ВернутьРеквизит(БП, "Стартован") Тогда
			Если НЕ БюджетныйНаСервере.ВернутьРеквизит(БП, "ОснованиеЗаблокирован") Тогда
				ОткрытьФорму("БизнесПроцесс.УтверждениеБюджета.ФормаОбъекта", Новый Структура("Ключ", БП)); 
				Возврат;
			Иначе	
				Предупреждение("Бизнес-процесс согласования уже запущен.");
				Возврат;		
			КонецЕсли;
		Иначе
			ОткрытьФорму(БПСервер.ПолучитьПолноеИмяФормы(БП), Новый Структура("Ключ", БП));
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	Если Вопрос("После старта процесса согласования изменения в документе станут невозможны. Уверены что хотите стартовать бизнес процесс?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		РеквизитыЗаявки = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрКоманды, "Комментарий, Предприятие");
		
		ТекФормаБП = ПолучитьФорму("БизнесПроцесс.УтверждениеБюджета.ФормаОбъекта");
		ТекФормаБП.Объект.Автор = БюджетныйНаСервере.ПолучитьПользователя();
		ТекФормаБП.Объект.Описание = РеквизитыЗаявки.Комментарий;
		ТекФормаБП.Объект.Заявка = ПараметрКоманды;
		ТекФормаБП.Объект.Предприятие = РеквизитыЗаявки.Предприятие;
		ТекФормаБП.Объект.ОснованиеЗаблокирован = Истина;
		ТекФормаБП.ВладелецФормы = ПараметрыВыполненияКоманды.Источник;
		//ТекФормаБП.Объект.СтандартныйМаршрут = Истина;  // оставим возможность гибкого маршрутизирования
		
		ДанныеФормы = ТекФормаБП.Объект;
		ЗаполнитьНаСервере(ДанныеФормы, ПараметрКоманды);
		КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
		ТекФормаБП.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ТекОбъект, ТекОснование)
	
	БПСервер.ДобавитьРецензентовВМаршрут(ТекОбъект, "ДопСогласование", ТекОснование.Ссылка, ТекОснование.Предприятие, ТекОснование.Дата);
	
	ТаблицаСогласующих = ТекОбъект.ДопСогласование.Выгрузить();
	ТекОбъект.ДопСогласование.Загрузить(ТаблицаСогласующих);
	
КонецПроцедуры
