
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЦенаПоставщика Тогда
		РеквизитБазовыйВидЦены = ПроверяемыеРеквизиты.Найти("БазовыйВидЦены");
		ПроверяемыеРеквизиты.Удалить(РеквизитБазовыйВидЦены);
		РеквизитНаценка = ПроверяемыеРеквизиты.Найти("Наценка");
		ПроверяемыеРеквизиты.Удалить(РеквизитНаценка);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("ВидЗаданияЦеныПоДаннымИБ");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	ИначеЕсли СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаДругойВидЦен Или СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуПоступления Тогда
		РеквизитВид = ПроверяемыеРеквизиты.Найти("ВидЗаданияЦеныПоДаннымИБ");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("Поставщик");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	ИначеЕсли СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБ Тогда
		РеквизитБазовыйВидЦены = ПроверяемыеРеквизиты.Найти("БазовыйВидЦены");
		ПроверяемыеРеквизиты.Удалить(РеквизитБазовыйВидЦены);
		РеквизитНаценка = ПроверяемыеРеквизиты.Найти("Наценка");
		ПроверяемыеРеквизиты.Удалить(РеквизитНаценка);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("Поставщик");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	ИначеЕсли СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную Тогда	
		РеквизитБазовыйВидЦены = ПроверяемыеРеквизиты.Найти("БазовыйВидЦены");
		ПроверяемыеРеквизиты.Удалить(РеквизитБазовыйВидЦены);
		РеквизитНаценка = ПроверяемыеРеквизиты.Найти("Наценка");
		ПроверяемыеРеквизиты.Удалить(РеквизитНаценка);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("ВидЗаданияЦеныПоДаннымИБ");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
		РеквизитВид = ПроверяемыеРеквизиты.Найти("Поставщик");
		ПроверяемыеРеквизиты.Удалить(РеквизитВид);
	КонецЕсли;	
		
КонецПроцедуры
