
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ВидВнутреннегоДокумента, ПодтипВнутрДокумента, ФормаВыбора", ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.СогласованиеДоговораТММ"), ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.СогласованиеДоговораТММ"), Ложь);
	ОткрытьФорму("ЖурналДокументов.ВнутренниеДокументы.Форма.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
