
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабличныйДокумент = ПечатьТН(ПараметрКоманды);
	
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента");
	ФормаПечати.Результат = ТабличныйДокумент;
	ФормаПечати.Открыть();
	
КонецПроцедуры

Функция ПечатьТН(ПараметрКоманды)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";
	
	ДанныеДляПечати = Документы.УЧ_ВозвратТоваровПоставщику.ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(ПараметрКоманды);
	
	Обработки.ПечатьТранспортнойНакладной.ЗаполнитьТабличныйДокументТранспортнойНакладной(
	ТабличныйДокумент,
	ДанныеДляПечати,
	Неопределено
	);
	
	Возврат ТабличныйДокумент;
	
КонецФункции