
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БазовыйТекстЗапроса = Список.ТекстЗапроса;
	//Элементы.СписокКорректировок.Видимость = Ложь;
	//Элементы.СписокКорректировокДДУ.Видимость = Ложь;
	//Элементы.ЗаявкаТЧ.Видимость = Ложь;
	//Элементы.Группа1.Видимость = Ложь;
	//Фильтр2.Очистить();
	//СписокТиповДокументов.Очистить();
	//
	//Если Параметры.Свойство("ВидВнутреннегоДокумента") Тогда
	//	ЗполнитьФильтрПоТипуДокумента(Параметры);
	//	ЗаполнитьПечать(Параметры);
	//	Элементы.СтруктураДокументовГруппа.Видимость = Ложь;
	//ИначеЕсли ПараметрыСеанса.СтруктураПараметровФормСпискаДокументооборота.Свойство("ВидВнутреннегоДокумента") Тогда
	СформироватьВидимостьПолей();
	//	ЗаполнитьПечать(ПараметрыСеанса.СтруктураПараметровФормСпискаДокументооборота);
	//	ПараметрыСеанса.СтруктураПараметровФормСпискаДокументооборота = Новый ФиксированнаяСтруктура(Новый Структура);
	//	Элементы.СтруктураДокументовГруппа.Видимость = Ложь;
	//Иначе		
	//	Фильтр2.Добавить("Все документы");
	//	СписокТиповДокументов.Добавить("Все документы");
	//	ЗаполнитьВидыОпераций();
	//КонецЕсли;
	
	ТекПП = БюджетныйНаСервере.ПолучитьПредприятия();
	
	РеквизитыПользователя = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрыСеанса.ТекущийПользователь, "ДоступныПредприятияИзСписка, ОграничениеПодразделений, ВидимостьПоСогласованию");  
	
	//Добавим Пользователю БОБ возможность видеть заявки пользователя КСА
	МассивПользователей = БПСервер.ПолучитьМассивПользователей();
	//Если МассивПользователей.Найти(Справочники.Пользователи.НайтиПоНаименованию("БОБ")) <> неопределено Тогда 
	//	МассивПользователей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("КСА"));
	//КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", МассивПользователей);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеПредприятия", НЕ РеквизитыПользователя.ДоступныПредприятияИзСписка);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПредприятия", ТекПП);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаявки", БюджетныйНаСервере.РольАдминаДоступнаСервер());
	//Список.Параметры.УстановитьЗначениеПараметра("Тип", Фильтр2);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеПодразделения", НЕ РеквизитыПользователя.ОграничениеПодразделений);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПодразделения", ПараметрыСеанса.ДоступныеПодразделения);
	Список.Параметры.УстановитьЗначениеПараметра("ДопСтатьи", ?(ПараметрыСеанса.ТекущийПользователь.ДоступныеСтатьи.Количество(), Истина, Ложь));
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеСтатьиСырья", ПараметрыСеанса.ТекущийПользователь.ДоступныеСтатьи.ВыгрузитьКолонку("СтатьяДДС"));
	Список.Параметры.УстановитьЗначениеПараметра("ДоступностьПриватныхДокументов", сабОбщегоНазначения.ПолучитьЗначениеСвойства(ПараметрыСеанса.ТекущийПользователь, "Доступность приватных документов"));
	
	//СписокКорректировокДДУ.Параметры.УстановитьЗначениеПараметра("ДоговорОснование", NULL);
	//СписокКорректировок.Параметры.УстановитьЗначениеПараметра("ДокОснование", NULL);
	//ЗаявкаТЧ.Параметры.УстановитьЗначениеПараметра("Ссылка", NULL);
	
	Если РеквизитыПользователя.ВидимостьПоСогласованию И НЕ Параметры.Свойство("ТекПлатежка") Тогда
		//Элементы.Группа2.Видимость = Ложь;
		ФильтроватьСерверСогласованиеАвтор();
	Иначе
		Если Параметры.Свойство("ТекПлатежка") Тогда
			ТекПлатежка = Параметры.ТекПлатежка;
			//Элементы.Группа2.Видимость = Ложь;
		Иначе
			ТекПлатежка = Неопределено ;
		КонецЕсли;
		Список.Параметры.УстановитьЗначениеПараметра("Авторство", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Истина);
		Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Истина);
		Фильтр = "Нет фильтра";
	КонецЕсли;
	
	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Иначе
		Элементы.Список.РежимВыбора = Ложь;
	КонецЕсли;
	
	Если ПараметрыСеанса.СтруктураПараметровФормСпискаДокументооборота.Свойство("ФормаВыбора") Тогда
		Элементы.Список.РежимВыбора = ПараметрыСеанса.СтруктураПараметровФормСпискаДокументооборота.ФормаВыбора;	
	КонецЕсли;
	
	//УстановитьПараметрыРасширенногоПоиска();
	//сабБПКлиентСервер.ДобавитьДеревоМаршрута(Элементы, Команды, ТекущаяСтрокаГруппы, МаршрутДерево, Справочники.МаршрутыДвиженияЗаявок.ПустаяСсылка(), УсловноеОформление, Новый Структура("КнопкиУправления, ДопУсловияВидимость, ТолькоПросмотр, Согласовано", Ложь, Ложь, Истина, Истина));
	
	//заполнить структуру доков
	//ЗаполнитьСтруктуруДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.СтруктураДокументов.Развернуть(СтруктураДокументов.ПолучитьЭлементы()[0].ПолучитьИдентификатор());
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСтруктуруДокументов()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Д_ВидыВнутреннихДокументов.Наименование КАК Наименование,
	               |	Д_ВидыВнутреннихДокументов.Ссылка
	               |ИЗ
	               |	Справочник.Д_ВидыВнутреннихДокументов КАК Д_ВидыВнутреннихДокументов
	               |ГДЕ
	               |	НЕ Д_ВидыВнутреннихДокументов.ИмяДокумента = """"
	               |	И Д_ВидыВнутреннихДокументов.Родитель = ЗНАЧЕНИЕ(Справочник.Д_ВидыВнутреннихДокументов.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НоваяСтрока = СтруктураДокументов.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Значение = "Все документы";	
	НоваяСтрока.Уровень = 0;
	НоваяСтрока.Идентификатор = НоваяСтрока.ПолучитьИдентификатор();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока2 = НоваяСтрока.ПолучитьЭлементы().Добавить();
		НоваяСтрока2.Значение = Выборка.Наименование;	
		НоваяСтрока2.Ссылка = Выборка.Ссылка;	
		НоваяСтрока2.Уровень = 1;
		НоваяСтрока.Идентификатор = НоваяСтрока2.ПолучитьИдентификатор();
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗполнитьФильтрПоТипуДокумента(ПараметрыПроцедуры)
	
	Фильтр2.Добавить(ПараметрыПроцедуры.ВидВнутреннегоДокумента);
	Список.Отбор.Элементы.Очистить();
	
	Если ПараметрыПроцедуры.ВидВнутреннегоДокумента = "Все документы" Тогда
		СписокТиповДокументов.Добавить("Все документы");
		
	Иначе
		Если ЗначениеЗаполнено(ПараметрыПроцедуры.ВидВнутреннегоДокумента.Родитель) Тогда
			СписокТиповДокументов.Добавить(ПараметрыПроцедуры.ВидВнутреннегоДокумента.Родитель);
		КонецЕсли;
		
		СписокТиповДокументов.Добавить(ПараметрыПроцедуры.ВидВнутреннегоДокумента);
		
		
		//ПараметрыСеанса.СтруктураПараметровФормСпискаДокументооборота = Новый ФиксированнаяСтруктура(Новый Структура);
		
		СписокЗначений = Новый СписокЗначений;
		
		Если ПараметрыПроцедуры.Свойство("ИмяДокумента") Тогда
			СписокЗначений.Добавить(Тип("ДокументСсылка." + ПараметрыПроцедуры.ИмяДокумента));
		Иначе
			
			Для каждого ТекСтрока Из Фильтр2 Цикл
				ИмяДокумента = БПСервер.ПолучитьИмяДокументаПоСинониму(ТекСтрока.Значение.Наименование);
				СписокЗначений.Добавить(Тип("ДокументСсылка." + ИмяДокумента));
			КонецЦикла; 
			
		КонецЕсли;
		
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Тип");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		НовыйОтбор.ПравоеЗначение = СписокЗначений;
		
		Если ПараметрыПроцедуры.Свойство("ПодтипВнутрДокумента") Тогда
			НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДокумента");
			НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйОтбор.ПравоеЗначение = ПараметрыПроцедуры.ПодтипВнутрДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	
	СформироватьВидимостьПолей();
	
	//перезаполнить команды
	Для каждого Элемент Из Элементы Цикл
		Если Элемент.Родитель = Элементы.Создать И (ТипЗнч(Элемент) = Тип("КнопкаФормы") ИЛИ ТипЗнч(Элемент) = Тип("ГруппаФормы")) Тогда			
			//Попытка
			//	
			Элемент.Видимость = Ложь;
			//	
			//Исключение
			//	а = 1;	
			//КонецПопытки;
		КонецЕсли;		
	КонецЦикла; 
	ЗаполнитьВидыОпераций();

	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьВидимостьПолей()
	Элементы.СоздатьПоПоследним.Видимость = Ложь;
	
	Список.ТекстЗапроса = БазовыйТекстЗапроса;
	УстановитьПривилегированныйРежим(Истина);
	
	сабОбщегоНазначения.УстановитьСвойствоЭлемента(Элементы, "СуммаДокумента", "Видимость", Истина);
	сабОбщегоНазначения.УстановитьСвойствоЭлемента(Элементы, "ЗаявкаТЧ", "Видимость", Истина);
	сабОбщегоНазначения.УстановитьСвойствоЭлемента(Элементы, "Группа1", "Видимость", Истина);
	сабОбщегоНазначения.УстановитьСвойствоЭлемента(Элементы, "ВидДокумента", "Видимость", Ложь);
	
	Заголовок = "Реестры платежей";
	
	ДопПоля = "ВнутренниеДокументы.Ссылка.ТипИсточника КАК ТипПлатежа";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, """Переменное поле"" КАК ПеременноеПоле", ДопПоля);	
	Колонка3 = ПолучитьКолонку(Элементы, "КолонкаСписка0", Тип("ПолеФормы"), Элементы.Список, Элементы.Предприятие);
	Колонка3.ПутьКДанным = "Список.ТипПлатежа";
	Колонка3.Заголовок = "Тип платежа";
	Колонка3.Вид = ВидПоляФормы.ПолеНадписи;
	Колонка3.Ширина = 6;
	//Элементы.Фильтр2.Доступность = Ложь;
	//Элементы.ДопИнформация.Видимость = Ложь;
	//Элементы.Контрагент.Видимость = Ложь;
	//Элементы.СписокКорректировок.Видимость = Ложь;
	
	//ЗаполнитьПоследнимиЗаявками();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
Функция ПолучитьКолонку(Элементы, ИмяКолонки, ТипКолонки, Владелец, ЭлементРодитель)
	Если ТипЗнч(ЭлементРодитель) = Тип("Строка") Тогда
		Если Элементы.Найти(ЭлементРодитель) = Неопределено Тогда	
			ЭлементРодитель = Неопределено;
		Иначе
			ЭлементРодитель = Элементы[ЭлементРодитель];	
		КонецЕсли;		
	КонецЕсли;
	Тк = Элементы.Найти(ИмяКолонки);
	Если Тк = Неопределено Тогда
		Тк = Элементы.Вставить(ИмяКолонки, ТипКолонки, Владелец, ЭлементРодитель);
	Иначе
		Элементы.Удалить(Тк);
		Тк = Элементы.Вставить(ИмяКолонки, ТипКолонки, Владелец, ЭлементРодитель);
	КонецЕсли;
	Возврат Тк;
	
КонецФункции // ()


&НаКлиенте
Процедура ФильтроватьСерверАвтор()
	//Список.Отбор.Элементы.Очистить();
	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаявки", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФильтроватьСерверСогласование()
	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаявки", Ложь);
КонецПроцедуры

&НаСервере
Процедура ФильтроватьСерверСогласованиеАвтор()
	
	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ФильтроватьСервер()
	РеквизитыПользователя = БюджетныйНаСервере.ВернутьРеквизиты(БюджетныйНаСервере.ПолучитьПользователя(), "ДоступныПредприятияИзСписка, ОграничениеПодразделений, ВидимостьПоСогласованию");  
	
	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаявки", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФильтроватьСерверОплата()
	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаявки", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФильтроватьСерверИсполнение()
	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаявки", Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Фильтр = "Авторство" Тогда
		ФильтроватьСерверАвтор();
	ИначеЕсли Фильтр = "Согласовано вами" Тогда
		ФильтроватьСерверСогласование();
	ИначеЕсли Фильтр = "Неоплаченные" Тогда
		//ФильтроватьСерверНеоплаченные();
	ИначеЕсли Фильтр = "Ознакомление" Тогда
		ФильтроватьСерверОплата();
	ИначеЕсли Фильтр = "Исполненно вами" Тогда
		ФильтроватьСерверИсполнение();
		
	Иначе
		Если БюджетныйНаСервере.ВернутьРеквизит(БюджетныйНаСервере.ПолучитьПользователя(), "ВидимостьПоСогласованию") И НЕ Параметры.Свойство("ТекПлатежка") Тогда
			ФильтроватьСерверСогласованиеАвтор();
		Иначе
			ФильтроватьСервер();
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//Если НЕ Элементы.Список.ТекущиеДанные = Неопределено Тогда
	//	Согласование.Параметры.УстановитьЗначениеПараметра("Ссылка", Элементы.Список.ТекущаяСтрока);
	//Иначе
	//	Согласование.Параметры.УстановитьЗначениеПараметра("Ссылка", null);
	//КонецЕсли;
	//ТекЗаявка = Элементы.Список.ТекущаяСтрока;
	//
	//ОбработкаПрерыванияПользователя();
	//
	//ЗаполнитьДеревоМаршрута(ТекЗаявка);
	//Коллекция = МаршрутДерево.ПолучитьЭлементы();
	//
	//Для каждого ТекЭлемент Из Коллекция Цикл
	//	сабБПКлиентСервер.РазвернутьГруппировкиДерева(Элементы, МаршрутДерево);	
	//КонецЦикла;
	//
	//Если ТипЗнч(ТекЗаявка) = Тип("ДокументСсылка.Д_ЗаявкаНаОплату") Тогда
	//	
	//	Если НЕ Элементы.Список.ТекущиеДанные = Неопределено Тогда
	//		ЗаявкаТЧ.Параметры.УстановитьЗначениеПараметра("Ссылка", Элементы.Список.ТекущаяСтрока);
	//	Иначе
	//		ЗаявкаТЧ.Параметры.УстановитьЗначениеПараметра("Ссылка", Null);
	//	КонецЕсли;

	//	СуммаЗаявок = 0;
	//	
	//	Для Каждого Заявка Из Элементы.Список.ВыделенныеСтроки Цикл
	//		СуммаЗаявок = СуммаЗаявок + Элементы.Список.ДанныеСтроки(Заявка).СуммаДокумента;
	//	КонецЦикла;

	//КонецЕсли;
	//
	//Если Не ТекЗаявка = Неопределено Тогда
	//	СписокКорректировок.Параметры.УстановитьЗначениеПараметра("ДокОснование", ТекЗаявка);
	//	//ЗаполнитьПечать(ТекЗаявка);
	//КонецЕсли;
		
	
КонецПроцедуры

#Область РаботаСДеревомМаршрута

&НаСервере
Процедура ЗаполнитьДеревоМаршрута(ТекЗаявка)
	
	МаршрутДерево.ПолучитьЭлементы().Очистить();
	
	Если Не ЗначениеЗаполнено(ТекЗаявка) Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СогласованиеОбщееДопСогласование.СубъектСогласования,
	|	СогласованиеОбщееДопСогласование.Согласовано,
	|	СогласованиеОбщееДопСогласование.Пройден,
	|	СогласованиеОбщееДопСогласование.Пользователь,
	|	СогласованиеОбщееДопСогласование.Комментарии,
	|	СогласованиеОбщееДопСогласование.НомерСтроки КАК НомерСтроки,
	|	""Согласование"" КАК Тип,
	|	""Согласовать"" КАК НаименованиеЗадачи,
	|	1 КАК Порядок,
	|	СогласованиеОбщееДопСогласование.Ссылка,
	|	СогласованиеОбщееДопСогласование.ДатаВыполнения,
	|	СогласованиеОбщееДопСогласование.МаршрутДвижения,
	|	СогласованиеОбщееДопСогласование.НомерИтерации,
	|	СогласованиеОбщееДопСогласование.Уровень,
	|	СогласованиеОбщееДопСогласование.ТипГруппы,
	|	СогласованиеОбщееДопСогласование.ИДГруппы,
	|	СогласованиеОбщееДопСогласование.СрокВыполнения,
	|	СогласованиеОбщееДопСогласование.ВремяНаВыполнение
	|ИЗ
	|	БизнесПроцесс.СогласованиеОбщее.ДопСогласование КАК СогласованиеОбщееДопСогласование
	|ГДЕ
	|	СогласованиеОбщееДопСогласование.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Согласование3ДопСогласование.СубъектСогласования,
	|	Согласование3ДопСогласование.Согласовано,
	|	Согласование3ДопСогласование.Пройден,
	|	Согласование3ДопСогласование.Пользователь,
	|	Согласование3ДопСогласование.Комментарии,
	|	Согласование3ДопСогласование.НомерСтроки,
	|	""Согласование"",
	|	""Согласовать"",
	|	1,
	|	Согласование3ДопСогласование.Ссылка,
	|	Согласование3ДопСогласование.ДатаВыполнения,
	|	Согласование3ДопСогласование.МаршрутДвижения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.Согласование3.ДопСогласование КАК Согласование3ДопСогласование
	|ГДЕ
	|	Согласование3ДопСогласование.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Согласование1ДопСогласование.СубъектСогласования,
	|	Согласование1ДопСогласование.Согласовано,
	|	Согласование1ДопСогласование.Пройден,
	|	Согласование1ДопСогласование.Пользователь,
	|	Согласование1ДопСогласование.Комментарии,
	|	Согласование1ДопСогласование.НомерСтроки,
	|	""Согласование"",
	|	""Согласовать"",
	|	1,
	|	Согласование1ДопСогласование.Ссылка,
	|	Согласование1ДопСогласование.ДатаВыполнения,
	|	Согласование1ДопСогласование.МаршрутДвижения,
	|	Согласование1ДопСогласование.НомерИтерации,
	|	Согласование1ДопСогласование.Уровень,
	|	Согласование1ДопСогласование.ТипГруппы,
	|	Согласование1ДопСогласование.ИДГруппы,
	|	Согласование1ДопСогласование.СрокВыполнения,
	|	Согласование1ДопСогласование.ВремяНаВыполнение
	|ИЗ
	|	БизнесПроцесс.Согласование1.ДопСогласование КАК Согласование1ДопСогласование
	|ГДЕ
	|	Согласование1ДопСогласование.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Согласование2ДопСогласование.СубъектСогласования,
	|	Согласование2ДопСогласование.Согласовано,
	|	Согласование2ДопСогласование.Пройден,
	|	Согласование2ДопСогласование.Пользователь,
	|	Согласование2ДопСогласование.Комментарии,
	|	Согласование2ДопСогласование.НомерСтроки,
	|	""Согласование"",
	|	""Согласовать"",
	|	1,
	|	Согласование2ДопСогласование.Ссылка,
	|	NULL,
	|	Согласование2ДопСогласование.МаршрутДвижения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.Согласование2.ДопСогласование КАК Согласование2ДопСогласование
	|ГДЕ
	|	Согласование2ДопСогласование.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкиАдминистраторуДопСогласование.СубъектСогласования,
	|	ЗаявкиАдминистраторуДопСогласование.Согласовано,
	|	ЗаявкиАдминистраторуДопСогласование.Пройден,
	|	ЗаявкиАдминистраторуДопСогласование.Пользователь,
	|	ЗаявкиАдминистраторуДопСогласование.Комментарии,
	|	ЗаявкиАдминистраторуДопСогласование.НомерСтроки,
	|	""Согласование"",
	|	""Согласовать"",
	|	1,
	|	ЗаявкиАдминистраторуДопСогласование.Ссылка,
	|	ЗаявкиАдминистраторуДопСогласование.ДатаВыполнения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.ЗаявкиАдминистратору.ДопСогласование КАК ЗаявкиАдминистраторуДопСогласование
	|ГДЕ
	|	ЗаявкиАдминистраторуДопСогласование.Ссылка.Заявка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ТекЗаявка);
	
	Результат = Запрос.Выполнить();
	ВыборкаСогл = Результат.Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СогласованиеОбщееДопИсполнение.Исполнитель КАК Исполнитель,
	|	СогласованиеОбщееДопИсполнение.Исполнено КАК Исполнено,
	|	СогласованиеОбщееДопИсполнение.Пройдено КАК Пройдено,
	|	СогласованиеОбщееДопИсполнение.Пользователь,
	|	СогласованиеОбщееДопИсполнение.Комментарии,
	|	СогласованиеОбщееДопИсполнение.НомерСтроки КАК НомерСтроки,
	|	""Исполнение"" КАК Тип,
	|	СогласованиеОбщееДопИсполнение.НаименованиеЗадачи КАК НаименованиеЗадачи,
	|	2 КАК Порядок,
	|	СогласованиеОбщееДопИсполнение.Ссылка,
	|	СогласованиеОбщееДопИсполнение.НомерИтерации,
	|	СогласованиеОбщееДопИсполнение.Уровень,
	|	СогласованиеОбщееДопИсполнение.ТипГруппы,
	|	СогласованиеОбщееДопИсполнение.ИДГруппы
	|ИЗ
	|	БизнесПроцесс.СогласованиеОбщее.ДопИсполнение КАК СогласованиеОбщееДопИсполнение
	|ГДЕ
	|	СогласованиеОбщееДопИсполнение.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Согласование3ДопИсполнение.Исполнитель,
	|	Согласование3ДопИсполнение.Исполнено,
	|	Согласование3ДопИсполнение.Пройдено,
	|	Согласование3ДопИсполнение.Пользователь,
	|	Согласование3ДопИсполнение.Комментарии,
	|	Согласование3ДопИсполнение.НомерСтроки,
	|	""Исполнение"",
	|	2,
	|	NULL,
	|	Согласование3ДопИсполнение.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.Согласование3.ДопИсполнение КАК Согласование3ДопИсполнение
	|ГДЕ
	|	Согласование3ДопИсполнение.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Согласование1ДопИсполнение.Исполнитель,
	|	Согласование1ДопИсполнение.Исполнено,
	|	Согласование1ДопИсполнение.Пройдено,
	|	Согласование1ДопИсполнение.Пользователь,
	|	Согласование1ДопИсполнение.Комментарии,
	|	Согласование1ДопИсполнение.НомерСтроки,
	|	""Исполнение"",
	|	Согласование1ДопИсполнение.НаименованиеЗадачи,
	|	2,
	|	Согласование1ДопИсполнение.Ссылка,
	|	Согласование1ДопИсполнение.НомерИтерации,
	|	Согласование1ДопИсполнение.Уровень,
	|	Согласование1ДопИсполнение.ТипГруппы,
	|	Согласование1ДопИсполнение.ИДГруппы
	|ИЗ
	|	БизнесПроцесс.Согласование1.ДопИсполнение КАК Согласование1ДопИсполнение
	|ГДЕ
	|	Согласование1ДопИсполнение.Ссылка.Заявка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ТекЗаявка);
	
	Результат = Запрос.Выполнить();
	ВыборкаИсп = Результат.Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СогласованиеОбщееДопОповещение.Оповещен КАК Оповещен,
	|	СогласованиеОбщееДопОповещение.Оповещен КАК Пройдено,
	|	СогласованиеОбщееДопОповещение.Пользователь,
	|	СогласованиеОбщееДопОповещение.НомерСтроки КАК НомерСтроки,
	|	""Ознакомление"" КАК Тип,
	|	""Ознакомиться"" КАК НаименованиеЗадачи,
	|	3 КАК Порядок,
	|	СогласованиеОбщееДопОповещение.Ссылка,
	|	СогласованиеОбщееДопОповещение.НомерИтерации,
	|	СогласованиеОбщееДопОповещение.Уровень,
	|	СогласованиеОбщееДопОповещение.ТипГруппы,
	|	СогласованиеОбщееДопОповещение.ИДГруппы
	|ИЗ
	|	БизнесПроцесс.СогласованиеОбщее.ДопОповещение КАК СогласованиеОбщееДопОповещение
	|ГДЕ
	|	СогласованиеОбщееДопОповещение.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Согласование3Адресаты.Согласовано,
	|	Согласование3Адресаты.Согласовано,
	|	Согласование3Адресаты.Пользователь,
	|	Согласование3Адресаты.НомерСтроки,
	|	""Ознакомление"",
	|	""Ознакомиться"",
	|	3,
	|	Согласование3Адресаты.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.Согласование3.Адресаты КАК Согласование3Адресаты
	|ГДЕ
	|	Согласование3Адресаты.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Согласование1ДопОповещение.Оповещен,
	|	NULL,
	|	Согласование1ДопОповещение.Пользователь,
	|	Согласование1ДопОповещение.НомерСтроки,
	|	""Ознакомление"",
	|	""Ознакомиться"",
	|	3,
	|	Согласование1ДопОповещение.Ссылка,
	|	Согласование1ДопОповещение.НомерИтерации,
	|	Согласование1ДопОповещение.Уровень,
	|	Согласование1ДопОповещение.ТипГруппы,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.Согласование1.ДопОповещение КАК Согласование1ДопОповещение
	|ГДЕ
	|	Согласование1ДопОповещение.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	Согласование2Адресаты.Пользователь,
	|	Согласование2Адресаты.НомерСтроки,
	|	""Ознакомление"",
	|	""Ознакомиться"",
	|	3,
	|	Согласование2Адресаты.Ссылка,
	|	Согласование2Адресаты.НомерИтерации,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.Согласование2.Адресаты КАК Согласование2Адресаты
	|ГДЕ
	|	Согласование2Адресаты.Ссылка.Заявка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкиАдминистраторуДопОповещение.Оповещен,
	|	ЗаявкиАдминистраторуДопОповещение.Оповещен,
	|	ЗаявкиАдминистраторуДопОповещение.Пользователь,
	|	ЗаявкиАдминистраторуДопОповещение.НомерСтроки,
	|	""Ознакомление"",
	|	""Ознакомиться"",
	|	3,
	|	ЗаявкиАдминистраторуДопОповещение.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	БизнесПроцесс.ЗаявкиАдминистратору.ДопОповещение КАК ЗаявкиАдминистраторуДопОповещение
	|ГДЕ
	|	ЗаявкиАдминистраторуДопОповещение.Ссылка.Заявка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ТекЗаявка);
	
	Результат = Запрос.Выполнить();
	ВыборкаОзн = Результат.Выгрузить();
	
	
	
	ДопСогласование.Очистить();
	Для каждого ТекСтрока Из ВыборкаСогл Цикл
		НоваяСтрока = ДопСогласование.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		БизнесПроцесс = ТекСтрока.Ссылка;
	КонецЦикла; 
	
	ДопИсполнение.Очистить();
	Для каждого ТекСтрока Из ВыборкаИсп Цикл
		НоваяСтрока = ДопИсполнение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		БизнесПроцесс = ТекСтрока.Ссылка;
	КонецЦикла; 
	
	ДопОповещение.Очистить();
	Для каждого ТекСтрока Из ВыборкаОзн Цикл
		НоваяСтрока = ДопОповещение.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		БизнесПроцесс = ТекСтрока.Ссылка;
	КонецЦикла;
	
	ЗаполнитьСложныйМаршрут();
	
	
	//проставляем итоговых согласования, исполнения и ознакомления
	Элементы1Уровня = МаршрутДерево.ПолучитьЭлементы();
	Для каждого ТекЭлемент1Уровня Из Элементы1Уровня Цикл
		//Если ТекЭлемент1Уровня.Тип = "Согласование" Тогда
		Согласовано = Неопределено;
		Элементы2Уровня = ТекЭлемент1Уровня.ПолучитьЭлементы();
		Если Элементы2Уровня.Количество() Тогда
			Согласовано = Истина;
		КонецЕсли;
		Для каждого ТекЭлемент2Уровня Из Элементы2Уровня Цикл
			Если НЕ ТекЭлемент2Уровня.Пройден И НЕ ТекЭлемент2Уровня.Согласовано Тогда
				Согласовано = Неопределено;
				Прервать;
			ИначеЕсли НЕ ТекЭлемент2Уровня.Согласовано Тогда
				Согласовано = Ложь;	
			КонецЕсли;
		КонецЦикла;
		ТекЭлемент1Уровня.Пройден = Согласовано;
		ТекЭлемент1Уровня.Согласовано = Согласовано;
		//КонецЕсли;		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСложныйМаршрут()
	
	//очищаем тек маршрут
	Тек = МаршрутДерево.ПолучитьЭлементы();
	Тек.Очистить();
	
	ТекМассМаршрутов = Новый Массив;
	ТекМассМаршрутов.Добавить(ЭтаФорма); 
	
	Для каждого ТекМаршрутСтрока Из ТекМассМаршрутов Цикл
		сабБПКлиентСервер.ДобавитьДеревоМаршрута(Элементы, Команды, ТекущаяСтрокаГруппы, МаршрутДерево, ТекМаршрутСтрока, Неопределено, Новый Структура("КнопкиУправления, ДопУсловияВидимость, ТолькоПросмотр, Согласовано", Ложь, Ложь, Истина, Истина) );
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю(Команда)
	
	ЗначениеЧто = МаршрутДерево.НайтиПоИдентификатору(Элементы.ТаблицаФормы123.ТекущаяСтрока);
	ПодчиненныеЭлементыДерева = ЗначениеЧто.ПолучитьЭлементы();
	МассивПользователей = Новый Массив;
	Если ПодчиненныеЭлементыДерева.Количество() > 0 Тогда
		Для каждого ТекСтрока Из ПодчиненныеЭлементыДерева Цикл
			МассивПользователей.Добавить(ТекСтрока.Пользователь);		
		КонецЦикла; 		
	Иначе
		МассивПользователей.Добавить(Элементы.ТаблицаФормы123.ТекущиеДанные.Пользователь);
	КонецЕсли;
	Если МассивПользователей.Количество() Тогда
		БюджетныйНаКлиенте.УниверсальноеВыполнениеКоманды(МассивПользователей, "Справочник.Пользователи.Команда.СообщениеПользователю", Новый Структура("Документ", Элементы.Список.ТекущаяСтрока) );	
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

&НаСервере
Функция ЕстьЭлемент(КоллекцияЭлементов, НаименованиеПункта)
	Для каждого ТекЭлемент Из КоллекцияЭлементов Цикл
		Если ТекЭлемент.Тип = НаименованиеПункта Тогда
			Возврат ТекЭлемент;	
		КонецЕсли;	
	КонецЦикла; 
	Возврат Неопределено;	
КонецФункции // ()

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	УстановитьПользователя();
КонецПроцедуры

&НаСервере
Процедура УстановитьПользователя()
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "Корректировка" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элементы.Список.ТекущиеДанные.Корректировка);
	ИначеЕсли Поле.Имя = "ПР_Отгрузка" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элементы.Список.ТекущиеДанные.ПР_Отгрузка);
	ИначеЕсли Поле.Имя = "УЧ_Отгрузка" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(Элементы.Список.ТекущиеДанные.УЧ_Отгрузка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	//Если Копирование Тогда
	//	Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("ДокументСсылка.Д_СлужебнаяЗаписка") Тогда
	//		БюджетныйНаКлиенте.ДобавитьМаршрутВХранилище(Элемент, Копирование);
	//		МассивСЗ = Новый Массив;
	//		МассивСЗ.Добавить(ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.СлужебнаяЗаписка"));
	//		МассивСЗ.Добавить(ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.Объяснительная"));
	//		МассивСЗ.Добавить(ПредопределенноеЗначение("Справочник.Д_ВидыВнутреннихДокументов.ИнформационноеПисьмо"));
	//		
	//		РеквСЗ = БюджетныйНаСервере.ВернутьРеквизиты(Элемент.ТекущаяСтрока, "ВидСЗ, ВидСЗ.ИмяДокумента");
	//		
	//		Если МассивСЗ.Найти(РеквСЗ.ВидСЗ) = Неопределено Тогда
	//			Отказ = Истина;
	//			ТекФормаБП = ПолучитьФорму("Документ." + РеквСЗ.ВидСЗИмяДокумента + ".ФормаОбъекта");
	//			ДанныеФормы = ТекФормаБП.Объект;
	//			ЗаполнитьНаСервере(ДанныеФормы, Элемент.ТекущаяСтрока);
	//			КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
	//			ТекФормаБП.Объект.Номер = "";
	//			ТекФормаБП.Открыть();
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	//для облегчения заполнения маршрута
	//	БюджетныйНаКлиенте.ДобавитьМаршрутВХранилище(Элемент, Копирование);
	//	
	//Иначе
	//	Отказ = Истина;
	//	Если СписокТиповДокументов.Количество() = 1 Тогда
	//		РеквизитыВида = БюджетныйНаСервере.ВернутьРеквизиты(СписокТиповДокументов[0].Значение, "ИмяДокумента");
	//		ТекФорма = ПолучитьФорму("Документ." + РеквизитыВида.ИмяДокумента + ".ФормаОбъекта", Новый Структура("ВидСЗ", СписокТиповДокументов[0].Значение));
	//		//Если ТекФорма.Объект.Свойство("ВидСЗ") Тогда
	//		//	ТекФорма.Объект.ВидСЗ = СтруктураТиповДокументов[0].Ссылка;
	//		//КонецЕсли;
	//		ТекФорма.Открыть();
	//	КонецЕсли;
	//	//ОткрытьЗначение(Элементы.Создать);
	//	
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ДанныеФормы, Основание)
	Для каждого ТекРеквизит Из Основание.Метаданные().Реквизиты Цикл
		Попытка
			ДанныеФормы[ТекРеквизит.Имя] = Основание[ТекРеквизит.Имя];
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Для каждого ТекРеквизит Из Основание.Метаданные().СтандартныеРеквизиты Цикл
		Попытка
			ДанныеФормы[ТекРеквизит.Имя] = Основание[ТекРеквизит.Имя];
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Для каждого ТекТЧ Из Основание.Метаданные().ТабличныеЧасти Цикл
		Для каждого ТекСтрока Из Основание[ТекТЧ.Имя] Цикл
			НоваяСтрока = ДанныеФормы[ТекТЧ.Имя].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);	
		КонецЦикла;
	КонецЦикла;
	ДанныеФормы.Дата = ТекущаяДата();

КонецПроцедуры


///////////////////////////работа с кнопкой СОЗДАТЬ//////////////////////////////////
&НаСервере
Процедура ЗаполнитьВидыОпераций(Родитель = Неопределено)
	
	СтруктураДоков = СписокВидовСЗ(Родитель, СписокТиповДокументов.ВыгрузитьЗначения());
	
	//заполняем фильтр
	Для каждого ТекСтрока Из СтруктураДоков Цикл
		Если СписокТиповДокументов.НайтиПоЗначению(ТекСтрока.Ссылка) = Неопределено Тогда
			СписокТиповДокументов.Добавить(ТекСтрока.Ссылка, ТекСтрока.Наименование);	
		КонецЕсли;
	КонецЦикла;//конец заполнения фильтра 
	
	ОдинДокумент = СписокТиповДокументов.Количество() = 1;
	
	Элементы.ФормаСоздать.Видимость = ОдинДокумент;
	
	Если ОдинДокумент Тогда
		Возврат;	
	КонецЕсли;
	
	ИндексКоманды = 0;
	Для Каждого ВидОперации Из СтруктураДоков Цикл
		Если ВидОперации.ЭтоРодитель Тогда
			НоваяКнопка = Элементы.Найти("Команда" + ВидОперации.Код);
			Если НоваяКнопка = Неопределено Тогда
				НоваяКнопка = Элементы.Добавить("Команда" + ВидОперации.Код, Тип("ГруппаФормы"), ?(Родитель = Неопределено, Элементы.Создать, Элементы["Команда" + ВидОперации.РодительКод]));
			Иначе	
				НоваяКнопка.Видимость = Истина;	
			КонецЕсли;
			НоваяКнопка.Заголовок = ВидОперации.Наименование;
			ЗаполнитьВидыОпераций(ВидОперации.Ссылка);
		Иначе
			НоваяКоманда = Команды.Найти("Команда" + ВидОперации.Код);
			Если НоваяКоманда = Неопределено Тогда
				НоваяКоманда = Команды.Добавить("Команда" + ВидОперации.Код);
			КонецЕсли;
			НоваяКоманда.Действие  = "ВыборВидаОперации";
			НоваяКнопка = Элементы.Найти("Команда" + ВидОперации.Код);
			Если НоваяКнопка = Неопределено Тогда
				НоваяКнопка = Элементы.Добавить("Команда" + ВидОперации.Код, Тип("КнопкаФормы"),?(Родитель = Неопределено, Элементы.Создать, Элементы["Команда" + ВидОперации.РодительКод]));
			Иначе	
				НоваяКнопка.Видимость = Истина;	
			КонецЕсли;
			НоваяКнопка.Заголовок = ВидОперации.Наименование;
			НоваяКнопка.ИмяКоманды = "Команда" + ВидОперации.Код;
		КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаОперации(Команда)
	
	СтруктураТиповДокументов = ПодобратьТипДокумента(Прав(Команда.Имя, СтрДлина(Команда.Имя) - 7));
	Если СтруктураТиповДокументов.Количество() Тогда
		Если ЗначениеЗаполнено(СтруктураТиповДокументов[0].РодительИмяДокумента) Тогда
			ТекФорма = ПолучитьФорму("Документ." + СтруктураТиповДокументов[0].РодительИмяДокумента + ".ФормаОбъекта", Новый Структура("ВидСЗ", СтруктураТиповДокументов[0].Ссылка));
		    ТекФорма.Объект.ВидСЗ = СтруктураТиповДокументов[0].Ссылка;
			ТекФорма.Открыть();
		Иначе
			ТекФорма = ПолучитьФорму("Документ." + СтруктураТиповДокументов[0].ИмяДокумента + ".ФормаОбъекта", Новый Структура("ВидСЗ", СтруктураТиповДокументов[0].Ссылка));
			//Если ТекФорма.Объект.Свойство("ВидСЗ") Тогда
			//	ТекФорма.Объект.ВидСЗ = СтруктураТиповДокументов[0].Ссылка;
			//КонецЕсли;
			ТекФорма.Открыть();
		КонецЕсли;
	Иначе
		Предупреждение("Документ не найден!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодобратьТипДокумента(КодЭлемента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Д_ВидыВнутреннихДокументов.Ссылка,
	|	Д_ВидыВнутреннихДокументов.ИмяДокумента,
	|	Д_ВидыВнутреннихДокументов.Родитель.ИмяДокумента
	|ИЗ
	|	Справочник.Д_ВидыВнутреннихДокументов КАК Д_ВидыВнутреннихДокументов
	|ГДЕ
	|	Д_ВидыВнутреннихДокументов.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодЭлемента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Стр = Новый Структура;
		Стр.Вставить("Ссылка", Выборка.Ссылка);
		Стр.Вставить("ИмяДокумента", Выборка.ИмяДокумента);
		Стр.Вставить("РодительИмяДокумента", Выборка.РодительИмяДокумента);
		МассивДанных.Добавить(Стр);
		
	КонецЦикла;
	Возврат МассивДанных;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокВидовСЗ(Родитель, Фильтр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Д_ВидыВнутреннихДокументов.Ссылка КАК Ссылка,
	               |	Д_ВидыВнутреннихДокументов.Наименование,
	               |	Д_ВидыВнутреннихДокументов.Код,
	               |	ВЫБОР
	               |		КОГДА Д_ВидыВнутреннихДокументов.Ссылка В
	               |				(ВЫБРАТЬ
	               |					Д_ВидыВнутреннихДокументов.Родитель
	               |				ИЗ
	               |					Справочник.Д_ВидыВнутреннихДокументов КАК Д_ВидыВнутреннихДокументов)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоРодитель,
	               |	Д_ВидыВнутреннихДокументов.Родитель.Код,
	               |	Д_ВидыВнутреннихДокументов.ИмяДокумента
	               |ИЗ
	               |	Справочник.Д_ВидыВнутреннихДокументов КАК Д_ВидыВнутреннихДокументов
	               |ГДЕ
	               |	Д_ВидыВнутреннихДокументов.Родитель = &Родитель
	               |	И ВЫБОР
	               |			КОГДА ""Все документы"" В (&Фильтр)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Д_ВидыВнутреннихДокументов.Ссылка В ИЕРАРХИИ (&Фильтр)
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Родитель", ?(Родитель = Неопределено, Справочники.Д_ВидыВнутреннихДокументов.ПустаяСсылка(), Родитель));
	Запрос.УстановитьПараметр("Фильтр", Фильтр);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСтруктуры = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Попытка
			Если НЕ ПравоДоступа("Добавление", Метаданные.Документы[Выборка.ИмяДокумента]) Тогда
				Продолжить;	
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
		СтруктураДоков = Новый Структура;
		СтруктураДоков.Вставить("Ссылка", Выборка.Ссылка);
		СтруктураДоков.Вставить("Наименование", Выборка.Наименование);
		СтруктураДоков.Вставить("Код", Выборка.Код);
		СтруктураДоков.Вставить("ЭтоРодитель", Выборка.ЭтоРодитель);
		СтруктураДоков.Вставить("РодительКод", Выборка.РодительКод);
		МассивСтруктуры.Добавить(СтруктураДоков);
	КонецЦикла;
	Возврат МассивСтруктуры;
	
КонецФункции // ()

///////////////////////////конец работы с кнопкой СОЗДАТЬ///////////////////////////

&НаКлиенте
Процедура МаршрутДеревоПриАктивизацииСтроки(Элемент)
	Если НЕ Элементы.МаршрутДерево.ТекущиеДанные = Неопределено Тогда
		Пользователь = Элементы.МаршрутДерево.ТекущиеДанные.СубъектСогласования;
	Иначе
		Пользователь = Неопределено;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Если НЕ Элементы.Список.ТекущиеДанные = Неопределено Тогда
		БюджетныйНаКлиенте.УниверсальнаяПечать(Элементы.Список.ВыделенныеСтроки, Истина);	
	КонецЕсли;
КонецПроцедуры


///////////////////////////работа с фильтром2//////////////////////////////////
&НаКлиенте
Процедура Фильтр2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ЖурналДокументов.ВнутренниеДокументы.Форма.ФормаФильтраДокументов", Новый Структура("Фильтр2, СписокТиповДокументов", Фильтр2, СписокТиповДокументов));
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПередатьФильтр2" Тогда
		Фильтр2.ЗагрузитьЗначения(Параметр.Фильтр2);
		УстановитьОтборПоТипам(Параметр);
	ИначеЕсли ИмяСобытия = "ОбновитьСписокЗадач" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоТипам(Фильтр)
	ФильтрИмена = Фильтр.ФильтрИмена;
	Список.Отбор.Элементы.Очистить();
	Если Фильтр2.НайтиПоЗначению("Все документы") = Неопределено Тогда
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений2 = Новый СписокЗначений;
		Для каждого ТекСтрока Из ФильтрИмена Цикл
			СписокЗначений.Добавить(Тип("ДокументСсылка." + ТекСтрока));
		КонецЦикла;
		Для каждого ТекСтрока Из Фильтр.Фильтр2 Цикл
			СписокЗначений2.Добавить(ТекСтрока);
		КонецЦикла; 
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Тип");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		НовыйОтбор.ПравоеЗначение = СписокЗначений;
		
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДокумента");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		НовыйОтбор.ПравоеЗначение = СписокЗначений2;
		
	КонецЕсли;
КонецПроцедуры
///////////////////////////конец работы с фильтром2//////////////////////////////////

/////////////работа с расширенным фильтром


&НаКлиенте
Процедура РасширенныйПоиск(Команда)
	
	ПараметрыРасширенногоПоиска = ОткрытьФормуМодально("Документ.Д_ЗаявкаНаОплату.Форма.ФормаРасширенногоПоиска", Новый Структура("Включен", Элементы.ФормаРасширенныйПоиск.Пометка));
	
	Если НЕ ПараметрыРасширенногоПоиска = Неопределено Тогда
		
		Если Не ПараметрыРасширенногоПоиска.ОтменаПоиска Тогда
			УстановитьПараметрыРасширенногоПоиска(ПараметрыРасширенногоПоиска);
			Элементы.ФормаРасширенныйПоиск.Пометка = Истина;
		Иначе
			УстановитьПараметрыРасширенногоПоиска();
			Элементы.ФормаРасширенныйПоиск.Пометка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКорректировокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ТекЗаявка = Элементы.Список.ТекущаяСтрока;
	Если НЕ ТекЗаявка = Неопределено Тогда
		ТекФорма = ПолучитьФорму("Документ.Д_КорректировкаДокумента.ФормаОбъекта");
		ТекФорма.Объект.ДокОснование = ТекЗаявка;
		ТекФорма.Открыть();
	
	КонецЕсли;
КонецПроцедуры


////////////конец работы с расширенным фильтром

&НаСервере
Процедура ЗаполнитьПечать(ТекЗаявка)
	
	Если ТипЗнч(ТекЗаявка) = Тип("Структура") ИЛИ ТипЗнч(ТекЗаявка) = Тип("ФиксированнаяСтруктура") ИЛИ ТипЗнч(ТекЗаявка) = Тип("ДанныеФормыСтруктура") Тогда
		Если ТипЗнч(ТекЗаявка.ВидВнутреннегоДокумента) = Тип("Строка") Тогда
			Если НЕ Элементы.Найти("КомандаПечати") = Неопределено Тогда
				Элементы.Удалить(Элементы["КомандаПечати"]);
			КонецЕсли;
			Возврат;
		Иначе	
			ТекДокумент = Документы[ТекЗаявка.ВидВнутреннегоДокумента.ИмяДокумента].ПустаяСсылка();
		КонецЕсли;
	Иначе
		ТекДокумент = ТекЗаявка;
	КонецЕсли;
	
	СписокКоманд.Очистить();
	//Метаданные.Документы.Д_ЗаявкаНаОплату.Команды.ПечатьБезНал.ИзменяетДанные
	
	Если НЕ Элементы.Найти("КомандаПечати") = Неопределено Тогда
		Элементы.Удалить(Элементы["КомандаПечати"]);
	КонецЕсли;
	
	МассивКоманд = Новый Массив;
	
	//Если Не ЗначениеЗаполнено(ТекЗаявка) Тогда
	//	Возврат; //прерываем заполнение
	//КонецЕсли;
	СписокКоманды = ТекДокумент.Метаданные().Команды;
	Для каждого ТекКоманда Из СписокКоманды Цикл
		Если Найти(Строка(ТекКоманда.Группа), "Печать") И ПравоДоступа("Просмотр", ТекКоманда) Тогда
			МассивКоманд.Добавить(ТекКоманда);		
		КонецЕсли;
	КонецЦикла;
	
	СписокКоманды = Метаданные.Документы.Д_ЗаявкаНаОплату.Команды;
	Для каждого ТекКоманда Из СписокКоманды Цикл
		Если ТекКоманда.ТипПараметраКоманды.СодержитТип(ТипЗнч(ТекДокумент)) И Найти(Строка(ТекКоманда.Группа), "Печать") И ПравоДоступа("Просмотр", ТекКоманда) Тогда
			МассивКоманд.Добавить(ТекКоманда);		
		КонецЕсли;
	КонецЦикла;
	
	СписокКоманды = Метаданные.Документы.Д_СлужебнаяЗаписка.Команды;
	Для каждого ТекКоманда Из СписокКоманды Цикл
		Если ТекКоманда.ТипПараметраКоманды.СодержитТип(ТипЗнч(ТекДокумент)) И Найти(Строка(ТекКоманда.Группа), "Печать") И ПравоДоступа("Просмотр", ТекКоманда) Тогда
			МассивКоманд.Добавить(ТекКоманда);		
		КонецЕсли;
	КонецЦикла;
	
	ВремСп = Новый СписокЗначений;
	ВремСп.ЗагрузитьЗначения(МассивКоманд);
	ВремСп.СортироватьПоЗначению();
	МассивКоманд = ВремСп.ВыгрузитьЗначения();	

	
	НоваяКнопка = Элементы.Добавить("КомандаПечати", Тип("ГруппаФормы"), Элементы.Печать);
	НоваяКнопка.Заголовок = "Команды документа";
	
	
	Индекс = 0;
	Для каждого ТекСтрока Из МассивКоманд Цикл
		Если Команды.Найти(ТекСтрока.Имя + Строка(Индекс)) = Неопределено Тогда
			НоваяКоманда = Команды.Добавить(ТекСтрока.Имя + Строка(Индекс));
			НоваяКоманда.Действие  = "ИндивидуальнаяКоманда";
		КонецЕсли;
		НоваяКнопка = Элементы.Добавить(ТекСтрока.Имя + Строка(Индекс), Тип("КнопкаФормы"),Элементы["КомандаПечати"]);
		НоваяКнопка.Заголовок = ?(ЗначениеЗаполнено(ТекСтрока.Синоним), ТекСтрока.Синоним, ТекСтрока.Имя);
		НоваяКнопка.ИмяКоманды = ТекСтрока.Имя + Строка(Индекс);
		СписокКоманд.Добавить(ТекСтрока.ПолноеИмя());
		Индекс = Индекс + 1;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальнаяКоманда(Команда)
	ТекЗаявка = Элементы.Список.ВыделенныеСтроки;
	Если НЕ ТекЗаявка = Неопределено Тогда
		БюджетныйНаКлиенте.УниверсальноеВыполнениеКоманды(ТекЗаявка, СписокКоманд[Число(Прав(Команда.Имя, 1))].Значение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокКорректировокДДУПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(ТекСтрока) = Тип("ДокументСсылка.УЧ_Стр_ДоговорДолевогоУчастия") Тогда
		Если Параметр = Тип("ДокументСсылка.Стр_ДДУГрафик") Тогда
			ОткрытьФорму("Документ.Стр_ДДУГрафик.ФормаОбъекта", Новый Структура("Основание", ТекСтрока));
		КонецЕсли;
		Если Параметр = Тип("ДокументСсылка.Стр_ДДУКорректировка") Тогда
			ОткрытьФорму("Документ.Стр_ДДУКорректировка.ФормаОбъекта", Новый Структура("Основание", ТекСтрока));
		КонецЕсли;
		Если Параметр = Тип("ДокументСсылка.Стр_ДДУПереуступка") Тогда
			ОткрытьФорму("Документ.Стр_ДДУПереуступка.ФормаОбъекта", Новый Структура("Основание", ТекСтрока));
		КонецЕсли;
		Если Параметр = Тип("ДокументСсылка.Стр_ДДУРасторжение") Тогда
			ОткрытьФорму("Документ.Стр_ДДУРасторжение.ФормаОбъекта", Новый Структура("Основание", ТекСтрока));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьПараметрыРасширенногоПоиска(ПараметрыРасширенногоПоиска = Неопределено)
	
	Если ТипЗнч(ПараметрыРасширенногоПоиска) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыРасширенногоПоиска.ОтменаПоиска) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Источник", ?(ЗначениеЗаполнено(ПараметрыРасширенногоПоиска.Источник), ПараметрыРасширенногоПоиска.Источник, Null));
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", ?(ЗначениеЗаполнено(ПараметрыРасширенногоПоиска.Контрагент), ПараметрыРасширенногоПоиска.Контрагент, Null));
		Список.Параметры.УстановитьЗначениеПараметра("Основание", ?(ЗначениеЗаполнено(ПараметрыРасширенногоПоиска.Основание), "%" + ПараметрыРасширенногоПоиска.Основание + "%", Null) );
		Список.Параметры.УстановитьЗначениеПараметра("Примечание", ?(ЗначениеЗаполнено(ПараметрыРасширенногоПоиска.Примечание),"%" +  ПараметрыРасширенногоПоиска.Примечание + "%", Null));
		Список.Параметры.УстановитьЗначениеПараметра("ЦФО", ?(ЗначениеЗаполнено(ПараметрыРасширенногоПоиска.ЦФО), ПараметрыРасширенногоПоиска.ЦФО, Null));
		Список.Параметры.УстановитьЗначениеПараметра("РасширенныйПоискПоЗаявкамНаОплату", Истина);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Источник", Null);
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Null);
		Список.Параметры.УстановитьЗначениеПараметра("Основание", Null);
		Список.Параметры.УстановитьЗначениеПараметра("Примечание", Null);
		Список.Параметры.УстановитьЗначениеПараметра("ЦФО", Null);
		Список.Параметры.УстановитьЗначениеПараметра("РасширенныйПоискПоЗаявкамНаОплату", Ложь);
		Элементы.ФормаРасширенныйПоиск.Пометка = Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СтруктураДокументовПриАктивизацииСтроки(Элемент)
	Если Не ЗначениеЗаполнено(ТекЗначениеСтруктуры) Тогда
		ТекЗначениеСтруктуры = Элементы.СтруктураДокументов.ТекущиеДанные.Значение;
		Возврат;	
	КонецЕсли;
	
	Если НЕ ТекЗначениеСтруктуры = Элементы.СтруктураДокументов.ТекущиеДанные.Значение Тогда
		СписокТиповДокументов.Очистить();
		ТекЗначениеСтруктуры = Элементы.СтруктураДокументов.ТекущиеДанные.Значение;	
		Фильтр2.Очистить();
		Если Элементы.СтруктураДокументов.ТекущиеДанные.Значение = "Все документы" Тогда
			СтруктураПараметров11 = Новый Структура("ВидВнутреннегоДокумента", "Все документы");
		Иначе
			СтруктураПараметров11 = Новый Структура("ВидВнутреннегоДокумента", Элементы.СтруктураДокументов.ТекущиеДанные.Ссылка); 
		КонецЕсли;
		ЗполнитьФильтрПоТипуДокумента(СтруктураПараметров11);
		ЗаполнитьПечать(СтруктураПараметров11);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоследнимиЗаявками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Д_ЗаявкаНаФинансирование.Ссылка) КАК Количество,
	               |	Д_ЗаявкаНаФинансирование.Контрагент КАК Контрагент,
	               |	МАКСИМУМ(Д_ЗаявкаНаФинансирование.Ссылка) КАК Ссылка
	               |ПОМЕСТИТЬ Врем
	               |ИЗ
	               |	Документ.Д_ЗаявкаНаФинансирование КАК Д_ЗаявкаНаФинансирование
	               |ГДЕ
	               |	Д_ЗаявкаНаФинансирование.Предприятие В(&ДоступныеПредприятия)
	               |	И Д_ЗаявкаНаФинансирование.Дата >= &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Д_ЗаявкаНаФинансирование.Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 15
	               |	Врем.Ссылка КАК Ссылка,
	               |	Врем.Контрагент КАК Контрагент,
	               |	Врем.Количество КАК Количество,
	               |	Врем.Ссылка.Предприятие КАК Предприятие
	               |ИЗ
	               |	Врем КАК Врем
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Количество УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия);
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ИндексЗаявки = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			Продолжить;		
		КонецЕсли;
		
		Элементы.СоздатьПоПоследним.Видимость = Истина;
		
		НомерЗаявки = ИндексЗаявки;
		
		НоваяКоманда = Команды.Найти("Команда" + НомерЗаявки);
		Если НоваяКоманда = Неопределено Тогда
			НоваяКоманда = Команды.Добавить("Команда" + НомерЗаявки);
		КонецЕсли;
		НоваяКоманда.Действие  = "ВыборПоследнего";
		НоваяКнопка = Элементы.Найти("Команда" + НомерЗаявки);
		Если НоваяКнопка = Неопределено Тогда
			НоваяКнопка = Элементы.Добавить("Команда" + НомерЗаявки, Тип("КнопкаФормы"),Элементы.СоздатьПоПоследним);
		Иначе	
			НоваяКнопка.Видимость = Истина;	
		КонецЕсли;
		НоваяКнопка.Заголовок = Строка(Выборка.Предприятие) + " >> " + Выборка.Контрагент;
		НоваяКнопка.ИмяКоманды = "Команда" + НомерЗаявки;
		
		СписокЗначенийМенюПоследних.Добавить(Выборка.Ссылка);
		
		ИндексЗаявки = ИндексЗаявки + 1;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыборПоследнего(Команда)
	
	Ссылка = Число(Прав(Команда.Имя, СтрДлина(Команда.Имя) - 7));
	
	ТекФорма = ПолучитьФорму("Документ.Д_ЗаявкаНаФинансирование.ФормаОбъекта", Новый Структура("ЗначениеКопирования", СписокЗначенийМенюПоследних[Ссылка].Значение));
	ДанныеФормы = ТекФорма.Объект;
	//ЗаполнитьНаСервере2(ДанныеФормы, СписокЗначенийМенюПоследних[Ссылка].Значение);
	//КопироватьДанныеФормы(ДанныеФормы, ТекФорма.Объект);
	ТекФорма.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере2(ТекОбъект, ТекОснование)

	ЗаполнитьЗначенияСвойств(ТекОбъект, ТекОснование,,"Дата, Номер");	
	
КонецПроцедуры


 