
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДатаНачала = Сценарий.АктуальнаяДата;
	
	//пишем в регистр сведений	
	// регистр Д_ПараметрыНоменклатуры
	Движения.Д_ПараметрыНоменклатуры.Записывать = Истина;
	
	Для Каждого ТекСтрокаПараметрыПроизводства Из ПараметрыПроизводства Цикл
		ТекДата = ДобавитьМесяц(ДатаНачала, Месяц(ТекСтрокаПараметрыПроизводства.Месяц) - Месяц(ДатаНачала));
		
		Движение = Движения.Д_ПараметрыНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаПараметрыПроизводства);
		Движение.СебестоимостьПолнаяБезНалогов = ТекСтрокаПараметрыПроизводства.СебестоимостьНалоги + ТекСтрокаПараметрыПроизводства.СебестоимостьМагистраль
		+ ТекСтрокаПараметрыПроизводства.Себестоимость91 + ТекСтрокаПараметрыПроизводства.СебестоимостьПрочие + ТекСтрокаПараметрыПроизводства.СебестоимостьПроизводства 
		+ ТекСтрокаПараметрыПроизводства.СебестоимостьКоммерческиеРасходы;
		Движение.СценарийПлана = Сценарий;
		Движение.Период = ТекДата;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры
