
&НаКлиенте
Процедура Принять(Команда)
	
	Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
		ПринятьСервер(Истина);
		ОчиститьПредприятия();
		ЗаписатьНаСервере(Комментарий);
		//СписокПредприятий = БюджетныйНаСервере.ПолучитьПредприятия();
		//
		//УстановитьДоступныеПП(СписокПредприятий);
		
		Если ДатаНачала <= ТекущаяДата() Тогда
			БюджетныйНаСервере.УстановитьПользователя(Замещающий,, Истина);
		КонецЕсли;
		
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.Задача"));
		Оповестить("ОбновитьСписокЗадач");
		Закрыть();
	КонецЕсли;
	
	Замещ = БюджетныйНаСервере.ВернутьРеквизит(Ссылка, "Замещающий");
	Отпускн = БюджетныйНаСервере.ВернутьРеквизит(Ссылка, "Пользователь"); 
	
	ТекстСообщения = "Замещающий " + Замещ + " принял обязанности пользователя " + Отпускн;
	БПСервер.СоздатьОповещение(БюджетныйНаСервере.ВернутьРеквизит(Ссылка, "Пользователь"), ТекстСообщения, "Принятие обязанностей замещающим"); 
	
	УстановитьДоступностьФайловТекущихЗадач(Отпускн);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДоступностьФайловТекущихЗадач(Отпускник)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Задача.Заявка КАК Заявка,
	|	Задача.БизнесПроцесс КАК БизнесПроцесс
	|ИЗ
	|	Задача.Задача КАК Задача
	|ГДЕ
	|	Задача.Выполнена = ЛОЖЬ
	|	И Задача.Исполнитель = &Исполнитель
	|	И Задача.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	Задача.Заявка,
	|	Задача.БизнесПроцесс";
	
	Запрос.УстановитьПараметр("Исполнитель", Отпускник);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.БизнесПроцесс) Тогда
			БПСервер.БППриЗаписиПриЗаписи(Выборка.БизнесПроцесс.ПолучитьОбъект(), Ложь);		
		КонецЕсли;		
	КонецЦикла;	
	

КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьДоступныеПП(СписокПредприятий)
	ПараметрыСеанса.ДоступныеПользователи = Новый ФиксированныйМассив(СписокПредприятий);
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОчиститьПредприятия()
	ПараметрыСеанса.ДоступныеПредприятия = Новый ФиксированныйМассив(Новый Массив);
КонецПроцедуры


&НаСервере
Процедура ПринятьСервер(РезультатЗамещения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Задача.Ссылка
	|ИЗ
	|	Задача.Задача КАК Задача
	|ГДЕ
	|	Задача.Заявка = &Заявка
	|	И Задача.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	Запрос.УстановитьПараметр("Исполнитель", Замещающий);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		БПСервер.ВыполнитьЗадачу(Выборка.Ссылка,0, ?(РезультатЗамещения, "Да", "Нет"), Комментарий);	
		
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда, Комментарий)
	Если Не БПСервер.ПроверкаЗадачи(Объект.Ссылка) Тогда
		
		ПринятьСервер(Ложь);
		СоздатьЗадачуОтмены();
		
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.Задача"));
		Оповестить("ОбновитьСписокЗадач");
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачуОтмены()
	Задача = Задачи.Задача.СоздатьЗадачу();		
	Задача.Заявка = Ссылка;
	Задача.Дата = ТекущаяДата();
	Задача.Наименование = "Отпуск отклонен пользователем " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + ". Причина: " + Комментарий;
	Задача.Автор = БюджетныйНаСервере.ПолучитьПользователя();
	Задача.Описание = Примечания;
	Задача.Комментарии = Комментарий;
	Задача.Исполнитель = Пользователь;
	Задача.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(Комментарий)
	
	ЭтаЗадачаОбъект = Ссылка.ПолучитьОбъект();
	ЭтаЗадачаОбъект.ЗамещающийСогласовал = Истина;
	ЭтаЗадачаОбъект.КомментарийЗамещающего = Комментарий;
	ЭтаЗадачаОбъект.Записать();
	
	БПСервер.ЗаписатьТекущийСтатус(Перечисления.БП_ТекущийСтатус.ВОтпуске, Пользователь, , ТекущаяДата());
	БПСервер.ЗаписатьТекущийСтатус(Перечисления.БП_ТекущийСтатус.НаРаботе, Пользователь, , ДатаОкончания);

КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураДанных = БюджетныйНаСервере.ВернутьРеквизиты(Объект.Заявка, "Пользователь, Замещающий, ДатаНачала, ДатаОкончания, Примечания");
	
	Пользователь = СтруктураДанных.Пользователь;
	Замещающий = СтруктураДанных.Замещающий;
	ДатаНачала = СтруктураДанных.ДатаНачала;
	ДатаОкончания = СтруктураДанных.ДатаОкончания;
	Примечания = СтруктураДанных.Примечания;
	Ссылка = Объект.Заявка;

КонецПроцедуры
