
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.СчетНачисления = ПланыСчетов.Учетный.Счет70();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНачисленияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура("ВидСубнонто, ЗапретитьИспользоватьВПроводках", "Сотрудники", Ложь);
			
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораПланаСчетов", ЭтаФорма, "Подбор");
	ОткрытьФорму("ПланСчетов.Учетный.Форма.ФормаВыбора1",ПараметрыОтбора, ЭтаФорма, , , , ОбработкаВыбора); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораПланаСчетов(Значение, ДопПараметры) Экспорт
    
    Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Объект.СчетНачисления = Значение; 
	
КонецПроцедуры
