
// ПРОЦЕДУРА "ПриИзменении" НА КЛИЕНТЕ.
// ВЫЗОВ ЭТОЙ ПРОЦЕДУРЫ ДОЛЖЕН ОСУЩЕСТВЛЯТЬСЯ ИЗ ФОРМ ДОКУМЕНТОВ.
//
// СтруктураДействий - Структура. Возможно передавать следующие поля:
//  "ПроверитьХарактеристикуПоВладельцу", Характеристика.
//  "ПроверитьЗаполнитьУпаковкуПоВладельцу"      , Упаковка.
//  "ПересчитатьКоличествоЕдиниц".
//  "ПересчитатьКоличествоЕдиницПлан".
//  "ПересчитатьКоличествоЕдиницФакт", ИмяФакта
//  "ОчиститьКоличествоУчет"
//  "ОбнулитьЦену" - ИмяРеквизитаЦены
//  "ЗаполнитьОбъемВесУпаковки"	        , Упаковка.
//  "ЗаполнитьЦенуПродажи"              , СтруктураПараметровДействия.
//  "ПересчитатьСумму". ИмяКоличества
//  "ПересчитатьСуммуСУчетомРучнойСкидки"     , СтруктураПараметровДействия.
//  "ПересчитатьСуммуСУчетомАвтоматическойСкидки"     , СтруктураПараметровДействия.
//  "ПересчитатьЦенуЗаУпаковку"         , КоличествоЕдиницДоПересчета.
//  "ПересчитатьСуммуНДС".
//  "ЗаполнитьСтавкуНДС".
//  "ПересчитатьКоличествоУпаковок". Имя
//  "ПересчитатьКоличествоУпаковокФакт". ИмяФакта
//  "ОбработатьШтрихкоды".
//  "ПроверитьСерийныеНомераПоВладельцу", СтруктураПараметровДействия.
//  "ЗаполнитьЦенуПродажиРозница" , СтруктураПараметровДействия.
//  "ПересчитатьСуммуРучнойСкидки".
//  "ПересчитатьПроцентРучнойСкидки".
//  "ПересчитатьСуммуФактВСтрокеТЧКлиент", ИмяКоличества
//  "ПересчитатьЦенуПоСуммеФактВСтрокеТЧКлиент".
Процедура ПриИзмененииРеквизитовВТЧКлиент(ТЧ, ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Перем ЗначениеИзСтруктуры;

	Если КэшированныеЗначения = Неопределено Тогда
		КэшированныеЗначения = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	КонецЕсли;

	ПараметрыОбработкиТЧ = ПолучитьПараметрыОбработкиТЧ(ТЧ,
		ТекущаяСтрока,
		СтруктураДействий,
		КэшированныеЗначения
	);

	Если ПараметрыОбработкиТЧ.НеобходимВызовСервера Тогда
		СтруктураТЧ = Новый Структура;
		СтруктураТЧ.Вставить("СтруктураПолейТЧ", ПолучитьСтруктуруПолейТЧ(ПараметрыОбработкиТЧ.СтруктураДействий));

		Если ПараметрыОбработкиТЧ.НеобходимоОбработатьВсюТЧ Тогда
			СтрокиТЧ = Новый Массив;
			Для Каждого ТекущаяСтрокаТЧ Из ТЧ Цикл
				ТекущаяСтрока = ПолучитьДанныеТекущейСтроки(ТекущаяСтрокаТЧ, СтруктураТЧ.СтруктураПолейТЧ);
				ТекущаяСтрока.Вставить("_ИдентификаторСтроки_", ТекущаяСтрокаТЧ.ПолучитьИдентификатор());

				СтрокиТЧ.Добавить(ТекущаяСтрока);
			КонецЦикла;

			СтруктураТЧ.Вставить("СтрокиТЧ" , СтрокиТЧ);

			ОбработкаТабличнойЧастиТоварыВызовСервера.ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий, КэшированныеЗначения);

			Для Каждого ТекСтрока Из СтруктураТЧ.СтрокиТЧ Цикл
				Если ТекСтрока.Свойство("_ИдентификаторСтроки_", ЗначениеИзСтруктуры) Тогда
					ТекСтрокаТЧ = ТЧ.НайтиПоИдентификатору(ЗначениеИзСтруктуры);
				Иначе
					ТекСтрокаТЧ = ТЧ.Добавить();
				КонецЕсли;

				ЗаполнитьЗначенияСвойств(ТекСтрокаТЧ, ТекСтрока);
			КонецЦикла;
		Иначе
			СтруктураТЧ.Вставить("ТекущаяСтрока" , ПолучитьДанныеТекущейСтроки(ТекущаяСтрока, СтруктураТЧ.СтруктураПолейТЧ));

			ОбработкаТабличнойЧастиТоварыВызовСервера.ПриИзмененииРеквизитовВТЧСервер(СтруктураТЧ, СтруктураДействий, КэшированныеЗначения);
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураТЧ.ТекущаяСтрока);
		КонецЕсли;
	Иначе // Все можно обработать на клиенте.
		СоответствиеДействий = Новый Соответствие;

		ОбработатьШтрихкодыКлиент(ТЧ, СтруктураДействий, КэшированныеЗначения, СоответствиеДействий);
		ПересчитатьСуммыНДСКлиент(ТЧ, СтруктураДействий, КэшированныеЗначения, СоответствиеДействий);
		ОчиститьКоличествоУчетКлиент(ТЧ, СтруктураДействий, КэшированныеЗначения, СоответствиеДействий);
		
		Если ПараметрыОбработкиТЧ.НеобходимоОбработатьВсюТЧ Тогда
			Для Каждого ТекущаяСтрока Из ТЧ Цикл
				
				ТекСтруктураДействий = СоответствиеДействий[ТекущаяСтрока];
				
				Если ТекСтруктураДействий <> Неопределено Тогда
					ОбработатьСтрокуТЧКлиент(ТекущаяСтрока, ТекСтруктураДействий, КэшированныеЗначения);
				КонецЕсли;
			КонецЦикла;
		Иначе
			ОбработатьСтрокуТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура обработки строки
//
Процедура ОбработатьСтрокуТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	ПроверитьСерийныеНомераПоВладельцуКлиент(ТекущаяСтрока                   , СтруктураДействий, КэшированныеЗначения);
	ПроверитьНезаполненностьСтрокиПоступленияТоваровЕГАИС(ТекущаяСтрока      , СтруктураДействий, КэшированныеЗначения);
	ПроверитьНеобходимостьВводаАкцизнойМарки(ТекущаяСтрока                   , СтруктураДействий, КэшированныеЗначения);
	ПроверитьНеобходимостьВводаСправкиНаАлкоголь(ТекущаяСтрока               , СтруктураДействий, КэшированныеЗначения);
	ОчиститьДанныеПоЗаказуКлиент(ТекущаяСтрока                               , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьДанныеПоДокументуПродажиВСтрокеТЧКлиент(ТекущаяСтрока           , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьТипНоменклатурыВСтрокеТЧКлиент(ТекущаяСтрока                    , СтруктураДействий, КэшированныеЗначения);
	ПроверитьФлагРезервированияВСтрокеТЧКлиент(ТекущаяСтрока                 , СтруктураДействий, КэшированныеЗначения);
	ПроверитьКорректностьЗаполнитьХарактеристикиИУпаковкиКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ПересчитатьКоличествоУпаковокВСтрокеТЧКлиент(ТекущаяСтрока               , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьКоличествоУпаковокФактВСтрокеТЧКлиент(ТекущаяСтрока           , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьКоличествоЕдиницПланВСтрокеТЧКлиент(ТекущаяСтрока             , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьКоличествоЕдиницФактВСтрокеТЧКлиент(ТекущаяСтрока             , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьОчиститьКоличествоУчетВСтрокеТЧКлиент(ТекущаяСтрока           , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(ТекущаяСтрока                 , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьЦенуЗаУпаковкуВСтрокеТЧКлиент(ТекущаяСтрока                   , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьСкладПродажиВСтрокеТЧКлиент(ТекущаяСтрока                       , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьОрганизациюПродажиВСтрокеТЧКлиент(ТекущаяСтрока                 , СтруктураДействий, КэшированныеЗначения);
	ОбнулитьЦенуВСтрокеТЧКлиент(ТекущаяСтрока                                , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьЦенуПродажиРозницаВСтрокеТЧКлиент(ТекущаяСтрока                 , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьЦенуЗакупкиВСтрокеТЧКлиент(ТекущаяСтрока                        , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьЦенуПрошлойЗакупкиВСтрокеТЧКлиент(ТекущаяСтрока                 , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьДействующуюЦенуПродажиВСтрокеТЧКлиент(ТекущаяСтрока             , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьСтавкуНДСВСтрокеТЧКлиент(ТекущаяСтрока                          , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьСтавкуНДСВСтрокеСкладВСтрокеТЧКлиент(ТекущаяСтрока              , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьСтавкуНДСВСтрокеСкладВШапкеТЧКлиент(ТекущаяСтрока               , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьПроцентРучнойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока              , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуРучнойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока                , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуВСтрокеТЧКлиент(ТекущаяСтрока                            , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьЦенуСкидкуПоСуммеВПродажахВСтрокеТЧКлиент(ТекущаяСтрока       , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьЦенуСкидкуПоСуммеВЗакупкахВСтрокеТЧКлиент(ТекущаяСтрока       , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуСУчетомАвтоматическойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуСУчетомРучнойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока         , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуНДСВСтрокеТЧКлиент(ТекущаяСтрока                         , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуНДСПоСуммеСНДСВСтрокеТЧКлиент(ТекущаяСтрока              , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуСНДСВСтрокеТЧКлиент(ТекущаяСтрока                        , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуФактВСтрокеТЧКлиент(ТекущаяСтрока                        , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьЦенуПоСуммеФактВСтрокеТЧКлиент(ТекущаяСтрока                  , СтруктураДействий, КэшированныеЗначения);
	ПроставитьПродавцаВСтрокеТЧКлиент(ТекущаяСтрока                          , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьСуммуПоСуммеСНДСВСтрокеТЧКлиент(ТекущаяСтрока                 , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьЦенуПоСуммеВЗакупкахВСтрокеТЧКлиент(ТекущаяСтрока             , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьПредставлениеТаблоВСтрокеТЧКлиент(ТекущаяСтрока                 , СтруктураДействий, КэшированныеЗначения);
	ПересчитатьРасхожденияВСтрокеТЧКлиент(ТекущаяСтрока                      , СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьКиЗВСтрокеКлиент(ТекущаяСтрока                                  , СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

// ПРОЦЕДУРЫ ПЕРЕСЧЕТА И ЗАПОЛНЕНИЯ КЛИЕНТ.

// Процедура пересчета "ПроверитьСерийныеНомераПоВладельцу"
//
Процедура ПроверитьСерийныеНомераПоВладельцуКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ПроверитьСерийныеНомераПоВладельцу") Тогда
		
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПроверитьХарактеристикуПоВладельцу" и "ПроверитьЗаполнитьУпаковкуПоВладельцу".
//
Процедура ПроверитьКорректностьЗаполнитьХарактеристикиИУпаковкиКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ПроверитьХарактеристикуПоВладельцу") Тогда
		ТекущаяСтрока.Характеристика = Неопределено;
		ТекущаяСтрока.ХарактеристикиИспользуются = Ложь;
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПроверитьЗаполнитьУпаковкуПоВладельцу") Тогда
		ТекущаяСтрока.Упаковка = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьКоличествоЕдиниц"
//
Процедура ПересчитатьКоличествоЕдиницВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиниц") Тогда
		ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоУпаковок
		   * ПолучитьКоэффициентУпаковкиКлиент(ТекущаяСтрока.Упаковка, КэшированныеЗначения);
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьКоличествоЕдиницПлан"
//
Процедура ПересчитатьКоличествоЕдиницПланВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницПлан") Тогда
		ТекущаяСтрока.КоличествоПлан = ТекущаяСтрока.КоличествоУпаковокПлан
		   * ПолучитьКоэффициентУпаковкиКлиент(ТекущаяСтрока.Упаковка, КэшированныеЗначения);
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьКоличествоЕдиницФакт"
//
Процедура ПересчитатьКоличествоЕдиницФактВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	ИмяФакта = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницФакт",ИмяФакта) Тогда
		ТекущаяСтрока["Количество"+ИмяФакта] = ТекущаяСтрока["КоличествоУпаковок"+ИмяФакта]
		   * ПолучитьКоэффициентУпаковкиКлиент(ТекущаяСтрока.Упаковка, КэшированныеЗначения);
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ОчиститьКоличествоУчет"
//
Процедура ПересчитатьОчиститьКоличествоУчетВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ОчиститьКоличествоУчет") Тогда
		
		ТекущаяСтрока.Количество 		 = 0;
		ТекущаяСтрока.КоличествоУпаковок = 0;
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьЦенуЗаУпаковку"
//
Процедура ПересчитатьЦенуЗаУпаковкуВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем КоличествоЕдиницДоПересчета;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуЗаУпаковку", КоличествоЕдиницДоПересчета)
	   И КоличествоЕдиницДоПересчета <> 0 И НЕ КоличествоЕдиницДоПересчета = Неопределено Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Цена
		   / КоличествоЕдиницДоПересчета
		   * ТекущаяСтрока.Количество;
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ЗаполнитьСтавкуНДС"
//
Процедура ЗаполнитьСтавкуНДСВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДС") Тогда
		ТекущаяСтрока.СтавкаНДС = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ЗаполнитьСтавкуНДССкладВСтроке"
//
Процедура ЗаполнитьСтавкуНДСВСтрокеСкладВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВСтроке") Тогда
		ТекущаяСтрока.СтавкаНДС = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ЗаполнитьСтавкуНДССкладВШапке"
//
Процедура ЗаполнитьСтавкуНДСВСтрокеСкладВШапкеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВШапке") Тогда
		ТекущаяСтрока.СтавкаНДС = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСумму"
//
Процедура ПересчитатьСуммуВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	ИмяКоличества = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСумму",ИмяКоличества) Тогда
		Если Не ЗначениеЗаполнено(ИмяКоличества) Тогда
			ИмяКоличества = "КоличествоУпаковок";
		КонецЕсли;
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока[ИмяКоличества];
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ОбнулитьЦену"
//
Процедура ОбнулитьЦенуВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	ИмяРеквизитаЦены = "";
	Если СтруктураДействий.Свойство("ОбнулитьЦену", ИмяРеквизитаЦены) Тогда
		Если Не ЗначениеЗаполнено(ИмяРеквизитаЦены) Тогда
			ИмяРеквизитаЦены = "Цена"
		КонецЕсли;
		ТекущаяСтрока[ИмяРеквизитаЦены] = 0;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуФакт"
//
Процедура ПересчитатьСуммуФактВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	ИмяКоличества = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуФакт",ИмяКоличества) Тогда
		Если Не ЗначениеЗаполнено(ИмяКоличества) Тогда
			ИмяКоличества = "КоличествоУпаковокФакт";
		КонецЕсли;
		ТекущаяСтрока.СуммаФакт = ТекущаяСтрока.Цена * ТекущаяСтрока[ИмяКоличества];
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьПроцентРучнойСкидки"
//
Процедура ПересчитатьПроцентРучнойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьПроцентРучнойСкидки", СтруктураПараметровДействия) Тогда
		
		Если ТекущаяСтрока.КоличествоУпаковок * ТекущаяСтрока.Цена <> 0 Тогда
			ТекущаяСтрока.ПроцентРучнойСкидки = Окр(100*ТекущаяСтрока.СуммаРучнойСкидки / (ТекущаяСтрока.КоличествоУпаковок *ТекущаяСтрока.Цена), 2);
		Иначе
			ТекущаяСтрока.ПроцентРучнойСкидки = 0;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуРучнойСкидки"
//
Процедура ПересчитатьСуммуРучнойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуРучнойСкидки", СтруктураПараметровДействия) Тогда
		
		ТекущаяСтрока.СуммаРучнойСкидки = Окр(ТекущаяСтрока.КоличествоУпаковок *ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентРучнойСкидки / 100, 2);
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуСУчетомРучнойСкидки"
//
Процедура ПересчитатьСуммуСУчетомРучнойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомРучнойСкидки", СтруктураПараметровДействия) Тогда
		
		Очищать = Неопределено;
		ПересчитыватьСуммуСкидки = Неопределено;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			
			СтруктураПараметровДействия.Свойство("Очищать", Очищать);
			СтруктураПараметровДействия.Свойство("ПересчитыватьСуммуСкидки", ПересчитыватьСуммуСкидки);
			
			Если Очищать = Истина Тогда
				
				ТекущаяСтрока.СуммаРучнойСкидки = 0;
				ТекущаяСтрока.ПроцентРучнойСкидки = 0;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ПересчитыватьСуммуСкидки = Ложь Тогда
			ТекущаяСтрока.СуммаРучнойСкидки = Окр(ТекущаяСтрока.КоличествоУпаковок *ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентРучнойСкидки / 100, 2);
		КонецЕсли;
			
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Сумма - ТекущаяСтрока.СуммаРучнойСкидки;
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьЦенуСкидкуПоСуммеВПродажах"
//
Процедура ПересчитатьЦенуСкидкуПоСуммеВПродажахВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПараметровДействия) Тогда
		
		ИспользоватьРучныеСкидки = Ложь;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			Если СтруктураПараметровДействия.Свойство("ИспользоватьРучныеСкидки") Тогда
				ИспользоватьРучныеСкидки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ИспользоватьАвтоматическиеСкидки = Ложь;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			Если СтруктураПараметровДействия.Свойство("ИспользоватьАвтоматическиеСкидки") Тогда
				ИспользоватьАвтоматическиеСкидки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// Если используются ручные скидки - перерасчитаем процент и сумму ручной скидки, иначе перерасчитываем цену.
		Если ИспользоватьРучныеСкидки И КэшированныеЗначения.ИспользоватьРучныеСкидкиВПродажах Тогда
			
			Если ТекущаяСтрока.КоличествоУпаковок = 0 Тогда
				Сумма = ТекущаяСтрока.Цена;
			Иначе
				Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.КоличествоУпаковок;
			КонецЕсли;
			
			Если Сумма = 0 Или ТекущаяСтрока.Сумма = 0 Тогда
				
				ТекущаяСтрока.Цена                = ТекущаяСтрока.Сумма;
				ТекущаяСтрока.СуммаРучнойСкидки   = 0;
				ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			Иначе
				
				ТекущаяСтрока.СуммаРучнойСкидки   = Сумма - ТекущаяСтрока.Сумма;
				ТекущаяСтрока.ПроцентРучнойСкидки = Окр(100*ТекущаяСтрока.СуммаРучнойСкидки / Сумма, 2);
				
			КонецЕсли;
			
		Иначе
			
			Если ТекущаяСтрока.КоличествоУпаковок = 0 Тогда
				ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма;
			Иначе
				ТекущаяСтрока.Цена = Окр(ТекущаяСтрока.Сумма / ТекущаяСтрока.КоличествоУпаковок, 2);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИспользоватьАвтоматическиеСкидки Тогда
			Если КэшированныеЗначения.ИспользоватьАвтоматическиеСкидкиВПродажах Тогда
				ТекущаяСтрока.СуммаАвтоматическойСкидки   = 0;
				ТекущаяСтрока.ПроцентАвтоматическойСкидки = 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ПересчитатьЦенуСкидкуПоСуммеВЗакупках"
//
Процедура ПересчитатьЦенуСкидкуПоСуммеВЗакупкахВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", СтруктураПараметровДействия) Тогда
		
		ИспользоватьРучныеСкидки =Ложь;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			Если СтруктураПараметровДействия.Свойство("ИспользоватьРучныеСкидки") Тогда
				ИспользоватьРучныеСкидки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// Если используются ручные скидки - перерасчитаем процент и сумму ручной скидки, иначе перерасчитываем цену.
		Если ИспользоватьРучныеСкидки И КэшированныеЗначения.ИспользоватьРучныеСкидкиВЗакупках Тогда
			
			Если ТекущаяСтрока.КоличествоУпаковок = 0 Тогда
				Сумма = ТекущаяСтрока.Цена;
			Иначе
				Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.КоличествоУпаковок;
			КонецЕсли;
			
			Если Сумма = 0 Или ТекущаяСтрока.Сумма = 0 Тогда
				
				ТекущаяСтрока.Цена                = ТекущаяСтрока.Сумма;
				ТекущаяСтрока.СуммаРучнойСкидки   = 0;
				ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			Иначе
				
				ТекущаяСтрока.СуммаРучнойСкидки   = Сумма - ТекущаяСтрока.Сумма;
				ТекущаяСтрока.ПроцентРучнойСкидки = Окр(100*ТекущаяСтрока.СуммаРучнойСкидки / Сумма, 2);
				
			КонецЕсли;
			
		Иначе
			
			Если ТекущаяСтрока.КоличествоУпаковок = 0 Тогда
				ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма;
			Иначе
				ТекущаяСтрока.Цена = Окр(ТекущаяСтрока.Сумма / ТекущаяСтрока.КоличествоУпаковок, 2);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ПересчитатьЦенуПоСуммеВЗакупках"
//
Процедура ПересчитатьЦенуПоСуммеВЗакупкахВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуПоСуммеВЗакупках", СтруктураПараметровДействия) Тогда
		
		Если ТекущаяСтрока.КоличествоУпаковок = 0 Тогда
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма;
		Иначе
			ТекущаяСтрока.Цена = Окр(ТекущаяСтрока.Сумма / ТекущаяСтрока.КоличествоУпаковок, 2);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ПересчитатьЦенуПоСуммеФакт"
//
Процедура ПересчитатьЦенуПоСуммеФактВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуПоСуммеФакт", СтруктураПараметровДействия) Тогда
		
		Если ТекущаяСтрока.КоличествоУпаковокФакт = 0 Тогда
			
			ТекущаяСтрока.Цена = ТекущаяСтрока.СуммаФакт;
			
		Иначе
			
			ТекущаяСтрока.Цена = Окр(ТекущаяСтрока.СуммаФакт / ТекущаяСтрока.КоличествоУпаковокФакт, 2);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ПроставитьПродавца"
//
Процедура ПроставитьПродавцаВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	Перем Продавец;

	Если СтруктураДействий.Свойство("ПроставитьПродавца", Продавец) Тогда
		
		ТекущаяСтрока.Продавец = Продавец;
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуСУчетомАвтоматическойСкидки"
//
Процедура ПересчитатьСуммуСУчетомАвтоматическойСкидкиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	СтруктураПараметровДействия = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомАвтоматическойСкидки", СтруктураПараметровДействия) Тогда
		
		Очищать = Неопределено;
		ПересчитыватьСуммуСкидки = Неопределено;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			
			СтруктураПараметровДействия.Свойство("Очищать", Очищать);
			СтруктураПараметровДействия.Свойство("ПересчитыватьСуммуСкидки", ПересчитыватьСуммуСкидки);
			
			Если Очищать = Истина Тогда
				
				ТекущаяСтрока.СуммаАвтоматическойСкидки = 0;
				ТекущаяСтрока.ПроцентАвтоматическойСкидки = 0;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ПересчитыватьСуммуСкидки = Ложь Тогда
			ТекущаяСтрока.СуммаАвтоматическойСкидки = Окр(ТекущаяСтрока.КоличествоУпаковок *ТекущаяСтрока.Цена * ТекущаяСтрока.ПроцентАвтоматическойСкидки / 100, 2);
		КонецЕсли;
		
		Скидка = ТекущаяСтрока.СуммаАвтоматическойСкидки;
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Сумма - Скидка;
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуНДС"
//
Процедура ПересчитатьСуммуНДСВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС", СтруктураПараметровДействия) Тогда
		
		ТекПроцентНДС = ПолучитьПроцентНДСКлиент(ТекущаяСтрока.СтавкаНДС, КэшированныеЗначения);
		ТекущаяСтрока.СуммаНДС = ОбработкаТабличнойЧастиТоварыКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, ТекПроцентНДС, СтруктураПараметровДействия.ЦенаВключаетНДС);
	
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуНДСПоСуммеСНДС"
//
Процедура ПересчитатьСуммуНДСПоСуммеСНДСВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДСПоСуммеСНДС", СтруктураПараметровДействия) Тогда
		
		ИмяРеквизитаСумма = "СуммаВсего";
		Если СтруктураПараметровДействия.Свойство("ИмяРеквизитаСуммаВсего") Тогда
			ИмяРеквизитаСумма = СтруктураПараметровДействия.ИмяРеквизитаСуммаВсего;
		КонецЕсли;
		
		ТекПроцентНДС = ПолучитьПроцентНДСКлиент(ТекущаяСтрока.СтавкаНДС, КэшированныеЗначения);
		ТекущаяСтрока.СуммаНДС = ОбработкаТабличнойЧастиТоварыКлиентСервер.РассчитатьСуммуНДСПоСуммеСНДС(ТекущаяСтрока[ИмяРеквизитаСумма], ТекПроцентНДС, СтруктураПараметровДействия.ЦенаВключаетНДС);
	
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуПоСуммеСНДС"
//
Процедура ПересчитатьСуммуПоСуммеСНДСВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуПоСуммеСНДС", СтруктураПараметровДействия) Тогда
		
		ИмяРеквизитаСумма = "СуммаВсего";
		Если СтруктураПараметровДействия.Свойство("ИмяРеквизитаСуммаВсего") Тогда
			ИмяРеквизитаСумма = СтруктураПараметровДействия.ИмяРеквизитаСуммаВсего;
		КонецЕсли;
		
		Если СтруктураПараметровДействия.ЦенаВключаетНДС Тогда
			ТекущаяСтрока.Сумма = ТекущаяСтрока[ИмяРеквизитаСумма];
		Иначе
			ТекущаяСтрока.Сумма = ТекущаяСтрока[ИмяРеквизитаСумма] - ТекущаяСтрока.СуммаНДС;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуСНДС"
//
Процедура ПересчитатьСуммуСНДСВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСНДС", СтруктураПараметровДействия) Тогда
		
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма + ?(СтруктураПараметровДействия.ЦенаВключаетНДС, 0, ТекущаяСтрока.СуммаНДС);
	
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьКоличествоУпаковок"
//
Процедура ПересчитатьКоличествоУпаковокВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Имя = "";
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковок",Имя) Тогда
		ТекущаяСтрока["КоличествоУпаковок" + Имя] = ТекущаяСтрока["Количество" + Имя]
		   / ПолучитьКоэффициентУпаковкиКлиент(ТекущаяСтрока.Упаковка, КэшированныеЗначения);
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьКоличествоУпаковокФакт"
//
Процедура ПересчитатьКоличествоУпаковокФактВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	ИмяФакта = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковокФакт",ИмяФакта) Тогда
		ТекущаяСтрока["КоличествоУпаковок" + ИмяФакта] = ТекущаяСтрока["Количество" + ИмяФакта]
		   / ПолучитьКоэффициентУпаковкиКлиент(ТекущаяСтрока.Упаковка, КэшированныеЗначения);
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ОбработатьШтрихкоды"
//
Процедура ОбработатьШтрихкодыКлиент(ТЧ, СтруктураДействий, КэшированныеЗначения, СоответствиеДействий)

	Перем СтруктураПараметровДействия;

	Если СтруктураДействий.Свойство("ОбработатьШтрихкоды", СтруктураПараметровДействия) Тогда
		Для Каждого ТекШтрихкод Из СтруктураПараметровДействия.Штрихкоды Цикл
			ДанныеШтрихкода = КэшированныеЗначения.Штрихкоды[ТекШтрихкод.Штрихкод];

			Если ДанныеШтрихкода.Количество() = 0 Тогда
				СтруктураПараметровДействия.НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
			Иначе
				НоваяСтруктураДействий = Новый Структура;
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НоваяСтруктураДействий, СтруктураДействий);

				МассивСтрокТЧ = ТЧ.НайтиСтроки(ДанныеШтрихкода);
				Если МассивСтрокТЧ.Количество() = 0 Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НоваяСтруктураДействий, СтруктураПараметровДействия.СтруктураДействийСДобавленнымиСтроками);

					НайденнаяСтрока = ТЧ.Добавить();
					НайденнаяСтрока.Номенклатура       = ДанныеШтрихкода.Номенклатура;
					НайденнаяСтрока.Характеристика     = ДанныеШтрихкода.Характеристика;
					НайденнаяСтрока.Упаковка           = ДанныеШтрихкода.Упаковка;
					НайденнаяСтрока.КоличествоУпаковок = ТекШтрихкод.Количество;
				Иначе
					ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НоваяСтруктураДействий, СтруктураПараметровДействия.СтруктураДействийСИзмененнымиСтроками);

					НайденнаяСтрока = МассивСтрокТЧ[0];
					НайденнаяСтрока.КоличествоУпаковок = НайденнаяСтрока.КоличествоУпаковок + ТекШтрихкод.Количество;
				КонецЕсли;

				СоответствиеДействий.Вставить(НайденнаяСтрока, НоваяСтруктураДействий);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ПересчитатьСуммуНДС"
//
Процедура ПересчитатьСуммыНДСКлиент(ТЧ, СтруктураДействий, КэшированныеЗначения, СоответствиеДействий)

	Перем СтруктураПараметровДействия;

	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС", СтруктураПараметровДействия) ИЛИ СтруктураДействий.Свойство("ПересчитатьСуммуНДСПоСуммеСНДС", СтруктураПараметровДействия) Тогда
		Если СтруктураПараметровДействия.Свойство("НеобходимоОбработатьВсюТЧ") Тогда
			Для Каждого ТекСтрока Из ТЧ Цикл
				НоваяСтруктураДействий = Новый Структура;
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НоваяСтруктураДействий, СтруктураДействий);
				СоответствиеДействий.Вставить(ТекСтрока, НоваяСтруктураДействий);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ОчиститьКоличествоУчет"
//
Процедура ОчиститьКоличествоУчетКлиент(ТЧ, СтруктураДействий, КэшированныеЗначения, СоответствиеДействий)
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ОчиститьКоличествоУчет", СтруктураПараметровДействия) Тогда
		Если СтруктураПараметровДействия.Свойство("НеобходимоОбработатьВсюТЧ") Тогда
			Для Каждого ТекСтрока Из ТЧ Цикл
				НоваяСтруктураДействий = Новый Структура;
				ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НоваяСтруктураДействий, СтруктураДействий);
				СоответствиеДействий.Вставить(ТекСтрока, НоваяСтруктураДействий);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ЗаполнитьТипНоменклатуры"
//
Процедура ЗаполнитьТипНоменклатурыВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ЗаполнитьТипНоменклатуры") Тогда
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТипНоменклатурыВСтрокеТЧКлиент()

// Процедура пересчета "ПроверитьФлагРезервированияВСтрокеТЧКлиент"
//
Процедура ПроверитьФлагРезервированияВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ПроверитьФлагРезервирования") Тогда
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьФлагРезервированияВСтрокеТЧКлиент()

// Процедура пересчета "ЗаполнитьЦенуПродажиРозница"
//
Процедура ЗаполнитьЦенуПродажиРозницаВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажиРозница") Тогда
		ТекущаяСтрока.Цена = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ЗаполнитьЦенуЗакупки"
//
Процедура ЗаполнитьЦенуЗакупкиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуЗакупки") Тогда
		ТекущаяСтрока.Цена = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ЗаполнитьЦенуПрошлойЗакупки"
//
Процедура ЗаполнитьЦенуПрошлойЗакупкиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПрошлойЗакупки") Тогда
		ТекущаяСтрока.ЦенаПрошлойЗакупки = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ЗаполнитьДействующуюЦенуПродажи"
//
Процедура ЗаполнитьДействующуюЦенуПродажиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьДействующуюЦенуПродажи") Тогда
		ТекущаяСтрока.Цена = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ЗаполнитьСкладПродажи"
//
Процедура ЗаполнитьСкладПродажиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьСкладПродажи") Тогда
		ТекущаяСтрока.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ЗаполнитьОрганизациюПродажи"
//
Процедура ЗаполнитьОрганизациюПродажиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьОрганизациюПродажи") Тогда
		ТекущаяСтрока.Склад = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

// Процедура пересчета "ЗаполнитьОбъемВесУпаковки"
//
Процедура ЗаполнитьОбъемВесПоУпаковкеВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт

	Если СтруктураДействий.Свойство("ЗаполнитьОбъемВесУпаковки") Тогда
		ТекущаяСтрока.ОбъемУпаковки =  ПолучитьОбъемУпаковкиКлиент(ТекущаяСтрока.Упаковка, КэшированныеЗначения);
		ТекущаяСтрока.ВесУпаковки = ПолучитьВесУпаковкиКлиент(ТекущаяСтрока.Упаковка, КэшированныеЗначения);
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ЗаполнитьДанныеПоДокументуПродажи"
//
Процедура ЗаполнитьДанныеПоДокументуПродажиВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ЗаполнитьДанныеПоДокументуПродажи") Тогда
		
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ОчиститьДанныеПоЗаказуКлиент"
//
Процедура ОчиститьДанныеПоЗаказуКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ОчиститьДанныеПоЗаказу") Тогда
		
		ТекущаяСтрока.КодСтроки = 0;
		ТекущаяСтрока.ЗаказПокупателя = ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка");
		
	КонецЕсли;

КонецПроцедуры

// Процедура пересчета "ЗаполнитьПредставлениеТабло"
//
Процедура ЗаполнитьПредставлениеТаблоВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ЗаполнитьПредставлениеТабло") Тогда
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредставлениеТаблоВСтрокеТЧКлиент()

// Процедура пересчета "ПересчитатьРасхождения"
//
Процедура ПересчитатьРасхожденияВСтрокеТЧКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ПересчитатьРасхождения") Тогда
		
		ТекущаяСтрока.КоличествоУпаковокРасхождения = ТекущаяСтрока.КоличествоУпаковок - ТекущаяСтрока.КоличествоУпаковокВДокументе;
		ТекущаяСтрока.ЕстьРасхождения               = (ТекущаяСтрока.КоличествоУпаковокРасхождения <> 0);
		
		Если ТекущаяСтрока.КоличествоУпаковокРасхождения = 0 Тогда
			ТекущаяСтрока.ВариантУчетаРасхождения = ПредопределенноеЗначение("Перечисление.ВариантыУчетаРасхождений.ПустаяСсылка");
			
		ИначеЕсли ТекущаяСтрока.КоличествоУпаковокРасхождения > 0
			И ТекущаяСтрока.ВариантУчетаРасхождения = ПредопределенноеЗначение("Перечисление.ВариантыУчетаРасхождений.ЗаСчетПеревозчика") Тогда
			
			ТекущаяСтрока.ВариантУчетаРасхождения = ПредопределенноеЗначение("Перечисление.ВариантыУчетаРасхождений.ПустаяСсылка");
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// ФУНКЦИИ ПОЛУЧЕНИЯ СТРУКТУР ПАРАМЕТРОВ ДЛЯ ОБРАБОТКИ ТАБЛИЧНОЙ ЧАСТИ "ТОВАРЫ".

// Получение структуры пересчета суммы НДС в строке.
//
Функция ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
КонецФункции

// Получение структуры пересчета суммы НДС в ТЧ.
//
Функция ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект);
КонецФункции

// Получение структуры заполнения цены закупки в строке.
//
Функция ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныЗакупкиВСтрокеТЧ(Объект);
КонецФункции

// Получение структуры заполнения ставки НДС.
//
Функция ПолучитьСтруктуруЗаполненияСтавкиНДС(Объект) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруЗаполненияСтавкиНДС(Объект);
КонецФункции

// Получение структуры обработки штрихкодов.
//
Функция ПолучитьСтруктуруОбработкиШтрихкодов(Объект, Штрихкоды, СтруктураДействийСДобавленнымиСтроками, СтруктураДействийСИзмененнымиСтроками) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруОбработкиШтрихкодов(Объект, Штрихкоды, СтруктураДействийСДобавленнымиСтроками, СтруктураДействийСИзмененнымиСтроками);
КонецФункции

// Получение структуры проверки серийных номеров по владельцу.
//
Функция ПолучитьСтруктуруПроверкиСерийныхНомеровПоВладельцу(ТекущаяСтрока, ТЧСерийныеНомера) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПроверкиСерийныхНомеровПоВладельцу(ТекущаяСтрока, ТЧСерийныеНомера);
КонецФункции

// Получение массива серийных номеров для строки товаров.
//
Функция ПолучитьМассивСерийныхНомеровДляСтрокиТоваров(КлючСвязи, ТЧСерийныеНомера) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьМассивСерийныхНомеровДляСтрокиТоваров(КлючСвязи, ТЧСерийныеНомера);
КонецФункции

// Получение структуры пересчета скидки при продажах.
//
Функция ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект) Экспорт
	
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект);
	
КонецФункции

// Получение структуры пересчета скидки при закупках.
//
Функция ПолучитьСтруктуруПересчетаЦеныСкидкиВЗакупкахВТЧ(Объект) Экспорт
	
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВЗакупкахВТЧ(Объект);
	
КонецФункции

// Получение структуры заполнения цены продажи в строке.
//
Функция ПолучитьСтруктуруЗаполненияЦеныПродажиВСтрокеТЧ(Объект, ПриводитьКМинимальнойЦене = Ложь) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныПродажиВСтрокеТЧ(Объект, ПриводитьКМинимальнойЦене);
КонецФункции

// Получение структуры заполнения назначенной цены.
//
Функция ПолучитьСтруктуруЗаполненияЦеныНазначеннойВСтрокеТЧ(Объект) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныНазначеннойВСтрокеТЧ(Объект);
КонецФункции

// Получение структуры заполнения цены по виду цен.
//
Функция ПолучитьСтруктуруЗаполненияЦеныПоВидуЦенВСтрокеТЧ(Объект) Экспорт
	Возврат ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныПоВидуЦенВСтрокеТЧ(Объект);
КонецФункции

//////////////////////////////////////////////////////////////////////
// ИНТЕРАКТИВНЫЕ ПРОЦЕДУРЫ.

// Процедура получения списка упаковок для выбора.
//
Процедура ВыбратьУпаковкуНоменклатуры(ДанныеВыбора, СтандартнаяОбработка, ТекущаяСтрока, ДобавлятьПустуюУпаковку = Истина) Экспорт

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		ОбработкаТабличнойЧастиТоварыВызовСервера.ПолучитьСписокДляВыбораУпаковок(ТекущаяСтрока.Номенклатура, ДанныеВыбора, ДобавлятьПустуюУпаковку);
	КонецЕсли;

КонецПроцедуры

// Процедура получения характеристик номенклатуры.
//
Процедура ВыбратьХарактеристикуНоменклатуры(Форма, Элемент, СтандартнаяОбработка, ТекущаяСтрока) Экспорт

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		ВладелецХарактеристики = Неопределено;
		Если ОбработкаТабличнойЧастиТоварыВызовСервера.ПроверитьИспользованиеХарактеристикИПолучитьВладельцаДляВыбора(ТекущаяСтрока.Номенклатура, ВладелецХарактеристики) Тогда
			Если ВладелецХарактеристики = Неопределено Тогда
				ПоказатьПредупреждение(,НСтр("ru = 'Для данной номенклатуры характеристики не заданы.'"));
				Возврат;
			Иначе
				ПараметрыФормыВыбора = Новый Структура;
				ПараметрыФормыВыбора.Вставить("ТекущийЭлемент"  , ТекущаяСтрока.Характеристика);
				ПараметрыФормыВыбора.Вставить("ПараметрВладелец", ВладелецХарактеристики);
				ПараметрыФормыВыбора.Вставить("Номенклатура"    , ТекущаяСтрока.Номенклатура);

				ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(,НСтр("ru = 'Для данной номенклатуры отключено использование характеристик.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Процедура обработки ручного ввода штрихкода.
//
Процедура ВвестиШтрихкод(Объект) Экспорт
	
	Штрихкод = "";
	ТекстЗаголовка = НСтр("ru = 'Введите штрихкод'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоШтрихкоду", Объект);
	
	ПоказатьВводСтроки(ОписаниеОповещения, Штрихкод, ТекстЗаголовка);
	
КонецПроцедуры

// Процедура обработки ручного ввода штрихкода серии.
//
Процедура ВвестиШтрихкодСерии(Объект) Экспорт
	
	Штрихкод = "";
	ТекстЗаголовка = НСтр("ru = 'Введите штрихкод серии'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоШтрихкоду", Объект);
	
	ПоказатьВводСтроки(ОписаниеОповещения, Штрихкод, ТекстЗаголовка);
	
КонецПроцедуры

// Процедура поиска по магнитному коду.
//
Процедура ВвестиМагнитныйКод(Объект) Экспорт
	
	Код = "";
	ТекстЗаголовка = НСтр("ru = 'Введите магнитный код'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоМагнитномуКоду", Объект);
	
	ПоказатьВводСтроки(ОписаниеОповещения, Код, ТекстЗаголовка);
	
КонецПроцедуры

// Процедура сообщения пользователю о неизвестных штрихкодах.
//
Процедура СообщитьОНеизвестныхШтрихкодах(НеизвестныеШтрихкоды) Экспорт

	Для Каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
	КонецЦикла;

КонецПроцедуры

// Процедура разбиения строки
//
Процедура РазбитьСтрокуТЧ(Форма, ТЧ, ДанныеФормы, ИмяПоляКоличество = "", Заголовок = "", РазрешитьНулевоеКоличество = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяПоляКоличество) Тогда
		ИмяПоляКоличество = "КоличествоУпаковок";
	КонецЕсли;
	
	ТекущаяСтрока	= ДанныеФормы.ТекущиеДанные;
	ЧислоВведено = Истина;
	ТекстЗаголовка	= ?(ЗначениеЗаполнено(Заголовок), Заголовок, НСтр("ru = 'Введите количество товара в новой строке'"));
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для выполнения команды требуется выбрать строку табличной части.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	ИначеЕсли ТекущаяСтрока[ИмяПоляКоличество] = 0
		И Не РазрешитьНулевоеКоличество Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно разбить строку с нулевым количеством.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РазрешитьНулевоеКоличество", РазрешитьНулевоеКоличество);
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("ТЧ", ТЧ);
	ДополнительныеПараметры.Вставить("ДанныеФормы", ДанныеФормы);
	ДополнительныеПараметры.Вставить("ИмяПоляКоличество", ИмяПоляКоличество);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Заголовок", Заголовок);
	ДополнительныеПараметры.Вставить("НоваяСтрока", Неопределено);
	
	
	Если ТекущаяСтрока[ИмяПоляКоличество] <> 0 Тогда
		
		Количество = ТекущаяСтрока[ИмяПоляКоличество];
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеРазбитьСтроку", Форма, ДополнительныеПараметры);
		
		ПоказатьВводЧисла(ОписаниеОповещения, Количество, ТекстЗаголовка, 15, 3);
		
	Иначе
		
		Количество = 0;
		
		ИндексТекущейСтроки 	 = ТЧ.Индекс(ТекущаяСтрока);
		НоваяСтрока 			 = ТЧ.Вставить(ИндексТекущейСтроки + 1);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока[ИмяПоляКоличество]      = Количество;
		ТекущаяСтрока[ИмяПоляКоличество] 	= ТекущаяСтрока[ИмяПоляКоличество] - НоваяСтрока[ИмяПоляКоличество];
		
		ДанныеФормы.ТекущаяСтрока  = НоваяСтрока.ПолучитьИдентификатор();
		
		ДополнительныеПараметры.НоваяСтрока = НоваяСтрока;

		Форма.ОповещениеРазбитьСтроку(Количество, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РазбитьСтрокуТЧПроверитьЧисло(Количество, ДополнительныеПараметры) Экспорт
	
	ЧислоВведено               = НЕ (Количество = Неопределено);
	РазрешитьНулевоеКоличество = ДополнительныеПараметры.РазрешитьНулевоеКоличество;
	ТекущаяСтрока              = ДополнительныеПараметры.ТекущаяСтрока;
	ТЧ                         = ДополнительныеПараметры.ТЧ;
	ДанныеФормы                = ДополнительныеПараметры.ДанныеФормы;
	ИмяПоляКоличество          = ДополнительныеПараметры.ИмяПоляКоличество;
	Форма                      = ДополнительныеПараметры.Форма;
	Заголовок                  = ДополнительныеПараметры.Заголовок;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РазбитьСтрокуТЧОповещениеПредупреждения", ОбработкаТабличнойЧастиТоварыКлиент, ДополнительныеПараметры);
	
	Если Не ЧислоВведено Тогда
		Возврат;
		
	ИначеЕсли Количество = 0
		И Не РазрешитьНулевоеКоличество Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть равно нулю.'");
		ПоказатьПредупреждение(,ТекстСообщения);
		Количество = Неопределено;
		
	ИначеЕсли ТекущаяСтрока[ИмяПоляКоличество] >= 0
		И Количество < 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть отрицательным.'");
		Количество = Неопределено;
		ПоказатьПредупреждение(ОписаниеОповещения ,ТекстСообщения);
		
	ИначеЕсли ТекущаяСтрока[ИмяПоляКоличество] <= 0
		И Количество > 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть положительным.'");
		Количество = Неопределено;
		ПоказатьПредупреждение(ОписаниеОповещения ,ТекстСообщения);
		
	ИначеЕсли ТекущаяСтрока[ИмяПоляКоличество] >= 0
		И Количество >  ТекущаяСтрока[ИмяПоляКоличество] Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть больше количества в текущей.'");
		ПоказатьПредупреждение(ОписаниеОповещения ,ТекстСообщения);
		Количество = Неопределено;
		
	ИначеЕсли ТекущаяСтрока[ИмяПоляКоличество] <= 0
		И Количество < ТекущаяСтрока[ИмяПоляКоличество] Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть меньше количества в текущей.'");
		ПоказатьПредупреждение(ОписаниеОповещения ,ТекстСообщения);
		Количество = Неопределено;
		
	ИначеЕсли Количество =  ТекущаяСтрока[ИмяПоляКоличество]
		И Не РазрешитьНулевоеКоличество Тогда
		
		ТекстСообщения = НСтр("ru = 'Количество в новой строке должно отличаться от количества в текущей.'");
		ПоказатьПредупреждение(ОписаниеОповещения ,ТекстСообщения);
		Количество = Неопределено;

	КонецЕсли;
	
	Если НЕ Количество = Неопределено Тогда
		
		ИндексТекущейСтроки = ТЧ.Индекс(ТекущаяСтрока);
		НоваяСтрока         = ТЧ.Вставить(ИндексТекущейСтроки + 1);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока[ИмяПоляКоличество]      = Количество;
		ТекущаяСтрока[ИмяПоляКоличество] 	= ТекущаяСтрока[ИмяПоляКоличество] - НоваяСтрока[ИмяПоляКоличество];
		
		ДанныеФормы.ТекущаяСтрока  = НоваяСтрока.ПолучитьИдентификатор();
		ДополнительныеПараметры.НоваяСтрока = НоваяСтрока;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РазбитьСтрокуТЧОповещениеПредупреждения(ДополнительныеПараметры) Экспорт
	
	РазрешитьНулевоеКоличество = ДополнительныеПараметры.РазрешитьНулевоеКоличество;
	ТекущаяСтрока              = ДополнительныеПараметры.ТекущаяСтрока;
	ТЧ                         = ДополнительныеПараметры.ТЧ;
	ДанныеФормы                = ДополнительныеПараметры.ДанныеФормы;
	ИмяПоляКоличество          = ДополнительныеПараметры.ИмяПоляКоличество;
	Форма                      = ДополнительныеПараметры.Форма;
	Заголовок                  = ДополнительныеПараметры.Заголовок;
	
	РазбитьСтрокуТЧ(Форма, ТЧ, ДанныеФормы, ИмяПоляКоличество, Заголовок, РазрешитьНулевоеКоличество);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ ВЫБОРА СЕРИЙНЫХ НОМЕРОВ В ДОКУМЕНТАХ

// Процедура проверки использования номеров подарочных сертификатов.
//
Процедура ПроверитьИспользованиеСерийныхНомеров(Номенклатура, ИспользоватьСерийныеНомера)

	ЗначениеРеквизитов = ОбщегоНазначенияВызовСервера.ПолучитьЗначенияРеквизитовОбъекта(Номенклатура,
			Новый Структура("ИспользоватьСерийныеНомера, ТипНоменклатуры, Представление"));

	Если НЕ ЗначениеРеквизитов.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.сабТипыНоменклатуры.ПодарочныйСертификат") Тогда
		ИспользоватьСерийныеНомера = Ложь;
		
		СтрокаСообщения = НСтр("ru = 'Номенклатура ""%1%"" не является подарочным сертификатом!'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ЗначениеРеквизитов.Представление);
		ПоказатьПредупреждение(,СтрокаСообщения);
		Возврат;
	ИначеЕсли Не ЗначениеРеквизитов.ИспользоватьСерийныеНомера Тогда
		ИспользоватьСерийныеНомера = Ложь;
		
		СтрокаСообщения = НСтр("ru = 'Для номенклатуры ""%1%"" не используются номера подарочных сертификатов!'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ЗначениеРеквизитов.Представление);
		ПоказатьПредупреждение(,СтрокаСообщения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура добавления номера подарочного сертификата в ТЧ.
//
Функция ДобавитьСерийныеНомераВТабличнуюЧасть(ТЧСерийныеНомера, МассивСерийныхНомеров, ТекущийКлючСвязи) Экспорт

	НовыйКлючСвязи = 0;

	Если ТекущийКлючСвязи <> 0 Тогда

		Для Каждого СтрокаТЧ Из ТЧСерийныеНомера.НайтиСтроки(Новый Структура("КлючСвязиСерийныхНомеров", ТекущийКлючСвязи)) Цикл
			ТЧСерийныеНомера.Удалить(ТЧСерийныеНомера.Индекс(СтрокаТЧ));
		КонецЦикла;

	КонецЕсли;

	Если МассивСерийныхНомеров.Количество() = 0 Тогда

		НовыйКлючСвязи = 0;

	Иначе

		Если ТекущийКлючСвязи = 0 Тогда

			ВремКлючСвязи = 0;
			Для Каждого СтрокаТЧ Из ТЧСерийныеНомера Цикл
				Если ВремКлючСвязи < СтрокаТЧ.КлючСвязиСерийныхНомеров Тогда
					ВремКлючСвязи = СтрокаТЧ.КлючСвязиСерийныхНомеров;
				КонецЕсли;
			КонецЦикла;

			НовыйКлючСвязи = ВремКлючСвязи + 1;

		Иначе
			НовыйКлючСвязи = ТекущийКлючСвязи;
		КонецЕсли;

		Для Каждого СерийныйНомер Из МассивСерийныхНомеров Цикл

			НоваяСтрокаСН = ТЧСерийныеНомера.Добавить();
			НоваяСтрокаСН.СерийныйНомер            = СерийныйНомер;
			НоваяСтрокаСН.КлючСвязиСерийныхНомеров = НовыйКлючСвязи;

		КонецЦикла;
	КонецЕсли;

	Возврат НовыйКлючСвязи;

КонецФункции

// Процедура ввода номеров подарочных сертификатов в ТЧ.
//
Процедура ВвестиСерийныеНомераНоменклатурыВТЧ(Форма, ТЧСерийныеНомера, СтрокаТЧ) Экспорт
	Перем НовыйКлючСвязи;
	Перем Количество;

	Если СтрокаТЧ = Неопределено Тогда

		ПоказатьПредупреждение(,НСтр("ru = 'Не выбрана строка, для которой необходимо Ввести подарочные сертификаты!'"));
		Возврат;

	ИначеЕсли Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда

		ПоказатьПредупреждение(,НСтр("ru = 'Для ввода номеров подарочных сертификатов необходимо выбрать номенклатуру!'"));
		Возврат;

	КонецЕсли;
	
	ВвестиПодарочныеСертификаты(Форма, ТЧСерийныеНомера, СтрокаТЧ, НовыйКлючСвязи, Количество)
	
КонецПроцедуры

Процедура ВвестиПодарочныеСертификаты(Форма, ТЧСерийныеНомера, СтрокаТЧ, НовыйКлючСвязи, Количество = 0)
	
	ТекущийКлючСвязи = СтрокаТЧ.КлючСвязиСерийныхНомеров;
	Номенклатура = СтрокаТЧ.Номенклатура;
	
	ИспользоватьСерийныеНомера = Истина;
	ПроверитьИспользованиеСерийныхНомеров(Номенклатура, ИспользоватьСерийныеНомера);
	
	Если ИспользоватьСерийныеНомера Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МассивСерийныхНомеров",     ОбработкаТабличнойЧастиТоварыКлиент.ПолучитьМассивСерийныхНомеровДляСтрокиТоваров(ТекущийКлючСвязи, ТЧСерийныеНомера));
		ПараметрыФормы.Вставить("Номенклатура"             , Номенклатура);
		ПараметрыФормы.Вставить("ПредставлениеНоменклатуры", Строка(Номенклатура));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТЧСерийныеНомера", ТЧСерийныеНомера);
		ДополнительныеПараметры.Вставить("ТекущийКлючСвязи", ТекущийКлючСвязи);
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("СтрокаТЧ", СтрокаТЧ);
		ДополнительныеПараметры.Вставить("КоличествоУпаковок", СтрокаТЧ.КоличествоУпаковок);
		
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодбораПодарочныхСертификатов", Форма, ДополнительныеПараметры);
		ОткрытьФорму("Обработка.ПодборСерийныхНомеровПодарочныхСертификатов.Форма.ФормаВводаСерийныхНомеров", ПараметрыФормы, Форма,,,,ОписаниеОповещения,РежимОткрытия);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВводаНомеровПодарочныхСертификатов(НовыеСерийныеНомера, ДополнительныеПараметры)Экспорт
	
	ТЧСерийныеНомера = ДополнительныеПараметры.ТЧСерийныеНомера;
	ТекущийКлючСвязи = ДополнительныеПараметры.ТекущийКлючСвязи;
	СтрокаТЧ         = ДополнительныеПараметры.СтрокаТЧ;
	Форма            = ДополнительныеПараметры.Форма;
	ПересчетКоличества = Ложь;
	
	Если ТипЗнч(НовыеСерийныеНомера) = Тип("Массив") Тогда
		НовыйКлючСвязи = ДобавитьСерийныеНомераВТабличнуюЧасть(ТЧСерийныеНомера, НовыеСерийныеНомера, ТекущийКлючСвязи);
		Количество = НовыеСерийныеНомера.Количество();
		
		Форма.Модифицированность          = Истина;
		СтрокаТЧ.КлючСвязиСерийныхНомеров = НовыйКлючСвязи;
		СтрокаТЧ.КоличествоУпаковок       = Количество;
		ПересчетКоличества                = Истина;
		
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ПересчетКоличества", ПересчетКоличества);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
//ПРОЦЕДУРЫ РАБОТЫ С СЕРИЯМИ

// Функция проверяет необходимость указания серий в строке.
// Параметры:
//		Форма - форма документа, в которой инициировано указание серий.
//      ПараметрыУказанияСерий - структура параметров указания серий, возвращаемая соответствующей процедурой модуля
//                               менеджера документа.
// Возвращаемое значение
//      Тип Булево
Функция ПроверитьВозможностьУказанияСерий(Форма, ПараметрыУказанияСерий, ВводСерийРазрешен, ИмяТабличногоПоля = "", ОсобыйВыводСообщения = Ложь, ТекстСообщения = "") Экспорт
	
	ВводСерийРазрешен = Истина;
	
	ИмяТЧТовары = "";
	ИмяТЧСерии  = "";
	ТоварВШапке = Ложь;
	Если Не ПараметрыУказанияСерий.Свойство("ТоварВШапке", ТоварВШапке) Тогда
		ТоварВШапке = Ложь;
	КонецЕсли;
	
	Если Не ПараметрыУказанияСерий.Свойство("ИмяТЧТовары", ИмяТЧТовары) Тогда
		ИмяТЧТовары = "Товары";
	КонецЕсли;
	
	Если Не ПараметрыУказанияСерий.Свойство("ИмяТЧСерии", ИмяТЧСерии) Тогда
		ИмяТЧСерии = "Серии";
	КонецЕсли;
	
	Если ИмяТабличногоПоля = "" Тогда
		ИмяТабличногоПоля = ИмяТЧТовары;
	КонецЕсли;
	
	Если ТоварВШапке Тогда
		Если Форма.Объект.СтатусУказанияСерий = 0 Тогда
			ТекстСообщения = НСтр("ru='Для указанного товара серии указывать не нужно.'");
			Если НЕ ОсобыйВыводСообщения Тогда
				ПоказатьПредупреждение(,ТекстСообщения);
			КонецЕсли;
			ВводСерийРазрешен = Ложь;
		КонецЕсли;
		
	Иначе
		ТекущиеДанные = Форма.Элементы[ИмяТабличногоПоля].ТекущиеДанные;
		
		ЭтоМаркировкаТоваровГИСМ = ПараметрыУказанияСерий.СкладскиеОперации.Найти(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.МаркировкаПродукцииДляГИСМ")) <> Неопределено;
		
		Если ТекущиеДанные = Неопределено Тогда
			ТекстСообщения = НСтр("ru='Необходимо выбрать строку товаров, для которой необходимо указать серии.'");
			Если НЕ ОсобыйВыводСообщения Тогда
				ПоказатьПредупреждение(,ТекстСообщения);
			КонецЕсли;
			ВводСерийРазрешен = Ложь;
		ИначеЕсли ТекущиеДанные.СтатусУказанияСерий = 0 Тогда
			Если Не ЭтоМаркировкаТоваровГИСМ Тогда
				ТекстСообщения = НСтр("ru='Для этого товара серии указывать не нужно.'");
			Иначе
				ТекстСообщения = НСтр("ru='Для этого товара не настроено указание серий в магазине %Магазин%.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, " %Магазин%", Форма.Объект.Магазин);
			КонецЕсли;
			ТекстСообщения = НСтр("ru='Для выбранной строки товаров серии указывать не нужно.'");
			Если НЕ ОсобыйВыводСообщения Тогда
				ПоказатьПредупреждение(,ТекстСообщения);
			КонецЕсли;
			ВводСерийРазрешен = Ложь;
		ИначеЕсли ЭтоМаркировкаТоваровГИСМ
			И (Не ЗначениеЗаполнено(ТекущиеДанные.НоменклатураКиЗ)
				Или ТекущиеДанные.ХарактеристикиКиЗИспользуются
					И Не ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаКиЗ)
				Или Не ЗначениеЗаполнено(ТекущиеДанные.GTIN)) Тогда
				Если Не ЗначениеЗаполнено(ТекущиеДанные.GTIN) Тогда
					ТекстСообщения = НСтр("ru='Перед указанием серий нужно указать GTIN.'");
				Иначе
					ТекстСообщения = НСтр("ru='Перед указанием серий нужно выбрать КиЗ.'");
				КонецЕсли;
		ИначеЕсли ПараметрыУказанияСерий.ПоляСвязи.Найти("Упаковка") <> Неопределено
			И Не ЗначениеЗаполнено(ТекущиеДанные.Упаковка) Тогда
			
			ТекстСообщения = НСтр("ru='Перед указанием серий нужно заполнить упаковку.'");
			Если НЕ ОсобыйВыводСообщения Тогда
				ПоказатьПредупреждение(,ТекстСообщения);
			КонецЕсли;
			ВводСерийРазрешен = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Процедура обновляет кеш ключевых реквизитов текущей строки товаров. По ключевым реквизитам осуществляется связь
// между ТЧ серий и ТЧ товаров.
// Параметры:
//		ТаблицаФормы - таблица формы, отображающая ТЧ товаров.
//      КэшированныеЗначения - переменная модуля формы, в которой хранятся кешируемые значения.
//      ПараметрыУказанияСерий - структура параметров указания серий, возвращаемая соответствующей процедурой модуля
//                               менеджера документа.
//      Копирование - признак, что кешированная строка скопирована (параметр события ПриНачалеРедактирования).
Процедура ОбновитьКэшированныеЗначенияДляУчетаСерий(ТаблицаФормы,КэшированныеЗначения,ПараметрыУказанияСерий,Копирование = Ложь) Экспорт
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные;
	
	ОбработкаТабличнойЧастиТоварыКлиентСервер.ОбновитьКэшированныеЗначенияДляУчетаСерий(ТекущиеДанные,КэшированныеЗначения,ПараметрыУказанияСерий,Копирование);
КонецПроцедуры

// Процедура обновляет кеш ключевых реквизитов товара в шапке документа. По ключевым реквизитам осуществляется связь
// между ТЧ серий товаром.
// Параметры:
//		Объект - ДанныеФормыСтруктура - основной реквизит формы.
//      КэшированныеЗначения - переменная модуля формы, в которой хранятся кешируемые значения.
//      ПараметрыУказанияСерий - структура параметров указания серий, возвращаемая соответствующей процедурой модуля
//                               менеджера документа.
Процедура ОбновитьКэшированныеЗначенияШапкиДляУчетаСерий(Объект,КэшированныеЗначения,ПараметрыУказанияСерий) Экспорт
	
	Если Не ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	
	Если КэшированныеЗначения = Неопределено Тогда
		КэшированныеЗначения = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	КонецЕсли;
	
	КэшированныеЗначения.Вставить("НоменклатураШапка",Объект.Номенклатура);
	КэшированныеЗначения.Вставить("ХарактеристикаШапка",Объект.Характеристика);
	КэшированныеЗначения.Вставить("КоличествоШапка",Объект.Количество);
	
	Для Каждого СтрокаМассива Из ПараметрыУказанияСерий.ПоляСвязи Цикл
		КэшированныеЗначения.Вставить(СтрокаМассива+"Шапка",Объект[СтрокаМассива]);
	КонецЦикла;
		
КонецПроцедуры

// Функция проверяет необходимость обновления статусов указания серий при окончании редактирования строки товаров.
// Параметры:
//		ТаблицаФормы - таблица формы, отображающая ТЧ товаров.
//      КэшированныеЗначения - переменная модуля формы, в которой хранятся кешируемые значения.
//      ПараметрыУказанияСерий - структура параметров указания серий, возвращаемая соответствующей процедурой модуля
//                               менеджера документа.
//		Удаление - признак, что проверка вызывается при удалении строки ТЧ.
// Возвращаемое значение
//		ИСТИНА - нужно обновить статусы указания серий, ЛОЖЬ - в противном случае.
Функция НеобходимоОбновитьСтатусыСерий(ТаблицаФормы,КэшированныеЗначения,ПараметрыУказанияСерий, Удаление = Ложь) Экспорт
	
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Удаление Тогда
		Возврат Истина;
	КонецЕсли;
	
	ИмяТЧТовары = "";
	
	Если Не ПараметрыУказанияСерий.Свойство("ИмяТЧТовары", ИмяТЧТовары) Тогда
		ИмяТЧТовары = "Товары";
	КонецЕсли;
	
	ИмяТЧСерии  = "";
	
	Если Не ПараметрыУказанияСерий.Свойство("ИмяТЧСерии", ИмяТЧСерии) Тогда
		ИмяТЧСерии = "Серии";
	КонецЕсли;
	
	Если ИмяТЧТовары = ИмяТЧСерии Тогда
		Если КэшированныеЗначения.Номенклатура = ТекущиеДанные.Номенклатура Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	ТекстПоляСвязи = "";
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого СтрокаМассива Из ПараметрыУказанияСерий.ПоляСвязи Цикл
		ТекстПоляСвязи = ТекстПоляСвязи + "," + СтрокаМассива;
	КонецЦикла;
	
	Если ПараметрыУказанияСерий.Свойство("ЭтоЗаказ")
		И ПараметрыУказанияСерий.ЭтоЗаказ
		И ПараметрыУказанияСерий.СкладскиеОперации.Найти(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки")) = Неопределено
		И ПараметрыУказанияСерий.СкладскиеОперации.Найти(ПредопределенноеЗначение("Перечисление.СкладскиеОперации.ОтгрузкаКомплектовДляРазборки")) = Неопределено Тогда
		ЕстьОтменаСтроки = Истина;
	Иначе
		ЕстьОтменаСтроки = Ложь;
	КонецЕсли;
	
	Если ЕстьОтменаСтроки Тогда
		ТекстПоляСвязи = ТекстПоляСвязи + ",Отменено";
	КонецЕсли;
	
	ИмяКолонкиКоличество = "";
	Если Не ПараметрыУказанияСерий.Свойство("ИмяКолонкиКоличество", ИмяКолонкиКоличество) Тогда
		ИмяКолонкиКоличество = "Количество";
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.СтруктурыРавны(КэшированныеЗначения, ТекущиеДанные,
		ИмяКолонкиКоличество + ",Номенклатура,Характеристика"+ТекстПоляСвязи) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция проверяет необходимость обновления статуса указания серий для товара в шапке документа.
// Параметры:
//		Объект - ДанныеФормыСтруктура - основной реквизит формы.
//      КэшированныеЗначения - переменная модуля формы, в которой хранятся кешируемые значения.
//      ПараметрыУказанияСерий - структура параметров указания серий, возвращаемая соответствующей процедурой модуля
//                               менеджера документа.
// Возвращаемое значение
//		ИСТИНА - нужно обновить статус указания серий, ЛОЖЬ - в противном случае.
Функция НеобходимоОбновитьСтатусСерийВШапке(Объект,КэшированныеЗначения,Знач ПараметрыУказанияСерий) Экспорт
	
	Если Не ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если КэшированныеЗначения.НоменклатураШапка <> Объект.Номенклатура
		Или  КэшированныеЗначения.ХарактеристикаШапка <> Объект.Характеристика
		Или  КэшированныеЗначения.КоличествоШапка <> Объект.Количество Тогда
		Возврат Истина;
	Иначе	
		Для Каждого СтрокаМассива Из ПараметрыУказанияСерий.ПоляСвязи Цикл
			Если КэшированныеЗначения[СтрокаМассива+"Шапка"] <> Объект[СтрокаМассива] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура пересчета статуса СтатусСерийИПодарочныхСертификатов в строке документа.
//
Процедура ОбновитьСтатусСерийИПодарочныхСертификатов(СтрокаТаблицы) Экспорт

	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаТаблицы.СтатусыСерийИПодарочныхСертификатов = 0;
	
	Если СтрокаТаблицы.Свойство("ИспользоватьСерийныеНомера") И СтрокаТаблицы.ИспользоватьСерийныеНомера Тогда
		СтрокаТаблицы.СтатусыСерийИПодарочныхСертификатов = 12;
	ИначеЕсли СтрокаТаблицы.Свойство("СтатусУказанияСерий") Тогда
		СтрокаТаблицы.СтатусыСерийИПодарочныхСертификатов = СтрокаТаблицы.СтатусУказанияСерий;
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ.

// Функция получения параметров для обработки ТЧ.
//
Функция ПолучитьПараметрыОбработкиТЧ(ТЧ, ТекущаяСтрока, СтруктураОбщихДействий, КэшированныеЗначения)

	Перем Характеристика;
	Перем Упаковка;
	Перем СтруктураПараметровДействия;

	НеобходимВызовСервера     = Ложь;
	НеобходимоОбработатьВсюТЧ = Ложь;

	СтруктураДействий = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураДействий, СтруктураОбщихДействий);

	БудутДобавленныеСтроки = Ложь;
	БудутИзмененныеСтроки  = Ложь;
    	
	Если СтруктураДействий.Свойство("ПроверитьСерийныеНомераПоВладельцу", СтруктураПараметровДействия)
		И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		НеобходимВызовСервера = Истина;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаАкцизнойМарки")
		И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		НеобходимВызовСервера = Истина;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаСправкиНаАлкоголь")
		И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		НеобходимВызовСервера = Истина;
	КонецЕсли;
	
	ПроверитьХарактеристикуПоВладельцу = СтруктураДействий.Свойство("ПроверитьХарактеристикуПоВладельцу", Характеристика);
	ПроверитьЗаполнитьУпаковкуПоВладельцу = СтруктураДействий.Свойство("ПроверитьЗаполнитьУпаковкуПоВладельцу", Упаковка);
	
	Если (ПроверитьХарактеристикуПоВладельцу
		ИЛИ ПроверитьЗаполнитьУпаковкуПоВладельцу) 
		И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		 
		НеобходимВызовСервера = Истина;
				
	КонецЕсли;

	Если (СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиниц")
	 Или СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковок")
	 Или СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковокФакт")
	 Или СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницПлан")
	 Или СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницФакт")
	 Или СтруктураДействий.Свойство("ЗаполнитьОбъемВесУпаковки")) Тогда
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка)
					   И КэшированныеЗначения.КоэффициентыУпаковок[СтрокаТЧ.Упаковка] = Неопределено Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)
			   И ЗначениеЗаполнено(ТекущаяСтрока.Упаковка)
			   И КэшированныеЗначения.КоэффициентыУпаковок[ТекущаяСтрока.Упаковка] = Неопределено Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ОчиститьКоличествоУчет", СтруктураПараметровДействия) Тогда
		Если НЕ СтруктураПараметровДействия = Неопределено И СтруктураПараметровДействия.Свойство("НеобходимоОбработатьВсюТЧ") Тогда
			НеобходимоОбработатьВсюТЧ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажи", СтруктураПараметровДействия) Тогда
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура)  Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажиНазначенную", СтруктураПараметровДействия) Тогда
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура)  Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПоВидуЦен", СтруктураПараметровДействия) Тогда
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура)  Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;                                             
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуЗакупки", СтруктураПараметровДействия) Тогда
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) 
						И ЗначениеЗаполнено(СтруктураПараметровДействия.Контрагент) Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура)  
				И ЗначениеЗаполнено(СтруктураПараметровДействия.Контрагент) Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПрошлойЗакупки", СтруктураПараметровДействия) Тогда
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;   
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС", СтруктураПараметровДействия) Тогда
		
		Если СтруктураПараметровДействия.Свойство("НеобходимоОбработатьВсюТЧ") Тогда
			НеобходимоОбработатьВсюТЧ = Истина;
		КонецЕсли;
		
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если КэшированныеЗначения.ПроцентыСтавокНДС[СтрокаТЧ.СтавкаНДС] = Неопределено Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если КэшированныеЗначения.ПроцентыСтавокНДС[ТекущаяСтрока.СтавкаНДС] = Неопределено Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДСПоСуммеСНДС", СтруктураПараметровДействия) Тогда
		
		Если СтруктураПараметровДействия.Свойство("НеобходимоОбработатьВсюТЧ") Тогда
			НеобходимоОбработатьВсюТЧ = Истина;
		КонецЕсли;
		
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если КэшированныеЗначения.ПроцентыСтавокНДС[СтрокаТЧ.СтавкаНДС] = Неопределено Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если КэшированныеЗначения.ПроцентыСтавокНДС[ТекущаяСтрока.СтавкаНДС] = Неопределено Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьТипНоменклатуры", СтруктураПараметровДействия) 
		И СтруктураДействий.Свойство("ПроверитьФлагРезервирования")
		И СтруктураДействий.Свойство("ЗаполнитьПредставлениеТабло") Тогда
		Если НеобходимоОбработатьВсюТЧ Тогда
			Если БудутДобавленныеСтроки Тогда
				НеобходимВызовСервера = Истина;
			Иначе
				Для Каждого СтрокаТЧ Из ТЧ Цикл
					Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
						НеобходимВызовСервера = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				НеобходимВызовСервера = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
			
	Если СтруктураДействий.Свойство("ЗаполнитьРеквизитыПоНоменклатуре", СтруктураПараметровДействия)
	   И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		НеобходимВызовСервера = Истина;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуВозвратСУчетомОснования", СтруктураПараметровДействия) Тогда
		НеобходимВызовСервера = Истина;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВСтроке", СтруктураПараметровДействия) Тогда
		НеобходимВызовСервера = Истина;
		
		Если СтруктураПараметровДействия.Свойство("НеобходимоОбработатьВсюТЧ") Тогда
			НеобходимоОбработатьВсюТЧ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВШапке", СтруктураПараметровДействия) Тогда
		НеобходимВызовСервера = Истина;
		
		Если СтруктураПараметровДействия.Свойство("НеобходимоОбработатьВсюТЧ") Тогда
			НеобходимоОбработатьВсюТЧ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПараметровДействия) Тогда
		
		ИспользоватьРучныеСкидки = Ложь;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			Если СтруктураПараметровДействия.Свойство("ИспользоватьРучныеСкидки") Тогда
				ИспользоватьРучныеСкидки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ИспользоватьАвтоматическиеСкидки = Ложь;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			Если СтруктураПараметровДействия.Свойство("ИспользоватьАвтоматическиеСкидки") Тогда
				ИспользоватьАвтоматическиеСкидки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если (ИспользоватьРучныеСкидки И КэшированныеЗначения.ИспользоватьРучныеСкидкиВПродажах = Неопределено)
			Или (ИспользоватьАвтоматическиеСкидки И КэшированныеЗначения.ИспользоватьАвтоматическиеСкидкиВПродажах = Неопределено) Тогда
			
			НеобходимВызовСервера = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", СтруктураПараметровДействия) Тогда
		
		ИспользоватьРучныеСкидки = Ложь;
		Если СтруктураПараметровДействия <> Неопределено Тогда
			Если СтруктураПараметровДействия.Свойство("ИспользоватьРучныеСкидки") Тогда
				ИспользоватьРучныеСкидки = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ИспользоватьРучныеСкидки  <> Неопределено И КэшированныеЗначения.ИспользоватьРучныеСкидкиВЗакупках = Неопределено Тогда
			НеобходимВызовСервера = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьДанныеПоДокументуПродажи", СтруктураПараметровДействия) Тогда
		
		НеобходимВызовСервера = Истина;
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьАссортиментСтроки")
		И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		
		НеобходимВызовСервера = Истина;
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьЗапретРозничнойПродажи")
		И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
		
		НеобходимВызовСервера = Истина;
		
	КонецЕсли;
	
	Возврат Новый Структура("НеобходимВызовСервера, НеобходимоОбработатьВсюТЧ, СтруктураДействий",
	   НеобходимВызовСервера,
	   НеобходимоОбработатьВсюТЧ,
	   СтруктураДействий);

КонецФункции

// Функция получения структуры полей ТЧ.
//
Функция ПолучитьСтруктуруПолейТЧ(СтруктураДействий)

	Перем СтруктураПараметровДействия;

	СтруктураПолейТЧ = Новый Структура;

	Если СтруктураДействий.Свойство("ОбработатьШтрихкоды", СтруктураПараметровДействия) Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
		СтруктураПолейТЧ.Вставить("ХарактеристикиИспользуются");
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПроверитьСерийныеНомераПоВладельцу") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("КлючСтроки");
		СтруктураПолейТЧ.Вставить("КлючСвязиСерийныхНомеров");
		СтруктураПолейТЧ.Вставить("ИспользоватьСерийныеНомера");
		
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаАкцизнойМарки") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("КлючСтроки");
		СтруктураПолейТЧ.Вставить("КлючСвязи");
		СтруктураПолейТЧ.Вставить("НеобходимостьВводаАкцизнойМарки");
		
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаСправкиНаАлкоголь") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("НеобходимостьВводаСправкиНаАлкоголь");
		
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПроверитьНезаполненностьСтрокиПоступленияТоваровЕГАИС") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("ЕстьОшибкиВЗаполненииСтроки");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьХарактеристикуПоВладельцу") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("ХарактеристикиИспользуются");
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПроверитьЗаполнитьУпаковкуПоВладельцу") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Упаковка");
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиниц") Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
		СтруктураПолейТЧ.Вставить("Количество", 0);
	КонецЕсли;

	ИмяРеквизитаЦены = "";
	Если СтруктураДействий.Свойство("ОбнулитьЦену", ИмяРеквизитаЦены) Тогда
		Если НЕ ЗначениеЗаполнено(ИмяРеквизитаЦены)  Тогда
			ИмяРеквизитаЦены = "Цена";
		КонецЕсли;
		СтруктураПолейТЧ.Вставить(ИмяРеквизитаЦены, 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажи") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПродажиНазначенную") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПоВидуЦен") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена", 0);
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуЗакупки") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьЦенуПрошлойЗакупки") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("ЦенаПрошлойЗакупки", 0);
	КонецЕсли;

	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДС") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДС") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"    , 0);
		СтруктураПолейТЧ.Вставить("СтавкаНДС", 0);
		СтруктураПолейТЧ.Вставить("СуммаНДС" , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуНДСПоСуммеСНДС") Тогда
		СтруктураПолейТЧ.Вставить("СуммаВсего", 0);
		СтруктураПолейТЧ.Вставить("СтавкаНДС" , 0);
		СтруктураПолейТЧ.Вставить("СуммаНДС"  , 0);
		СтруктураПолейТЧ.Вставить("СуммаСНДС" , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСНДС") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"    , 0);
		СтруктураПолейТЧ.Вставить("СуммаНДС" , 0);
		СтруктураПолейТЧ.Вставить("СуммаСНДС", 0);
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПересчитатьСумму") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"             , 0);
		СтруктураПолейТЧ.Вставить("Цена"              , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомРучнойСкидки") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"              , 0);
		СтруктураПолейТЧ.Вставить("Количество"         , 0);
		СтруктураПолейТЧ.Вставить("Цена      "         , 0);
		СтруктураПолейТЧ.Вставить("СуммаРучнойСкидки"  , 0);
		СтруктураПолейТЧ.Вставить("ПроцентРучнойСкидки", 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуСУчетомАвтоматическойСкидки") Тогда
		СтруктураПолейТЧ.Вставить("Сумма"                      , 0);
		СтруктураПолейТЧ.Вставить("СуммаАвтоматическойСкидки"  , 0);
		СтруктураПолейТЧ.Вставить("ПроцентАвтоматическойСкидки", 0);
	КонецЕсли;
	
	ИмяКоличества = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуФакт", ИмяКоличества) Тогда
		             	
		Если Не ЗначениеЗаполнено(ИмяКоличества) Тогда
			ИмяКоличества = "Факт";
		КонецЕсли;
				
		СтруктураПолейТЧ.Вставить("СуммаФакт"                         , 0);
		СтруктураПолейТЧ.Вставить("Цена"                              , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок" + ИмяКоличества, 0);
				
	КонецЕсли;
    	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуВозвратСУчетомОснования") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Коэффициент"         , 1);
		СтруктураПолейТЧ.Вставить("ПроцентСкидкиНаценки", 1);
		СтруктураПолейТЧ.Вставить("Сумма"               , 0);
		СтруктураПолейТЧ.Вставить("Цена"                , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок"  , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуЗаУпаковку") Тогда
		СтруктураПолейТЧ.Вставить("Цена"      , 0);
		СтруктураПолейТЧ.Вставить("Количество", 0);
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВПродажах") Тогда
		СтруктураПолейТЧ.Вставить("Цена"                       , 0);
		СтруктураПолейТЧ.Вставить("Сумма"                      , 0);
		СтруктураПолейТЧ.Вставить("СуммаАвтоматическойСкидки"  , 0);
		СтруктураПолейТЧ.Вставить("ПроцентАвтоматическойСкидки", 0);
		СтруктураПолейТЧ.Вставить("СуммаРучнойСкидки"          , 0);
		СтруктураПолейТЧ.Вставить("ПроцентРучнойСкидки"        , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок "        , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуСкидкуПоСуммеВЗакупках") Тогда
		СтруктураПолейТЧ.Вставить("Цена"                       , 0);
		СтруктураПолейТЧ.Вставить("Сумма"                      , 0);
		СтруктураПолейТЧ.Вставить("СуммаРучнойСкидки"          , 0);
		СтруктураПолейТЧ.Вставить("ПроцентРучнойСкидки"        , 0);
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок "        , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковок", ИмяКоличества) Тогда
		
		СтруктураПолейТЧ.Вставить("Упаковка");
		Если ЗначениеЗаполнено(ИмяКоличества) Тогда
			СтруктураПолейТЧ.Вставить("КоличествоУпаковок" + ИмяКоличества, 0);
			СтруктураПолейТЧ.Вставить("Количество" + ИмяКоличества, 0);
		Иначе
			СтруктураПолейТЧ.Вставить("КоличествоУпаковок", 0);
			СтруктураПолейТЧ.Вставить("Количество" , 0);
		КонецЕсли;	
		
	КонецЕсли;

	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницПлан") Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковокПлан", 0);
		СтруктураПолейТЧ.Вставить("КоличествоПлан"        , 0);
	КонецЕсли;
	
	ИмяФакта = Неопределено;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоЕдиницФакт",ИмяФакта) Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок"+ИмяФакта, 0);
		СтруктураПолейТЧ.Вставить("Количество"+ИмяФакта    , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ОчиститьКоличествоУчет") Тогда
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("Количество");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьКоличествоУпаковокФакт",ИмяФакта) Тогда
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок"+ИмяФакта, 0);
		СтруктураПолейТЧ.Вставить("Количество"+ИмяФакта    , 0);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьРасхождения") Тогда
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковокВДокументе");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковокРасхождения");
		СтруктураПолейТЧ.Вставить("ЕстьРасхождения");
		СтруктураПолейТЧ.Вставить("ВариантУчетаРасхождения");
	КонецЕсли; 
	
	Если СтруктураДействий.Свойство("ЗаполнитьРеквизитыПоНоменклатуре") Тогда
		
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("ЭтоУслуга");
		СтруктураПолейТЧ.Вставить("ЭтоПодарочныйСертификат");

	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьТипНоменклатуры") Тогда
		СтруктураПолейТЧ.Вставить("ТипНоменклатуры");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;

	Если СтруктураДействий.Свойство("ЗаполнитьДоговорПлатежногоАгента") Тогда
		СтруктураПолейТЧ.Вставить("ДоговорПлатежногоАгента");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;

	Если СтруктураДействий.Свойство("ЗаполнитьПредставлениеТабло") Тогда
		СтруктураПолейТЧ.Вставить("ПредставлениеТабло");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьФлагРезервирования") Тогда
		СтруктураПолейТЧ.Вставить("ТипНоменклатуры");
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Резервировать");
	КонецЕсли;

	Если СтруктураДействий.Свойство("ЗаполнитьСкладПродажи") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Склад");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьОрганизациюПродажи") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Склад");
		СтруктураПолейТЧ.Вставить("Организация");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВСтроке") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Склад");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьСтавкуНДССкладВШапке") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроставитьПродавца") Тогда
		СтруктураПолейТЧ.Вставить("Продавец");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьДанныеПоДокументуПродажи") Тогда
		СтруктураПолейТЧ.Вставить("Номенклатура");
		СтруктураПолейТЧ.Вставить("Характеристика");
		СтруктураПолейТЧ.Вставить("ДокументПродажи");
		СтруктураПолейТЧ.Вставить("ЧекККМ");
		СтруктураПолейТЧ.Вставить("Продавец");
		СтруктураПолейТЧ.Вставить("Упаковка");
		СтруктураПолейТЧ.Вставить("Цена");
		СтруктураПолейТЧ.Вставить("Сумма");
		СтруктураПолейТЧ.Вставить("СтавкаНДС");
		СтруктураПолейТЧ.Вставить("Количество");
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьЦенуПоСуммеВЗакупках") Тогда
		СтруктураПолейТЧ.Вставить("КоличествоУпаковок");
		СтруктураПолейТЧ.Вставить("Цена");
		СтруктураПолейТЧ.Вставить("СуммаВсего");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПересчитатьСуммуПоСуммеСНДС") Тогда
		СтруктураПолейТЧ.Вставить("Сумма");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьАссортиментСтроки") Тогда
		СтруктураПолейТЧ.Вставить("НомерСтроки");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ПроверитьЗапретРозничнойПродажи") Тогда
		СтруктураПолейТЧ.Вставить("НомерСтроки");
		СтруктураПолейТЧ.Вставить("Номенклатура");
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ОчиститьДанныеПоЗаказу") Тогда
		СтруктураПолейТЧ.Вставить("КодСтроки");
		СтруктураПолейТЧ.Вставить("ЗаказПокупателя");
	КонецЕсли;
	
	Возврат СтруктураПолейТЧ;

КонецФункции

// Функция данных текущей строки по структуре полей.
//
Функция ПолучитьДанныеТекущейСтроки(ТекущаяСтрока, СтруктураПолейТЧ)

	ДанныеТекущейСтроки = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеТекущейСтроки, СтруктураПолейТЧ);
	ЗаполнитьЗначенияСвойств(ДанныеТекущейСтроки, ТекущаяСтрока);

	Возврат ДанныеТекущейСтроки;

КонецФункции

// Функция получения коэффициента упаковки.
//
Функция ПолучитьКоэффициентУпаковкиКлиент(ТекУпаковка, КэшированныеЗначения)

	Если ЗначениеЗаполнено(ТекУпаковка) Тогда
		ТекКоэффициент = КэшированныеЗначения.КоэффициентыУпаковок[ТекУпаковка];
	Иначе
		ТекКоэффициент = 1;
	КонецЕсли;

	Возврат ТекКоэффициент;

КонецФункции

// Функция получения объема упаковки.
//
Функция ПолучитьОбъемУпаковкиКлиент(ТекУпаковка, КэшированныеЗначения)

	Если ЗначениеЗаполнено(ТекУпаковка) Тогда
		ТекОбъем = КэшированныеЗначения.ОбъемУпаковок[ТекУпаковка];
	Иначе
		ТекОбъем = 0;
	КонецЕсли;

	Возврат ТекОбъем;

КонецФункции

// Функция получения веса упаковки.
//
Функция ПолучитьВесУпаковкиКлиент(ТекУпаковка, КэшированныеЗначения)

	Если ЗначениеЗаполнено(ТекУпаковка) Тогда
		ТекВес = КэшированныеЗначения.ВесУпаковок[ТекУпаковка];
	Иначе
		ТекВес = 0;
	КонецЕсли;

	Возврат ТекВес;

КонецФункции

// Функция получения процента НДС.
//
Функция ПолучитьПроцентНДСКлиент(ТекСтавкаНДС, КэшированныеЗначения)

	Если ЗначениеЗаполнено(ТекСтавкаНДС) Тогда
		Результат = КэшированныеЗначения.ПроцентыСтавокНДС[ТекСтавкаНДС];
	Иначе
		Результат = 0;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция получения суммы документа без подарочных сертификатов.
Функция ПолучитьСуммуДокументаБезПодарочныхСертификатов(Объект, ИмяТЧ = "Товары") Экспорт
	
	СуммаДокументаБезПодарочныхСертификатов = Объект[ИмяТЧ].Итог("Сумма");
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.сабТипыНоменклатуры.ПодарочныйСертификат"));
	
	СтрокиПодарочныхСертификатов = Объект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
	Для каждого СтрокаПодарочногоСертификата Из СтрокиПодарочныхСертификатов Цикл
	
		СуммаДокументаБезПодарочныхСертификатов = СуммаДокументаБезПодарочныхСертификатов - СтрокаПодарочногоСертификата.Сумма;
	
	КонецЦикла;
	
	Возврат СуммаДокументаБезПодарочныхСертификатов;
	
КонецФункции

// Проверяет полноту заполненности данных строки Постпуления товаров
//
Процедура ПроверитьНезаполненностьСтрокиПоступленияТоваровЕГАИС(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	Если СтруктураДействий.Свойство("ПроверитьНезаполненностьСтрокиПоступленияТоваровЕГАИС") Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			Если ТекущаяСтрока.ХарактеристикиИспользуются Тогда
				Если ЗначениеЗаполнено(ТекущаяСтрока.Характеристика)  Тогда
					ТекущаяСтрока.ЕстьОшибкиВЗаполненииСтроки = Ложь;
				Иначе
					ТекущаяСтрока.ЕстьОшибкиВЗаполненииСтроки = Истина;
				КонецЕсли;
			Иначе
				ТекущаяСтрока.ЕстьОшибкиВЗаполненииСтроки = Ложь;
			КонецЕсли;
		Иначе
			ТекущаяСтрока.ЕстьОшибкиВЗаполненииСтроки = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНеобходимостьВводаАкцизнойМарки(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	
	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаАкцизнойМарки") Тогда
		ТекущаяСтрока.НеобходимостьВводаАкцизнойМарки = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНеобходимостьВводаСправкиНаАлкоголь(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	
	Если СтруктураДействий.Свойство("ПроверитьНеобходимостьВводаСправкиНаАлкоголь") Тогда
		ТекущаяСтрока.НеобходимостьВводаСправкиНаАлкоголь = Ложь;
	КонецЕсли;

КонецПроцедуры

// Процедура заполнение реквизитов КиЗ
Процедура ЗаполнитьКиЗВСтрокеКлиент(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Перем СтруктураПараметровДействия;
	
	Если СтруктураДействий.Свойство("ЗаполнитьКиЗВСтроке", СтруктураПараметровДействия) Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "НоменклатураКиЗ") Тогда
			ТекущаяСтрока.НоменклатураКиЗ   = СтруктураПараметровДействия.НоменклатураКиЗ;
			ТекущаяСтрока.ХарактеристикаКиЗ = СтруктураПараметровДействия.ХарактеристикаКиЗ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
