
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ВидПеремещения", "Перемещение");
	ТекФорма = ПолучитьФорму("Документ.УЧ_ПеремещениеТоваров.Форма.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ТекФорма.АвтоЗаголовок = Ложь;
	ТекФорма.Заголовок = "Перемещения внутри обособленного подразделения";
	ТекФорма.Открыть();
	
КонецПроцедуры
