
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписБУ = Новый Массив;
	СписБУ.Добавить("РеализацияТоваровУслуг");
	СписБУ.Добавить("ПоступлениеТоваровУслуг");
	СписБУ.Добавить("СписаниеТоваров");
	СписБУ.Добавить("ПередачаТоваров");
	СписБУ.Добавить("ПередачаМатериаловВЭксплуатацию");
	СписБУ.Добавить("ТребованиеНакладная");
	СписБУ.Добавить("ПеремещениеТоваров");
	СписБУ.Добавить("СписаниеСРасчетногоСчета");
	СписБУ.Добавить("ПоступлениеНаРасчетныйСчет");
	СписБУ.Добавить("ПриходныйКассовыйОрдер");
	СписБУ.Добавить("РасходныйКассовыйОрдер");
	СписБУ.Добавить("ОтчетПроизводстваЗаСмену");
	СписБУ.Добавить("ОтчетОРозничныхПродажах");
	СписБУ.Добавить("АвансовыйОтчет");
	СписБУ.Добавить("ВозвратТоваровПоставщику");
	СписБУ.Добавить("ВозвратТоваровОтПокупателя");
	СписБУ.Добавить("КорректировкаПоступления");
	СписБУ.Добавить("ОприходованиеТоваров");
	СписБУ.Добавить("УЧ_ПоступлениеТоваров");
	СписБУ.Добавить("УЧ_Реализация");
	СписБУ.Добавить("УЧ_СписаниеТоваров");
	СписБУ.Добавить("УЧ_ДвижениеДС");
	
	Элементы.Наименование.СписокВыбора.ЗагрузитьЗначения(СписБУ);
	Элементы.Наименование.СписокВыбора.СортироватьПоЗначению();
	Элементы.Наименование.РежимВыбораИзСписка = Истина;
	
КонецПроцедуры
