
&НаКлиенте
// Обработчик события нажатия на кнопку "Очистить" формы
//
Процедура ОчиститьКлассификаторВыполнить()
	
	ОткрытьФормуМодально("РегистрСведений.АдресныйКлассификатор.Форма.ФормаОчисткиАдресногоКлассификатора");
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
// Обработчик события нажатия на кнопку "Проверить обновление" формы
//
Процедура ПроверитьОбновление()
	
	Результат = АдресныйКлассификаторКлиент.ПроверитьОбновлениеАдресныхОбъектов();
	
	Если Не Результат.Статус Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение.Количество() <> 0 Тогда
		
		КоличествоОбновлений = 0;
		
		СписокСтрока = "";
		
		АдресныеОбъекты = Новый Массив;
		
		ПараметрыЗагрузки = Новый Структура;
		ПараметрыЗагрузки.Вставить("ИсточникЗагрузки", "ВебСервер");
		
		Для Каждого АО Из Результат.Значение Цикл
			//Если АО.ОбновлениеДоступно Тогда
				КоличествоОбновлений = КоличествоОбновлений + 1;
				АдресныеОбъекты.Добавить(Лев(АО.КодАдресногоОбъекта, 2));
				СписокСтрока = СписокСтрока + Лев(АО.КодАдресногоОбъекта, 2)
				                            + " - " + АО.Наименование
				                            + " "   + АО.Сокращение + Символы.ПС;
			//КонецЕсли;
		КонецЦикла;
		
		Если КоличествоОбновлений > 0 Тогда
			ТекстВопроса = НСтр("ru = 'На сервере присутствуют обновления для следующих адресных объектов:'")
			             + Символы.ПС
			             + СписокСтрока
			             + НСтр("ru = 'Приступить к обновлению адресного классификатора?'");
			Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, "Обновление адресного классификатора");
			
			Если Результат = КодВозвратаДиалога.Да Тогда
				
				ИнформацияОЗагрузке = Новый Структура;
				ИнформацияОЗагрузке.Вставить("СписокАдресныхОбъектов", АдресныеОбъекты);
				ИнформацияОЗагрузке.Вставить("СпособЗагрузки", ПараметрыЗагрузки);
				
				ОткрытьФорму("РегистрСведений.АдресныйКлассификатор.Форма.ФормаЗагрузки", ИнформацияОЗагрузке);
			КонецЕсли;
		Иначе
			Предупреждение(НСтр("ru = 'Обновление не требуется. Информационная база содержит актуальные адресные сведения.'"), , НСтр("ru = 'Адресный классификатор'"));
		КонецЕсли;
	Иначе
		Предупреждение(НСтр("ru = 'Обновление не требуется. Информационная база содержит актуальные адресные сведения.'"), , НСтр("ru = 'Адресный классификатор'"));
	КонецЕсли;
	
КонецПроцедуры
