
&НаКлиенте
Процедура Авторизация(Команда)
	АвторизацияНаСервере();
КонецПроцедуры

Процедура АвторизацияНаСервере()
	
	// Тип ответа сервера. Согласно документации, для установленных приложений = code
	ПараметрыАут		= "response_type=code" + "&"; 
	
	// Параменты полученные при регистрации приложения
	ПараметрыАут			= ПараметрыАут + "client_id=" + client_id + "&";
	ПараметрыАут			= ПараметрыАут + "redirect_uri=urn:ietf:wg:oauth:2.0:oob" + "&";
	
	// Области доступа к которым будет выполняться запрос
	ПараметрыАут			= ПараметрыАут + "scope=https://www.googleapis.com/auth/drive";
	// Если областей несколько, их нужно перечислить с использованием знака +
	// Например:
	//Параметры			= Параметры + "+" + "https://www.googleapis.com/auth/userinfo.email";
	//Параметры			= Параметры + "+" + "https://www.googleapis.com/auth/userinfo.profile";
	
	// адрес на котором пользователь выполнит авторизацию
	АдресАвторизации	= "https://accounts.google.com/o/oauth2/auth" + "?";
	
	// Формируем полный адрес авторизации вместе с параметрами
	ПолныйАдресАвторизации	= АдресАвторизации + ПараметрыАут;
	
	
	
	//ХТТПЗапрос = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	//ХТТПЗапрос.Open("POST", "https://accounts.google.com/o/oauth2/token", 0);
	//ХТТПЗапрос.setRequestHeader("Content-Type","application/x-www-form-urlencoded");
	//ПараметрыПОСТ = "grant_type=password&client_id=" + client_id + "&client_secret=" + client_secret + "&username=diz1872@gmail.com&password=nj4bs9em&scope=https://www.googleapis.com/auth/drive";
	//ХТТПЗапрос.Send(ПараметрыПОСТ);
	//ТекстОтвета	= ХТТПЗапрос.ResponseText();
	
	// И показываем страницу пользователю
	//Элементы.Браузер.Перейти(ПолныйАдресАвторизации);
	
	HTMLСтраница = ПолныйАдресАвторизации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьToken(Команда)
	ЗаголовокОкна = Элементы.HTMLСтраница.Документ.nameProp;	
	
	// Анализируем его, ищем код доступа, выделяем из строки
	Если Лев(ЗаголовокОкна, 13) = "Success code=" Тогда
		КодДоступа	= Сред(ЗаголовокОкна, 14);
		
		ОтключитьОбработчикОжидания("ОбработкаОповещенияИзменения");		
		
		// и передаем на второй этап
		ПолучитьТокенСервер(КодДоступа);
	КонецЕсли;
КонецПроцедуры

Процедура ПолучитьТокенСервер(КодДоступа)

		ХТТПЗапрос = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	// Выполняем отключение контроля сертификтов
	Скрипт=Новый COMОбъект("MSScriptControl.ScriptControl");
	Скрипт.language="javascript";
	Скрипт.AddObject("ХТТПЗапрос",ХТТПЗапрос);
	Скрипт.Eval("ХТТПЗапрос.Option(4)=13056");
	
	
	// открываем ресурс
	ХТТПЗапрос.Open("POST", "https://accounts.google.com/o/oauth2/token", 0);
	
	ХТТПЗапрос.setRequestHeader("Content-Type","application/x-www-form-urlencoded");
	
	// формируем дополнительные параметры
	ПараметрыПОСТ = 				"grant_type=authorization_code" + "&";	// предопределенный в документации
	ПараметрыПОСТ = ПараметрыПОСТ + "code=" + КодДоступа + "&";				// получен на первом этапе доступа
	// получены при регистрации приложения
	ПараметрыПОСТ = ПараметрыПОСТ + "client_id=" + client_id + "&";
	ПараметрыПОСТ = ПараметрыПОСТ + "client_secret="+ client_secret + "&";
	ПараметрыПОСТ = ПараметрыПОСТ + "redirect_uri=urn:ietf:wg:oauth:2.0:oob";
	// Отправляем для обработки сервером
	ХТТПЗапрос.Send(ПараметрыПОСТ); 
	
	//Текст = Новый ЗаписьТекста("C:\GapiResp.txt", КодировкаТекста.UTF8); 
	//Текст.ЗаписатьСтроку(ХТТПЗапрос.ResponseText()); 
	//Текст.Закрыть();		
	
	ТекстОтвета	= ХТТПЗапрос.ResponseText();
	
	Результат = ТекстОтвета; 
	
	// Разбор файла
	//ФайлОтвета	= Новый ТекстовыйДокумент; 
	//ФайлОтвета.Прочитать("C:\GapiResp.txt", КодировкаТекста.UTF8);
	//ТекстОтвета = ФайлОтвета.ПолучитьТекст();
	Ответ		= РаботаСGDrive.UnJSON(ТекстОтвета);
	access_token		= Ответ.Получить("access_token");
	refresh_token		= Ответ.Получить("refresh_token");
	expires_in		= Ответ.Получить("expires_in");
	token_type		= Ответ.Получить("token_type");


КонецПроцедуры


&НаКлиенте
Процедура СохранитьПараметры(Команда)
	СохранитьПараметрыСервер();
КонецПроцедуры

Процедура СохранитьПараметрыСервер()
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("client_id", client_id);
	СтруктураПараметров.Вставить("client_secret", client_secret);
	СтруктураПараметров.Вставить("refresh_token", refresh_token);
	СтруктураПараметров.Вставить("access_token", access_token);
	СтруктураПараметров.Вставить("expires_in", expires_in);
	СтруктураПараметров.Вставить("folder_id", folder_id);
	
	Хран = Новый ХранилищеЗначения(СтруктураПараметров);;
	Константы.сабGDriveParameters.Установить(Хран);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Хран = Константы.сабGDriveParameters.Получить();
	СтруктураПараметров = Хран.Получить();
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Если СтруктураПараметров.Свойство("client_id") Тогда
			client_id = СтруктураПараметров.client_id;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("client_secret") Тогда
			client_secret = СтруктураПараметров.client_secret;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("refresh_token") Тогда
			refresh_token = СтруктураПараметров.refresh_token;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("access_token") Тогда
			access_token = СтруктураПараметров.access_token;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("expires_in") Тогда
			expires_in = СтруктураПараметров.expires_in;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("folder_id") Тогда
			folder_id = СтруктураПараметров.folder_id;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьToken(Команда)
	ОбновитьТокенНаСервере();
КонецПроцедуры

Процедура ОбновитьТокенНаСервере()

	ХТТПЗапрос = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	ХТТПЗапрос.Open("POST", "https://accounts.google.com/o/oauth2/token", 0);
	ХТТПЗапрос.setRequestHeader("Content-Type", "application/x-www-form-urlencoded");
	
	ПараметрыПОСТ =	"grant_type=refresh_token&client_id=" + client_id + "&client_secret=" + client_secret + "&refresh_token=" + refresh_token;	// предопределенный в документации
	ХТТПЗапрос.Send(ПараметрыПОСТ); 
	
	Результат	= ХТТПЗапрос.ResponseText();
	
	Ответ		= РаботаСGDrive.UnJSON(Результат);
	access_token		= Ответ.Получить("access_token");
	expires_in		= Ответ.Получить("expires_in");
	token_type		= Ответ.Получить("token_type");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СохранитьПараметрыСервер();
КонецПроцедуры





