
&НаКлиенте
Процедура КППНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.Очистить();
	
	СписокКПП = Новый СписокЗначений;
	
	СписокКПП.Добавить(КПППлательщика);
	КПППодразделения = БюджетныйНаСервере.ВернутьРеквизит(Подразделение, "КПП");
	КППОрганизации = БюджетныйНаСервере.ВернутьРеквизит(Организация, "КПП");
	
	Если ЗначениеЗаполнено(КПППодразделения) Тогда
		СписокКПП.Добавить(КПППодразделения, КПППодразделения + " (" + Подразделение + ")");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КППОрганизации) Тогда
		
		Если СписокКПП.НайтиПоЗначению(КППОрганизации) = Неопределено Тогда
			СписокКПП.Добавить(КППОрганизации, КППОрганизации + " (" + Организация + ")");
		КонецЕсли;
		
	КонецЕсли;
	
	ТекЗнач = Неопределено;
	
	Если ЗначениеЗаполнено(КПППлательщика) Тогда
		ТекЗнач = ВыбратьИзСписка(СписокКПП, Элемент, КПППлательщика);
	КонецЕсли;
	
	Если Не ТекЗнач = Неопределено Тогда
		КПППлательщика = ТекЗнач.Значение;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("ИНН, КПППлательщика, Наименование", ИНН, КПППлательщика, Наименование));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Подразделение = Параметры.Подразделение;
	КПППлательщика = Параметры.КПППлательщика;
	
	РеквизитыОрг = БюджетныйНаСервере.ВернутьРеквизиты(Организация, "ИНН, КПП, Наименование");
	Наименование = РеквизитыОрг.Наименование;
	ИНН = РеквизитыОрг.ИНН;
	
	Если НЕ ЗначениеЗаполнено(КПППлательщика) Тогда
		КПППлательщика = РеквизитыОрг.КПП;
	КонецЕсли;
	
	Если Параметры.Свойство("Доступность") Тогда
		ЭтаФорма.Доступность = 1 - Параметры.Доступность;
	КонецЕсли;
	
КонецПроцедуры
