
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТекФормаБП = ПолучитьФорму("Документ.УЧ_СписаниеТоваров.ФормаОбъекта");
	ДанныеФормы = ТекФормаБП.Объект;
	ЗаполнитьНаСервере(ДанныеФормы, ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
	ТекФормаБП.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ЭтотОбъект, ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, ,"Дата, Номер, Комментарий");
	ЭтотОбъект.ДокОснование = ДанныеЗаполнения.Ссылка;
	ЭтотОбъект.Склад = сабОперОбщегоНазначения.ПолучитьСкладПоДопСвойству(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад инвентаризаций (Склады)", Истина), ДанныеЗаполнения.Подразделение.Владелец);
	ЭтотОбъект.ВидДеятельности = ДанныеЗаполнения.Подразделение;
	ЭтотОбъект.Организация = ?(ЗначениеЗаполнено(ДанныеЗаполнения.Организация), ДанныеЗаполнения.Организация, ЭтотОбъект.ВидДеятельности.Организация);
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийСписания.СписаниеПодснятий;
	Для Каждого СтрокаТЧ Из ДанныеЗаполнения.Товары Цикл
		
		Если НЕ СтрокаТЧ.Номенклатура.АлкогольнаяПродукция Тогда //д1 только алко
			Продолжить;			
		КонецЕсли;
		
		Если СтрокаТЧ.КоличествоОтклонение < 0 Или (СтрокаТЧ.КоличествоОтклонение = 0 И СтрокаТЧ.СуммаОтклонение < 0)Тогда
			СтрокаТЧСписания = ЭтотОбъект.ТабличнаяЧасть.Добавить();
			СтрокаТЧСписания.Товар = СтрокаТЧ.Номенклатура;
			СтрокаТЧСписания.Количество = - СтрокаТЧ.КоличествоОтклонение;
			СтрокаТЧСписания.Сумма = - СтрокаТЧ.СуммаОтклонение;
			СтрокаТЧСписания.Цена = ?(СтрокаТЧ.КоличествоОтклонение = 0, 0, СтрокаТЧ.СуммаОтклонение/СтрокаТЧ.КоличествоОтклонение);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

