
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.Д_ШаблоныДоговоров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Д_ШаблоныДоговоров.Преамбула,
	|	Д_ШаблоныДоговоров.СодержаниеДоговора.(
	|		Номер,
	|		Текст,
	|		ТипРаздела
	|	),
	|	Д_ШаблоныДоговоров.СтороныДоговора.(
	|		Ссылка,
	|		НомерСтроки,
	|		Сторона
	|	),
	|	Д_ШаблоныДоговоров.ГородДоговора,
	|	Д_ШаблоныДоговоров.ШапкаДоговора
	|ИЗ
	|	Справочник.Д_ШаблоныДоговоров КАК Д_ШаблоныДоговоров
	|ГДЕ
	|	Д_ШаблоныДоговоров.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСодержаниеДоговораШапка = Макет.ПолучитьОбласть("СодержаниеДоговораШапка");
	ОбластьСодержаниеДоговораПункт = Макет.ПолучитьОбласть("СодержаниеДоговораПункт");
	ОбластьСодержаниеДоговораРаздел = Макет.ПолучитьОбласть("СодержаниеДоговораРаздел");
	ОбластьСтороныДоговораШапка  = Макет.ПолучитьОбласть("СтороныДоговораШапка");
	ОбластьСтороныДоговора = Макет.ПолучитьОбласть("СтороныДоговора");
	ОбластьГородДата = Макет.ПолучитьОбласть("ГородДата");
	ОбластьПреамбула = Макет.ПолучитьОбласть("Преамбула");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ОбластьГородДата.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьГородДата, Выборка.Уровень());
		
		ОбластьПреамбула.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПреамбула, Выборка.Уровень());
		
		
		ТабДок.Вывести(ОбластьСодержаниеДоговораШапка);
		ВыборкаСодержаниеДоговора = Выборка.СодержаниеДоговора.Выбрать();
		Пока ВыборкаСодержаниеДоговора.Следующий() Цикл
			Если ВыборкаСодержаниеДоговора.ТипРаздела = "Раздел" Тогда
				ОбластьСодержаниеДоговораРаздел.Параметры.Заполнить(ВыборкаСодержаниеДоговора);
				ТабДок.Вывести(ОбластьСодержаниеДоговораРаздел, ВыборкаСодержаниеДоговора.Уровень());
			Иначе
				ОбластьСодержаниеДоговораПункт.Параметры.Заполнить(ВыборкаСодержаниеДоговора);
				ТабДок.Вывести(ОбластьСодержаниеДоговораПункт, ВыборкаСодержаниеДоговора.Уровень());
			КонецЕсли;
		КонецЦикла;

		ТабДок.Вывести(ОбластьСтороныДоговораШапка);
		ВыборкаСтороныДоговора = Выборка.СтороныДоговора.Выбрать();
		Пока ВыборкаСтороныДоговора.Следующий() Цикл
			ОбластьСтороныДоговора.Параметры.Заполнить(ВыборкаСтороныДоговора);
			ТабДок.Вывести(ОбластьСтороныДоговора, ВыборкаСтороныДоговора.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
