
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТекущееПредприятие", Параметры.Предприятия);
	Если Параметры.Свойство("ТипИсточника") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТипИсточника", Параметры.ТипИсточника);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ТипИсточника", NULL);
	КонецЕсли;
		
	ОграниченныеИсточники = БюджетныйНаСервере.ПолучитьДоступныеИточники();
	//Если Параметры.Свойство("СамостоятельнаяОплата") Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("Источники", ОграниченныеИсточники.Ограничение И Параметры.СамостоятельнаяОплата);
	//Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Источники", ОграниченныеИсточники.Ограничение);
	//КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеИсточники",ОграниченныеИсточники.ДоступныеИсточники);
	//Список.Параметры.УстановитьЗначениеПараметра("ИсполнительОплаты", ?(Параметры.Свойство("ИсполнительОплаты"), Параметры.ИсполнительОплаты, NULL));
КонецПроцедуры
