
&НаКлиенте
Процедура СчетаВидОстаткаПриИзменении(Элемент)
	МассивНедоступных = Новый Массив;
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.ДебетСвернутыйСубконто1"));
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.ДебетРазвернутый"));
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.КредитРазвернутый"));
	МассивНедоступных.Добавить(ПредопределенноеЗначение("Перечисление.УЧ_ВидОстаткаПоСчету.КредитСвернутыйСубконто1"));
	
	Если МассивНедоступных.Найти(Элементы.Счета.ТекущиеДанные.ВидОстатка) = Неопределено Тогда
		Элементы.Счета.ТекущиеДанные.РасшифровкаСубконто1 = Ложь;	
	КонецЕсли;
КонецПроцедуры
