
&НаКлиенте
Процедура Проверить(Команда)
	
	ПроверитьВыделенные("Не проверен", "Проверен");
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроверку(Команда)
	
	ПроверитьВыделенные("Проверен", "Не проверен");
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВыделенные(СтатусПрежний, СтатусУстанавливаемый)
	
	Для Каждого ТекущийПроверяемыйЭлемент Из Элементы.Список.ВыделенныеСтроки Цикл
		НаборЗаписейРегистраСП = РегистрыСведений.СтатусыПроверкиАрхивируемыхФайлов.СоздатьНаборЗаписей();
		НаборЗаписейРегистраСП.Отбор.Владелец.Установить(ТекущийПроверяемыйЭлемент.Владелец);
		НаборЗаписейРегистраСП.Отбор.Файл.Установить(ТекущийПроверяемыйЭлемент.Файл);
		НаборЗаписейРегистраСП.Прочитать();
		
		Если НаборЗаписейРегистраСП.Количество() И НаборЗаписейРегистраСП[НаборЗаписейРегистраСП.Количество() - 1].СтатусПроверки = СтатусПрежний Тогда
			НоваяЗапись = НаборЗаписейРегистраСП.Добавить();
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.Владелец = ТекущийПроверяемыйЭлемент.Владелец;
			НоваяЗапись.Файл	= ТекущийПроверяемыйЭлемент.Файл;
			НоваяЗапись.СтатусПроверки = СтатусУстанавливаемый;
			
			НаборЗаписейРегистраСП.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "Файл" Тогда
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(Элемент.ТекущиеДанные.Файл, Неопределено, УникальныйИдентификатор);
		РаботаСФайламиКлиент.Открыть(ДанныеФайла);
	ИначеЕсли Поле.Имя = "Владелец" Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Владелец);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрепитьФайл(Команда)
	
	ТекстВопроса = НСтр("ru = 'Файлы по выделенным строкам будут откреплены от документов-владельцев и помечены на удаление. Выполнить?'");
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрепитьВыделенные();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОткрепитьВыделенные()
	
	Для Каждого ТекущийПроверяемыйЭлемент Из Элементы.Список.ВыделенныеСтроки Цикл
		НаборЗаписейРегистраСП = РегистрыСведений.СтатусыПроверкиАрхивируемыхФайлов.СоздатьНаборЗаписей();
		НаборЗаписейРегистраСП.Отбор.Владелец.Установить(ТекущийПроверяемыйЭлемент.Владелец);
		НаборЗаписейРегистраСП.Отбор.Файл.Установить(ТекущийПроверяемыйЭлемент.Файл);
		НаборЗаписейРегистраСП.Прочитать();
		
		Если НаборЗаписейРегистраСП.Количество() Тогда
			НаборЗаписейРегистраСП.Очистить();
			НаборЗаписейРегистраСП.Записать();
		КонецЕсли;
		
		ТекФайлОбъект = ТекущийПроверяемыйЭлемент.Файл.ПолучитьОбъект();
		ТекФайлОбъект.УстановитьПометкуУдаления(Истина, Истина);
		
	КонецЦикла;
	
КонецПроцедуры
