
&Вместо("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура УУ_ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ИдентификаторКоманды)
	Если ТипЗнч(ИдентификаторКоманды) = Тип("ПеречислениеСсылка.РегламентныеЗаданияРасширения")  Тогда
		
		Если ИдентификаторКоманды = Перечисления.РегламентныеЗаданияРасширения.ЗагрузкаВыписокИзКлиентБанка тогда
			
			РегламентныеЗаданияРасширения.ВыполнитьРегламентнуюЗадачуЗагрузкаВыписокИзКлиентБанка();
			
		ИначеЕсли ИдентификаторКоманды = Перечисления.РегламентныеЗаданияРасширения.РассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту тогда
			
			РегламентныеЗаданияРасширения.ВыполнитьРегламентнуюЗадачуРассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту();
			
		КонецЕсли;
		
	Иначе
		
		ПродолжитьВызов(ВнешняяОбработка, ИдентификаторКоманды);
		
	КонецЕсли;
КонецПроцедуры
