&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БюджетныйНаСервере.ДействияПриСозданииФормыСправочника(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//-lud 19/10/22 Вся проверка вынесена в модуль объекта, в процедуру Обработка заполнения
    //Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Если СтрНайти(Объект.Наименование, "##УжеСоздан") Тогда
	//		Предупреждение("На основании заявки уже было создано доп. соглашение " + Сред(Объект.Наименование, 12) + "!");
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Если СтрНайти(Объект.Наименование, "##НеПроведен") Тогда
	//		Предупреждение("Документ-основание не проведен!");
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	ОбновитьАвтоНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Пересчитать", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАвтоНаименование()
	//Наименование = "№" + Строка(Объект.Номер) + " от " + Формат(Объект.ДатаДоговора, "ДФ=dd.MM.yy") + " отсрочка " + Строка(Объект.Отсрочка) + " дн."; 
	//Если Элементы.Наименование.СписокВыбора.Количество() Тогда
	//	Элементы.Наименование.СписокВыбора[0].Значение = Наименование;
	//Иначе
	//	Элементы.Наименование.СписокВыбора.Добавить(Наименование);
	//КонецЕсли;
	
	РеквВладельца = БюджетныйНаСервере.ВернутьРеквизиты(Объект.Владелец, "Организация, Подразделение", Ложь);
	Доп = ?(ЗначениеЗаполнено(РеквВладельца.Организация), Строка(РеквВладельца.Организация), "") + ?(ЗначениеЗаполнено(РеквВладельца.Подразделение), ", " + Строка(РеквВладельца.Подразделение), "");
	Наименование = Строка("Доп. соглашение") + " №" + Объект.Код + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") + ?(ЗначениеЗаполнено(Доп), " (" + Доп + ")", "");  
	//Если НЕ Объект.стр_ТипДоговора = ПредопределенноеЗначение("Перечисление.стр_ТипыДоговора.Внутренний") Тогда
	//	Элементы.Наименование.Доступность = Ложь;	
	//	Объект.Наименование = Наименование;
	//Иначе
		Если Элементы.Наименование.СписокВыбора.Количество() Тогда
			Элементы.Наименование.СписокВыбора[0].Значение = Наименование;
		Иначе
			Элементы.Наименование.СписокВыбора.Добавить(Наименование);
		КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	ОбновитьАвтоНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьАвтоНаименование();
КонецПроцедуры
