
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Исполнитель = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ЭтоИсполнитель = (НЕ БПСервер.ПолучитьМассивПользователей().Найти(Объект.Исполнитель) = Неопределено);
	
	Элементы.Исполнитель.ТолькоПросмотр = ЭтоИсполнитель;
	
	Элементы.РезультатВыполнения.Видимость = ЭтоИсполнитель;
	Элементы.ОтправитьИЗакрыть.Видимость = НЕ ЭтоИсполнитель;
	Элементы.ОтправитьИЗакрыть.КнопкаПоУмолчанию = НЕ ЭтоИсполнитель;
	
	Элементы.ЗадачаЗадачаВзятьЗадачуВРаботу.Видимость = ЭтоИсполнитель;
	
	Если НЕ ЭтоИсполнитель Тогда
		Элементы.Группа2.ПодчиненныеЭлементы.ФормаВыполнитьИЗакрыть.Видимость = Ложь;
		Элементы.Группа2.ПодчиненныеЭлементы["ФормаДополнительные"].Видимость = Ложь;
	КонецЕсли;
	Элементы.Группа2.ПодчиненныеЭлементы["ФормаПечать"].Видимость = Ложь;
	Элементы.Группа2.ПодчиненныеЭлементы["ФормаДействияСЗБизнесПроцессами"].Видимость = Ложь;
	
	Если Объект.ВРаботе Тогда
		Элементы.ЗадачаЗадачаВзятьЗадачуВРаботу.Заголовок = "Отложить";
	Иначе
		Элементы.ЗадачаЗадачаВзятьЗадачуВРаботу.Заголовок = "Взять в работу";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьИЗакрыть(Команда)
	Записать();
	Оповестить("ОбновитьСписокЗадач");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытьФормуСправочники" Тогда
		Закрыть();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСписокЗадач");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры
