
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	ЗапретитьДелегированиеНаСервере(ПараметрКоманды); 
	ОповеститьОбИзменении(ПараметрКоманды);	
КонецПроцедуры

&НаСервере
Процедура ЗапретитьДелегированиеНаСервере(ПараметрКоманды)
	ТекОбъект = ПараметрКоманды.ПолучитьОбъект();
	ТекОбъект.НеДелегировать = 1 -ТекОбъект.НеДелегировать;
	ТекОбъект.Записать();
	Если ТекОбъект.НеДелегировать Тогда
		Сообщить("Делегирование для задачи №" + Строка(ПараметрКоманды.Номер) + " запрещено.");
	Иначе
		Сообщить("Делегирование для задачи №" + Строка(ПараметрКоманды.Номер) + " разрешено.");
	КонецЕсли;
КонецПроцедуры

