
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекЗадача = БПСервер.ПолучитьТекущуюТочкуМаршрута(ПараметрКоманды);
	Если БПСервер.ТочкиПроцессов("доработка").Найти(ТекЗадача) = Неопределено Тогда
		Сообщить("Разрешить редактирование документа возможно только на стадии доработки документа. Верните документ на доработку, затем разрешайте редактирование.");
		Возврат;	
	КонецЕсли;
	
	
	ПоказатьВопрос(Новый ОписаниеОповещения("РазрешитьРедактированиеЗавершение", ЭтотОбъект, Новый Структура("Документ", ПараметрКоманды) ), "Разрешение редактирования автоматически отменяет все согласования.
	|Вы уверены, что хотите редактировать?", РежимДиалогаВопрос.ДаНет); 

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да  Тогда
		ОтменитьСогласования(ДополнительныеПараметры);
		Оповестить("РазрешитьРедактированиеФормы", Новый Структура("РазрешитьРедактирвованиеДокумента", Истина));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтменитьСогласования(ДополнительныеПараметры)
	НачатьТранзакцию();
	
	ТекБПСсылка = БПСервер.НайтиТекущийБПСервер(ДополнительныеПараметры.Документ);
	
	Если ЗначениеЗаполнено(ТекБПСсылка) Тогда
		
		ТекБП = ТекБПСсылка.ПолучитьОбъект();
		
		Для каждого ТекСтрока Из ТекБП.ДопСогласование Цикл
			ТекСтрока.Пройден = 0;	
			ТекСтрока.Согласовано = 0;
		КонецЦикла;
		
		Для каждого ТекСтрока Из ТекБП.ДопИсполнение Цикл
			ТекСтрока.Пройдено = 0;	
			ТекСтрока.Исполнено = 0;
		КонецЦикла;
		
		ТекБП.ОснованиеЗаблокирован = Ложь;
		
		ТекБП.Записать();
		
		ТекЗаявка = ДополнительныеПараметры.Документ.ПолучитьОбъект();
		ТекЗаявка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;
	ЗафиксироватьТранзакцию();	
КонецПроцедуры
