
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураСообщенийПриемки") Тогда
		РезультатПриемки.ДобавитьСтроку("Документы отгрузки:");
		Для Каждого СтрокаСообщения Из Параметры.СтруктураСообщенийПриемки.ДокументОтгрузки Цикл
			РезультатПриемки.ДобавитьСтроку(СтрокаСообщения);
		КонецЦикла;
		РезультатПриемки.ДобавитьСтроку(""); 
		
		РезультатПриемки.ДобавитьСтроку("Документ ВетИС:");
		Для Каждого СтрокаСообщения Из Параметры.СтруктураСообщенийПриемки.Ветис Цикл
			РезультатПриемки.ДобавитьСтроку(СтрокаСообщения);
		КонецЦикла;
		РезультатПриемки.ДобавитьСтроку("");
		
		РезультатПриемки.ДобавитьСтроку("Документ ЭДО:");
		Для Каждого СтрокаСообщения Из Параметры.СтруктураСообщенийПриемки.ЭДО Цикл
			РезультатПриемки.ДобавитьСтроку(СтрокаСообщения);
		КонецЦикла; 
	Иначе 
		РезультатПриемки.ДобавитьСтроку("Ошибка формирования отчета");
	КонецЕсли;
		
КонецПроцедуры
