
&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Модифицированность() Тогда
		сабОбщегоНазначенияБУХ.УстановитьМодифицированностьБУДокумента(ЭтотОбъект, Ссылка, РежимЗаписи);	
	КонецЕсли;
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура УУ_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЭтоНовый() Тогда
		Если ОбменДанными.Загрузка И АвтообновленияЗаблокированы Тогда
			ЭтотОбъект.Прочитать();
			ОбменДанными.Загрузка = Истина;   
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
