
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Автор", ПараметрыСеанса.ДоступныеПользователи);
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	Если Параметры.Свойство("Исполнитель") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", Параметры.Исполнитель);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ФильтроватьПоПодчиненному" Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", Параметр.Исполнитель);
		Фильтр = Параметр.Исполнитель;
		Элементы.Группа2.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФильтр(Команда)
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", Неопределено);
	Элементы.Группа2.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВНовомОкне(Команда)
	ОткрытьФорму("Документ.БП_Поручение.Форма.ФормаСпискаОтМеняТекущих"); 
КонецПроцедуры
