
&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Сообщить("Не указан путь к файлу."); 	
	Иначе  	
		
		XLSОбъект = Новый COMОбъект("Excel.Application");
		XLSОбъект.Visible       = Ложь;
		XLSОбъект.DisplayAlerts = Ложь;
		
		Попытка
			Book = XLSОбъект.Workbooks.Open(ПутьКФайлу, , Истина);
		Исключение
			Сообщить ("Проблемы с подключением к Excel" );
		КонецПопытки;
		
		Лист = Book.Sheets(1);
		
		//Получааем количество строк в книге
		СтрокаОкончания = Лист.UsedRange.Rows.Count + 1;
		XLSОбъект.Application.Quit();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПутьКФайлу) ИЛИ Не ЗначениеЗаполнено(СтрокаНачала) Или НЕ ЗначениеЗаполнено(СтрокаОкончания) Тогда
		Сообщить("Не указан путь, либо параметры начала и окончания загрузки."); 	
	Иначе  		
			
		XLSОбъект = Новый COMОбъект("Excel.Application");
		XLSОбъект.Visible       = Ложь;
		XLSОбъект.DisplayAlerts = Ложь;
		
		Попытка
			Book = XLSОбъект.Workbooks.Open(ПутьКФайлу, , Истина);
		Исключение
			Сообщить ("Проблемы с подключением к Excel" );
		КонецПопытки;
		
		Лист = Book.Sheets(1);
				
		Область = Лист.Range(Лист.Cells(СтрокаНачала,1), Лист.Cells(СтрокаОкончания,10));	
		
		//получаем массив колонок
		Данные = Область.Value.Выгрузить();			
		ТЧ = ВладелецФормы;
		
		Для ТекСтрока = 0 по СтрокаОкончания - СтрокаНачала - 1 Цикл
			
			ДанныеЗагрузки = ПолучитьДанныеЗагрузки(СокрЛП(Данные[0][ТекСтрока]), СокрЛП(Данные[1][ТекСтрока]), СокрЛП(Данные[2][ТекСтрока]), СокрЛП(Данные[4][ТекСтрока]));
			
			Если Не ЗначениеЗаполнено(ДанныеЗагрузки.Номенклатура) Тогда
				Сообщить("Не удалось найти номенклатуру по следующим параметрам: артикул " + СокрЛП(Данные[0][ТекСтрока]) + ", код " + СокрЛП(Данные[1][ТекСтрока]) + ", наименование " + СокрЛП(Данные[2][ТекСтрока]) + ".");
				Продолжить;
			КонецЕсли;
			
			//добавляем запись в табличную часть					
			НоваяСтрокаЦен = ВладелецФормы.Объект.Товары.Добавить();
			НоваяСтрокаЦен.Номенклатура = ДанныеЗагрузки.Номенклатура;  
			НоваяСтрокаЦен.Цена = СокрЛП(Данные[3][ТекСтрока]);
			НоваяСтрокаЦен.Валюта = ДанныеЗагрузки.Валюта;
		КонецЦикла;
		
		XLSОбъект.Application.Quit();
		Сообщить("Завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗагрузки(НомАртикул, НомКод, НомНаименование, ВалютаНаименование)

	Валюта = Справочники.Валюты.НайтиПоНаименованию(ВалютаНаименование,Истина);
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	Номенклатура = Неопределено;
	
	Если ЗначениеЗаполнено(НомАртикул) Тогда
		Номенклатура = справочники.Номенклатура.НайтиПоРеквизиту("Артикул", НомАртикул);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура) И ЗначениеЗаполнено(НомКод) Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(НомКод);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Номенклатура) И ЗначениеЗаполнено(НомНаименование) Тогда
		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НомНаименование, Истина);
	КонецЕсли;
	
	Возврат Новый Структура("Валюта, Номенклатура", Валюта, Номенклатура);
	
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПутьКФайлу = БюджетныйНаКлиенте.ВыбратьФайлExcel();
	
КонецПроцедуры
