
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НовыйСрокВыполнения = Макс(СрокВыполнения, ДатаНачала);
	//ВРаботе = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИЗакрыть(Команда)
	Если НовыйСрокВыполнения < ТекущаяДата() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Новый срок выполнения не может быть меньше текущей даты";
		Сообщение.Поле = "НовыйСрокВыполнения";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	ИначеЕсли НовыйСрокВыполнения > СрокВыполнения И НЕ НеДелатьЗапросНаНовыйСрок Тогда
		Если Вопрос("Установить более поздний срок выполнения? При этом инициатор бизнес процесса будет оповещен.", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да  Тогда
			//ЗаписатьЗадачу();
			//Оповестить("ОбновитьСписокЗадач");
			ЭтаФорма.Закрыть();
			//Оповестить("ЗакрытьФормуСправочники");
			
			БПСервер.СоздатьОповещение(ТекАвтор, "Пользователь " + Строка(БюджетныйНаСервере.ПолучитьПользователя()) + " запрашивает установку нового срока выполнения по задаче """ + Строка(ТекЗадача) + """:
			|Старый срок: " + Строка(СрокВыполнения) + "
			|Новый срок: " + Строка(НовыйСрокВыполнения) + "
			|Причина: " + Строка(ПричинаОтсрочки) + "
			|
			|Принять новый срок по задаче?", "Запрос на изменение срока выполнения Справочники", Заявка, Истина, , ТекЗадача, Новый Структура("СтарыйСрокСправочники, НовыйСрокСправочники", СтарыйСрок, НовыйСрокВыполнения) );
			
			Предупреждение("Запрос на изменение срока успешно отправлен инициатору бизнес-процесса.");
		КонецЕсли;
	Иначе
		ЗаписатьЗадачу();
		Оповестить("ОбновитьСписокЗадач");
		ЭтаФорма.Закрыть();
		Оповестить("ЗакрытьФормуСправочники");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗадачу()
	
	//ТекОб.Вработе = Вработе;
	Если НеДелатьЗапросНаНовыйСрок Тогда
		ТекОб = ТекЗадача.ПолучитьОбъект();
		
		ТекОб.СрокВыполнения = НовыйСрокВыполнения;
		
		//перезаписываем срок задания
		Если ТипЗнч(ТекЗадача.Заявка) = Тип("ДокументСсылка.БП_Поручение") Тогда
			ТекПользователь = БюджетныйНаСервере.ПолучитьПользователя();
			ТекЗаданиеОбъект = ТекЗадача.Заявка.ПолучитьОбъект();
			Для каждого ТекСтрока Из ТекЗаданиеОбъект.СписокИсполнителей Цикл
				Если ТекСтрока.Исполнитель = ТекПользователь Тогда
					ТекСтрока.СрокИсполнения = НовыйСрокВыполнения;
				КонецЕсли;
			КонецЦикла;
			ТекЗаданиеОбъект.Записать();
		КонецЕсли;
		ТекОб.Записать();
		Сообщить(ТекОб.СрокВыполнения);
	КонецЕсли;
	
	
	//БПСервер.ВыполнитьЗадачу(ТекЗадача, , Истина, "Взял в работу.");	
	
КонецПроцедуры


&НаКлиенте
Процедура НовыйСрокВыполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДата = ОткрытьФормуМодально("ОбщаяФорма.ФормаВыбораДатыИВремени", Новый Структура("ЗаголовокФормы, ТекДата", "Выберите время", ?(СрокВыполнения > ТекущаяДата(), СрокВыполнения, ТекущаяДата() + 24*60*60))); 
	Если НЕ ТекДата = Неопределено Тогда
		НовыйСрокВыполнения = ТекДата;
		//ВРаботе = Истина;
		Дни = Окр((НовыйСрокВыполнения - СрокВыполнения) / (60 * 60 * 24), 0);
		Отсрочка = ?(Дни > 0, "+", "-") + Дни + " дн.";
		ПользовательРуководительАвтора = БПСервер.ПользовательПодчиненный(БюджетныйНаСервере.ПолучитьПользователя(), ТекАвтор);
		ИсполнительРуководительАвтора = БПСервер.ПользовательПодчиненный(ТекАвтор, БюджетныйНаСервере.ПолучитьПользователя());
		ПользовательАвтор = (НЕ БПСервер.ПолучитьМассивПользователей().Найти(ТекАвтор) = Неопределено);
		Если (НовыйСрокВыполнения > СрокВыполнения И ПользовательРуководительАвтора) ИЛИ ИсполнительРуководительАвтора Тогда
			Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = Истина;
			НеДелатьЗапросНаНовыйСрок = Истина;
		ИначеЕсли ПользовательАвтор Тогда //автору незачем
			Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = ложь;
			НеДелатьЗапросНаНовыйСрок = Истина;
		Иначе
			НеДелатьЗапросНаНовыйСрок = Ложь;
			Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = Истина;
		КонецЕсли;
		Если НовыйСрокВыполнения > СрокВыполнения Тогда
			Элементы.ПричинаОтсрочки.ТолькоПросмотр = Ложь;		
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекЗадача = Параметры.Ключ;
	ТекРеквизиты = БюджетныйНаСервере.ВернутьРеквизиты(ТекЗадача, "БизнесПроцесс, Заявка, СрокВыполнения, ВРаботе, Описание, ДатаНачала"); 
	БизнесПроцесс = ТекРеквизиты.БизнесПроцесс;
	Заявка = ТекРеквизиты.Заявка;
	Описание = ТекРеквизиты.Описание;
	Если Параметры.Свойство("ЭтоУстановкаСрока") Тогда
		ВРаботе = ТекРеквизиты.ВРаботе;
	Иначе
		ВРаботе = Истина;
	КонецЕсли;	
	СрокВыполнения = ТекРеквизиты.СрокВыполнения;
	ДатаНачала = ТекРеквизиты.ДатаНачала;
	
	Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
		ТекАвтор = БизнесПроцесс.Автор;
		ТекЗаявка = БизнесПроцесс;
	ИначеЕсли ЗначениеЗаполнено(Заявка) Тогда
		ТекАвтор = Заявка.Автор;
		ТекЗаявка = Заявка;
	Иначе
		ТекАвтор = ТекЗадача.Автор;
		ТекЗаявка = Заявка;
	КонецЕсли;
	
	НеДелатьЗапросНаНовыйСрок = Истина;
	Элементы.НеДелатьЗапросНаНовыйСрок.Доступность = Ложь;

КонецПроцедуры

