Функция ОпределитьКвартал(НомерМесяца)
	Если НомерМесяца / 3 <= 1 Тогда
		Возврат 1;
	ИначеЕсли НомерМесяца / 3 > 1 И НомерМесяца / 3 <= 2 Тогда 
		Возврат 2;
	ИначеЕсли  НомерМесяца / 3 > 2 И НомерМесяца / 3 <= 3 Тогда
		Возврат 3;
	ИначеЕсли НомерМесяца / 3 > 3 И НомерМесяца / 3 <= 4 Тогда
		Возврат 4;	
	КонецЕсли; 
КонецФункции // ()


Функция ДобавитьЗатратыНаПростой(ТЗ, Регистр1, Регистр2, ПланСчетов1, ПланСчетов2, ДатаНач,
	ДатаКон, СписокПредприятий, СчетчикМесяцев, КоэффициентОтступа, НачалоПериода, ВсегоПериодов, КлючПериод, ПараметрКоманды)
	Простой = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	-ЕСТЬNULL(ДанныеСценарий1.СуммаОборот, 0) КАК Сумма1,
	|	-ЕСТЬNULL(ДанныеСценарий2.СуммаОборот, 0) КАК Сумма2,
	|	ВЫБОР
	|		КОГДА " + КлючПериод + "(ДанныеСценарий1.Период) ЕСТЬ NULL 
	|			ТОГДА " + КлючПериод + "(ДанныеСценарий2.Период)
	|		ИНАЧЕ " + КлючПериод + "(ДанныеСценарий1.Период)
	|	КОНЕЦ КАК Период,
	|	ВЫБОР
	|		КОГДА ДанныеСценарий1.Субконто1 ЕСТЬ NULL 
	|			ТОГДА ДанныеСценарий2.Субконто1
	|		ИНАЧЕ ДанныеСценарий1.Субконто1
	|	КОНЕЦ КАК Статья,
	|	ВЫБОР
	|		КОГДА ДанныеСценарий1.Субконто1.Родитель ЕСТЬ NULL 
	|			ТОГДА ДанныеСценарий2.Субконто1.Родитель
	|		ИНАЧЕ ДанныеСценарий1.Субконто1.Родитель
	|	КОНЕЦ КАК Родитель1,
	|	ВЫБОР
	|		КОГДА ДанныеСценарий1.Предприятия ЕСТЬ NULL 
	|			ТОГДА ДанныеСценарий2.Предприятия
	|		ИНАЧЕ ДанныеСценарий1.Предприятия
	|	КОНЕЦ КАК Предприятия
	|ПОМЕСТИТЬ Затраты
	|ИЗ
	|	РегистрБухгалтерии." + Регистр1 + ".Обороты(
	|			&Дата1,
	|			&Дата2,
	|			" + КлючПериод + ",
	|			Счет = &Счет,
	|			,
	|			Предприятия В ИЕРАРХИИ (&Предприятия)
	|				И СценарийПлана = &Сценарий1,
	|			КорСчет В ИЕРАРХИИ (&КорСчет),
	|			) КАК ДанныеСценарий1
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии." + Регистр2 + ".Обороты(
	|				&Дата1,
	|				&Дата2,
	|				" + КлючПериод + ",
	|				Счет = &Счет2,
	|				,
	|				Предприятия В ИЕРАРХИИ (&Предприятия)
	|					И СценарийПлана = &Сценарий2,
	|				КорСчет В ИЕРАРХИИ (&КорСчет2),
	|				) КАК ДанныеСценарий2
	|		ПО ДанныеСценарий1.Субконто1 = ДанныеСценарий2.Субконто1
	|			И (" + КлючПериод + "(ДанныеСценарий1.Период) = " + КлючПериод + "(ДанныеСценарий2.Период))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатьиЗатрат.Ссылка КАК Статья,
	|	ЕСТЬNULL(Затраты.Сумма1, 0) КАК Сумма1,
	|	ЕСТЬNULL(Затраты.Сумма2, 0) КАК Сумма2,
	|	ЕСТЬNULL(Затраты.Период, 0) КАК Период,
	|	СтатьиЗатрат.ЭтоГруппа,
	|	Затраты.Предприятия
	|ИЗ
	|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Затраты КАК Затраты
	|		ПО (СтатьиЗатрат.Ссылка = Затраты.Статья
	|				ИЛИ СтатьиЗатрат.Ссылка = Затраты.Родитель1)
	|ГДЕ
	|	(НЕ СтатьиЗатрат.Ссылка В ИЕРАРХИИ (&ЗатратыРеализация))
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатьиЗатрат.Код";
	
	Запрос.УстановитьПараметр("Предприятия", СписокПредприятий);
	Запрос.УстановитьПараметр("Сценарий1", ПараметрКоманды.Сценарий1);
	Запрос.УстановитьПараметр("Сценарий2", ПараметрКоманды.Сценарий2);
	Запрос.УстановитьПараметр("Дата1", ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ДатаКон);
	Запрос.УстановитьПараметр("Счет", ПланСчетов1.ЗатратыНаПрво);
	Запрос.УстановитьПараметр("КорСчет", ПланСчетов1.ДоходыИРасходы);
	Запрос.УстановитьПараметр("Счет2", ПланСчетов2.ЗатратыНаПрво);
	Запрос.УстановитьПараметр("КорСчет2", ПланСчетов2.ДоходыИРасходы);
	Запрос.УстановитьПараметр("ЗатратыРеализация", Справочники.СтатьиЗатрат.ЗатратыРеализация);
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	
	Возврат Запрос.Выполнить();
	
КонецФункции


Процедура ЗаполнитьТаблицу(ТабДок, ПараметрКоманды) Экспорт
	
	//при выборе сценария факта в одном из полей Сценарий
	ПланСчетов1 = ?(ПараметрКоманды.Сценарий1 = Справочники.СценарииПланирования.Факт, ПланыСчетов.Учетный, ПланыСчетов.Учетный);
	ПланСчетов2 = ?(ПараметрКоманды.Сценарий2 = Справочники.СценарииПланирования.Факт, ПланыСчетов.Учетный, ПланыСчетов.Учетный);
	Регистр1 = ?(ПараметрКоманды.Сценарий1 = Справочники.СценарииПланирования.Факт, "Учетный", "Бюджетный");
	Регистр2 = ?(ПараметрКоманды.Сценарий2 = Справочники.СценарииПланирования.Факт, "Учетный", "Бюджетный");
	
	
	//определяем таблицу значений, в которую будем вносить все значения
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Шрифт"); //1) 1-обычный, 2 - жирный, 3 - курсив
	
	ТЗ.Колонки.Добавить("Порядок");//2) для структурирования дальнейшего вывода
	ТЗ.Колонки.Добавить("Признак");//3) для уникальности строки
	//порядок и признак выступают уникальным идентификтором строки
	
	ТЗ.Колонки.Добавить("Предприятие");//4) для обозначения разных предприятий
	
	ТЗ.Колонки.Добавить("Значение");//5)
	ТЗ.Колонки.Добавить("Резерв1");
	ТЗ.Колонки.Добавить("Резерв2");
	ТЗ.Колонки.Добавить("Резерв3");
	ТЗ.Колонки.Добавить("Резерв4");
	ТЗ.Колонки.Добавить("Резерв5");
	НаборИмен = ""; ИндексКолонки = 10;
	Для Кол = 1 По 100 Цикл // добавляем заранее все колонки в ТЗ с индекса 9
		ИмяКол = "Колонка" + строка(Кол);
		НаборИмен = НаборИмен + ИмяКол + ",";
		ТЗ.Колонки.Добавить(ИмяКол);
	КонецЦикла; 
	
	Попытка
	    ЭтотОбъект = ВнешниеОтчеты.Создать("Д_Себестоимость");	
	Исключение
		ЭтотОбъект = Отчеты.Д_Себестоимость;
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий1) и  НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2) Тогда
		Макет = ЭтотОбъект.ПолучитьМакет("МакетПланФакт");
	иначе
		Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	КонецЕсли; 
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка|СтолбецНачало");
	ОбластьШапкаСтолбцы = Макет.ПолучитьОбласть("Шапка|ДанныеСтолбца");
	ОбластьОбъем = Макет.ПолучитьОбласть("ШапкаОбъем|СтолбецНачало");
	//ОбластьОбъемСтолбцы = Макет.ПолучитьОбласть("ШапкаОбъем|ДанныеСтолбца");
	ОбластьКрасота = Макет.ПолучитьОбласть("Строка5|СтолбецНачало");
	ОбластьКрасотаСтолбцы = Макет.ПолучитьОбласть("Строка5|ДанныеСтолбца");
	
	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	
	
	Интервал = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, 1, 
	?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, 3, 12));
	
	КлючПериод = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, "Месяц", ?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, "Квартал", "Год"));
	
	НачалоПериода = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, Месяц(ПараметрКоманды.Период.ДатаНачала),?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, ОпределитьКвартал(Месяц(ПараметрКоманды.Период.ДатаНачала)), Год(ПараметрКоманды.Период.ДатаНачала)));
	
	КонецПериода = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, Месяц(ПараметрКоманды.Период.ДатаОкончания),?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, ОпределитьКвартал(Месяц(ПараметрКоманды.Период.ДатаОкончания)), Год(ПараметрКоманды.Период.ДатаОкончания)));
	
	
	ВсегоПериодов = КонецПериода - НачалоПериода + 1;
	
	СписокПредприятий = ПараметрКоманды.Предприятие;
	
	//Для каждого Т Из ПараметрКоманды.Предприятие Цикл
	//	Если Т.Пометка Тогда
	//		СписокПредприятий.Добавить(Т.Значение);
	//	КонецЕсли; 
	//КонецЦикла;
	
	
	//Предпр = Т.Значение;
	ДатаНач = ПараметрКоманды.Период.ДатаНачала;
	ДатаКон = ПараметрКоманды.Период.ДатаОкончания;
	СчетчикМесяцев = 0;
	КоэффициентОтступа = 0;
	
	Если ПустаяСтрока(ПараметрКоманды.Номенклатура) Тогда
		УсловиеКорНоменклатура = "КорСубконто1.ТипНоменклатуры = &ТипНоменклатуры";
		УсловиеНоменклатура = "Субконто1.ТипНоменклатуры = &ТипНоменклатуры";
	Иначе
		УсловиеКорНоменклатура = "КорСубконто1 В ИЕРАРХИИ (&Номенклатура)";
		УсловиеНоменклатура = "Субконто1 В ИЕРАРХИИ (&Номенклатура)";
	КонецЕсли;
	
	
	//считаем переменные затраты и НЗВ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.Материал КАК Материал,
	               |	Данные.Сумма1 + ЕСТЬNULL(НЗВ.СуммаНЗВ1, 0) КАК Сумма1,
	               |	Данные.Количество1 + ЕСТЬNULL(НЗВ.КоличествоНЗВ1, 0) КАК Количество1,
	               |	Данные.Сумма2 + ЕСТЬNULL(НЗВ.СуммаНЗВ2, 0) КАК Сумма2,
	               |	Данные.Количество2 + ЕСТЬNULL(НЗВ.КоличествоНЗВ2, 0) КАК Количество2,
	               |	Данные.Номенклатура КАК Номенклатура,
	               |	Данные.Период КАК Период,
	               |	Данные.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	Данные.Предприятия КАК Предприятия,
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА (НЕ Данные.Количество1 + ЕСТЬNULL(НЗВ.КоличествоНЗВ1, 0) = 0)
	               |				ТОГДА (Данные.Сумма1 + ЕСТЬNULL(НЗВ.СуммаНЗВ1, 0)) / (Данные.Количество1 + ЕСТЬNULL(НЗВ.КоличествоНЗВ1, 0))
	               |			ИНАЧЕ 0
	               |		КОНЕЦ, 0) КАК Цена1,
	               |	ЕСТЬNULL(ВЫБОР
	               |			КОГДА (НЕ Данные.Количество2 + ЕСТЬNULL(НЗВ.КоличествоНЗВ2, 0) = 0)
	               |				ТОГДА (Данные.Сумма2 + ЕСТЬNULL(НЗВ.СуммаНЗВ2, 0)) / (Данные.Количество2 + ЕСТЬNULL(НЗВ.КоличествоНЗВ2, 0))
	               |			ИНАЧЕ 0
	               |		КОНЕЦ, 0) КАК Цена2
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВЫБОР
	               |			КОГДА Сценарий1.Субконто1 ЕСТЬ NULL 
	               |				ТОГДА Сценарий2.Субконто1
	               |			ИНАЧЕ Сценарий1.Субконто1
	               |		КОНЕЦ КАК Материал,
	               |		-ЕСТЬNULL(Сценарий1.СуммаОборот, 0) КАК Сумма1,
	               |		-ЕСТЬNULL(Сценарий1.КоличествоОборот, 0) КАК Количество1,
	               |		-ЕСТЬNULL(Сценарий2.СуммаОборот, 0) КАК Сумма2,
	               |		-ЕСТЬNULL(Сценарий2.КоличествоОборот, 0) КАК Количество2,
	               |		ВЫБОР
	               |			КОГДА Сценарий1.КорСубконто1 ЕСТЬ NULL 
	               |				ТОГДА Сценарий2.КорСубконто1
	               |			ИНАЧЕ Сценарий1.КорСубконто1
	               |		КОНЕЦ КАК Номенклатура,
	               |		ВЫБОР
	               |			КОГДА Сценарий1.Предприятия ЕСТЬ NULL 
	               |				ТОГДА Сценарий2.Предприятия
	               |			ИНАЧЕ Сценарий1.Предприятия
	               |		КОНЕЦ КАК Предприятия,
	               |		ВЫБОР
	               |			КОГДА Сценарий1.КорСубконто2 ЕСТЬ NULL 
	               |				ТОГДА Сценарий2.КорСубконто2
	               |			ИНАЧЕ Сценарий1.КорСубконто2
	               |		КОНЕЦ КАК СтатьяЗатрат,
	               |		ВЫБОР
	               |			КОГДА " + КлючПериод + "(Сценарий1.Период) ЕСТЬ NULL 
	               |				ТОГДА " + КлючПериод + "(Сценарий2.Период)
	               |			ИНАЧЕ " + КлючПериод + "(Сценарий1.Период)
	               |		КОНЕЦ КАК Период
	               |	ИЗ
	               |		РегистрБухгалтерии." + Регистр1 + ".Обороты(
	               |				&Дата1,
	               |				&Дата2,
	               |				" + КлючПериод + ",
	               |				Счет В (&Счет),
	               |				,
	               |				СценарийПлана = &Сценарий1
	               |					И Предприятия В ИЕРАРХИИ (&Предприятия)
	               |					И КорСубконто2 В (&ОсновноеСырье)
	               |					И " + УсловиеКорНоменклатура + ",
	               |				КорСчет В (&КорСчет),
	               |				) КАК Сценарий1
	               |			ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии." + Регистр2 + ".Обороты(
	               |					&Дата1,
	               |					&Дата2,
	               |					" + КлючПериод + ",
	               |					Счет В (&Счет),
	               |					,
	               |					СценарийПлана = &Сценарий2
	               |						И Предприятия В ИЕРАРХИИ (&Предприятия)
	               |						И КорСубконто2 В (&ОсновноеСырье)
	               |						И " + УсловиеКорНоменклатура + ",
	               |					КорСчет В (&КорСчет),
	               |					) КАК Сценарий2
	               |			ПО Сценарий1.Субконто1 = Сценарий2.Субконто1
	               |				И (" + КлючПериод + "(Сценарий1.Период) = " + КлючПериод + "(Сценарий2.Период))
	               |				И Сценарий1.Предприятия = Сценарий2.Предприятия) КАК Данные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВЫБОР
	               |				КОГДА Сценарий1.Субконто1 ЕСТЬ NULL 
	               |					ТОГДА Сценарий2.Субконто1
	               |				ИНАЧЕ Сценарий1.Субконто1
	               |			КОНЕЦ КАК Номенклатура,
	               |			ВЫБОР
	               |				КОГДА Сценарий1.Субконто2 ЕСТЬ NULL 
	               |					ТОГДА Сценарий2.Субконто2
	               |				ИНАЧЕ Сценарий1.Субконто2
	               |			КОНЕЦ КАК Материал,
	               |			-ЕСТЬNULL(Сценарий1.СуммаОборот, 0) КАК СуммаНЗВ1,
	               |			-ЕСТЬNULL(Сценарий1.КоличествоОборот, 0) КАК КоличествоНЗВ1,
	               |			-ЕСТЬNULL(Сценарий2.СуммаОборот, 0) КАК СуммаНЗВ2,
	               |			-ЕСТЬNULL(Сценарий2.КоличествоОборот, 0) КАК КоличествоНЗВ2,
	               |			ВЫБОР
	               |				КОГДА Сценарий1.Предприятия ЕСТЬ NULL 
	               |					ТОГДА Сценарий2.Предприятия
	               |				ИНАЧЕ Сценарий1.Предприятия
	               |			КОНЕЦ КАК Предприятия,
	               |			ВЫБОР
	               |				КОГДА " + КлючПериод + "(Сценарий1.Период) ЕСТЬ NULL 
	               |					ТОГДА " + КлючПериод + "(Сценарий2.Период)
	               |				ИНАЧЕ " + КлючПериод + "(Сценарий1.Период)
	               |			КОНЕЦ КАК Период
	               |		ИЗ
	               |			РегистрБухгалтерии." + Регистр1 + ".Обороты(
	               |					&Дата1,
	               |					&Дата2,
	               |					" + КлючПериод + ",
	               |					Счет В (&НЗВ),
	               |					,
	               |					Предприятия В ИЕРАРХИИ (&Предприятия)
	               |						И СценарийПлана = &Сценарий1
	               |						И " + УсловиеКорНоменклатура + ",
	               |					,
	               |					) КАК Сценарий1
	               |				ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии." + Регистр2 + ".Обороты(
	               |						&Дата1,
	               |						&Дата2,
	               |						" + КлючПериод + ",
	               |						Счет В (&НЗВ),
	               |						,
	               |						Предприятия В ИЕРАРХИИ (&Предприятия)
	               |							И СценарийПлана = &Сценарий2
	               |							И " + УсловиеКорНоменклатура + ",
	               |						,
	               |						) КАК Сценарий2
	               |				ПО Сценарий1.Субконто1 = Сценарий2.Субконто1
	               |					И Сценарий1.Субконто2 = Сценарий2.Субконто2
	               |					И Сценарий1.Предприятия = Сценарий2.Предприятия
	               |					И (" + КлючПериод + "(Сценарий1.Период) = МЕСЯЦ(Сценарий2.Период))) КАК НЗВ
	               |		ПО Данные.Предприятия = НЗВ.Предприятия
	               |			И Данные.Номенклатура = НЗВ.Номенклатура
	               |			И Данные.Период = НЗВ.Период
	               |			И Данные.Материал = НЗВ.Материал";
	
	
	МассивОснЗатрат = Новый Массив;
	МассивОснЗатрат.Добавить(Справочники.СтатьиЗатрат.ЗатратыОсн);
	МассивОснЗатрат.Добавить(Справочники.СтатьиЗатрат.ЗатратыВсп);
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланСчетов1.ОсновноеСырье);
	МассивСчетов.Добавить(ПланСчетов1.ВспомСырье);
	
	Запрос.УстановитьПараметр("Предприятия", СписокПредприятий);
	Запрос.УстановитьПараметр("Сценарий1", ПараметрКоманды.Сценарий1);
	Запрос.УстановитьПараметр("Сценарий2", ПараметрКоманды.Сценарий2);
	Запрос.УстановитьПараметр("Дата1", ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ДатаКон);
	//ПланыСчетов.Учетный.ВспомСырье
	Запрос.УстановитьПараметр("Счет", МассивСчетов);
	Запрос.УстановитьПараметр("КорСчет", ПланСчетов1.ОсновноеПрво);
	Запрос.УстановитьПараметр("НЗВ", ПланСчетов1.НезавершенноеПроизводство);
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ОсновнаяПродукция);
	Запрос.УстановитьПараметр("ОсновноеСырье", МассивОснЗатрат);
	Запрос.УстановитьПараметр("ОтборНоменклатуры", 1 - ПустаяСтрока(ПараметрКоманды.Номенклатура));
	Запрос.УстановитьПараметр("Номенклатура", ПараметрКоманды.Номенклатура);
	
	РезультатСырье = Запрос.Выполнить();
	ВыборкаСырье = РезультатСырье.Выбрать();
	
	
	//запрос на производимые номенклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА Объем1.Субконто1 ЕСТЬ NULL 
	               |			ТОГДА Объем2.Субконто1
	               |		ИНАЧЕ Объем1.Субконто1
	               |	КОНЕЦ КАК Номенклатура,
	               |	ЕСТЬNULL(Объем1.КоличествоОборотДт, 0) КАК Объем1,
	               |	ЕСТЬNULL(Объем2.КоличествоОборот, 0) КАК Объем2,
	               |	ЕСТЬNULL(Объем2.КоличествоОборот, 0) - ЕСТЬNULL(Объем1.КоличествоОборот, 0) КАК Объем3,
	               |	ВЫБОР
	               |		КОГДА " + КлючПериод + "(Объем1.Период) ЕСТЬ NULL 
	               |			ТОГДА " + КлючПериод + "(Объем2.Период)
	               |		ИНАЧЕ " + КлючПериод + "(Объем1.Период)
	               |	КОНЕЦ КАК Период,
	               |	ВЫБОР
	               |		КОГДА Объем1.Предприятия ЕСТЬ NULL 
	               |			ТОГДА Объем2.Предприятия
	               |		ИНАЧЕ Объем1.Предприятия
	               |	КОНЕЦ КАК Предприятия
	               |ИЗ
	               |	РегистрБухгалтерии." + Регистр1 + ".Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			" + КлючПериод + ",
	               |			Счет = &Счет,
	               |			,
	               |			Предприятия В ИЕРАРХИИ (&Предприятия)
	               |				И СценарийПлана = &Сценарий1
	               |				И " + УсловиеНоменклатура + ",
	               |			КорСчет = &КорСчет,
	               |			) КАК Объем1
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии." + Регистр2 + ".Обороты(
	               |				&Дата1,
	               |				&Дата2,
	               |				" + КлючПериод + ",
	               |				Счет = &Счет2,
	               |				,
	               |				Предприятия В ИЕРАРХИИ (&Предприятия)
	               |					И СценарийПлана = &Сценарий2
	               |					И " + УсловиеНоменклатура + ",
	               |				КорСчет = &КорСчет2,
	               |				) КАК Объем2
	               |		ПО Объем1.Субконто1 = Объем2.Субконто1
	               |			И (" + КлючПериод + "(Объем1.Период) = " + КлючПериод + "(Объем2.Период))
	               |			И Объем1.Предприятия = Объем2.Предприятия
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Предприятия";
	
	Запрос.УстановитьПараметр("Предприятия", СписокПредприятий);
	Запрос.УстановитьПараметр("Сценарий1", ПараметрКоманды.Сценарий1);
	Запрос.УстановитьПараметр("Сценарий2", ПараметрКоманды.Сценарий2);
	Запрос.УстановитьПараметр("Дата1", ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ДатаКон);
	Запрос.УстановитьПараметр("Счет", ПланСчетов1.ГотоваяПродукция);
	Запрос.УстановитьПараметр("КорСчет", ПланСчетов1.ВыпускПродукции);
	Запрос.УстановитьПараметр("Счет2", ПланСчетов2.ГотоваяПродукция);
	Запрос.УстановитьПараметр("КорСчет2", ПланСчетов2.ВыпускПродукции);
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ОсновнаяПродукция);
	Запрос.УстановитьПараметр("ОтборНоменклатуры", 1 - ПустаяСтрока(ПараметрКоманды.Номенклатура));
	Запрос.УстановитьПараметр("Номенклатура", ПараметрКоманды.Номенклатура);
	
	РезультатОбъемы = Запрос.Выполнить();
	
	
	//запрос по сценарию1 на расчет себестоимости
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	-ЕСТЬNULL(ДанныеСценарий1.СуммаОборот, 0) КАК Сумма1,
	               |	-ЕСТЬNULL(ДанныеСценарий2.СуммаОборот, 0) КАК Сумма2,
	               |	ВЫБОР
	               |		КОГДА " + КлючПериод + "(ДанныеСценарий1.Период) ЕСТЬ NULL 
	               |			ТОГДА " + КлючПериод + "(ДанныеСценарий2.Период)
	               |		ИНАЧЕ " + КлючПериод + "(ДанныеСценарий1.Период)
	               |	КОНЕЦ КАК Период,
	               |	ВЫБОР
	               |		КОГДА ДанныеСценарий1.Субконто2 ЕСТЬ NULL 
	               |			ТОГДА ДанныеСценарий2.Субконто2
	               |		ИНАЧЕ ДанныеСценарий1.Субконто2
	               |	КОНЕЦ КАК Статья,
	               |	ВЫБОР
	               |		КОГДА ДанныеСценарий1.Субконто2.Родитель ЕСТЬ NULL 
	               |			ТОГДА ДанныеСценарий2.Субконто2.Родитель
	               |		ИНАЧЕ ДанныеСценарий1.Субконто2.Родитель
	               |	КОНЕЦ КАК Родитель1,
	               |	ВЫБОР
	               |		КОГДА ДанныеСценарий1.Субконто1 ЕСТЬ NULL 
	               |			ТОГДА ДанныеСценарий2.Субконто1
	               |		ИНАЧЕ ДанныеСценарий1.Субконто1
	               |	КОНЕЦ КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ДанныеСценарий1.Предприятия ЕСТЬ NULL 
	               |			ТОГДА ДанныеСценарий2.Предприятия
	               |		ИНАЧЕ ДанныеСценарий1.Предприятия
	               |	КОНЕЦ КАК Предприятия
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	РегистрБухгалтерии." + Регистр1 + ".Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			" + КлючПериод + ",
	               |			Счет = &Счет,
	               |			,
	               |			Предприятия В ИЕРАРХИИ (&Предприятия)
	               |				И СценарийПлана = &Сценарий1
	               |				И " + УсловиеНоменклатура + ",
	               |			КорСчет = &КорСчет,
	               |			) КАК ДанныеСценарий1
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии." + Регистр2 + ".Обороты(
	               |				&Дата1,
	               |				&Дата2,
	               |				" + КлючПериод + ",
	               |				Счет = &Счет2,
	               |				,
	               |				Предприятия В ИЕРАРХИИ (&Предприятия)
	               |					И СценарийПлана = &Сценарий2
	               |					И " + УсловиеНоменклатура + ",
	               |				КорСчет = &КорСчет2,
	               |				) КАК ДанныеСценарий2
	               |		ПО ДанныеСценарий1.Субконто2 = ДанныеСценарий2.Субконто2
	               |			И (" + КлючПериод + "(ДанныеСценарий1.Период) = " + КлючПериод + "(ДанныеСценарий2.Период))
	               |			И ДанныеСценарий1.Субконто1 = ДанныеСценарий2.Субконто1
	               |			И ДанныеСценарий1.Предприятия = ДанныеСценарий2.Предприятия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатьиЗатрат.Ссылка КАК Статья,
	               |	СтатьиЗатрат.ЭтоГруппа,
	               |	ЕСТЬNULL(Данные.Сумма1, 0) КАК Сумма1,
	               |	ЕСТЬNULL(Данные.Сумма2, 0) КАК Сумма2,
	               |	ЕСТЬNULL(Данные.Период, 0) КАК Период,
	               |	Данные.Номенклатура КАК Номенклатура,
	               |	Данные.Предприятия,
	               |	ВЫБОР
	               |		КОГДА СтатьиЗатрат.Ссылка В ИЕРАРХИИ (&ПрочиеРасходы)
	               |			ТОГДА ""ПрочиеЗатраты""
	               |		ИНАЧЕ ""ПроизводственныеЗатраты""
	               |	КОНЕЦ КАК ПризнакСтатьи
	               |ИЗ
	               |	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Данные КАК Данные
	               |		ПО (СтатьиЗатрат.Ссылка = Данные.Статья
	               |				ИЛИ СтатьиЗатрат.Ссылка = Данные.Родитель1)
	               |ГДЕ
	               |	(НЕ СтатьиЗатрат.Ссылка В ИЕРАРХИИ (&Ссылка))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СтатьиЗатрат.Код,
	               |	Номенклатура";
	
	
	ЛишниеГруппыСтатей = Новый Массив;
	ЛишниеГруппыСтатей.Добавить(Справочники.СтатьиЗатрат.ЗатратыРеализация);
	ЛишниеГруппыСтатей.Добавить(Справочники.СтатьиЗатрат.УслугиУКГруппа);
	
	Запрос.УстановитьПараметр("Предприятия", СписокПредприятий);
	Запрос.УстановитьПараметр("Сценарий1", ПараметрКоманды.Сценарий1);
	Запрос.УстановитьПараметр("Сценарий2", ПараметрКоманды.Сценарий2);
	Запрос.УстановитьПараметр("Дата1", ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ДатаКон);
	Запрос.УстановитьПараметр("Счет", ПланСчетов1.ОсновноеПрво);
	Запрос.УстановитьПараметр("КорСчет", ПланСчетов1.ВыпускПродукции);
	Запрос.УстановитьПараметр("Счет2", ПланСчетов2.ОсновноеПрво);
	Запрос.УстановитьПараметр("КорСчет2", ПланСчетов2.ВыпускПродукции);
	Запрос.УстановитьПараметр("Ссылка", ЛишниеГруппыСтатей);
	Запрос.УстановитьПараметр("ПрочиеРасходы", Справочники.СтатьиЗатрат.ПрочиеРасходы);
	Запрос.УстановитьПараметр("ОтборНоменклатуры", 1 - ПустаяСтрока(ПараметрКоманды.Номенклатура));
	Запрос.УстановитьПараметр("Номенклатура", ПараметрКоманды.Номенклатура);
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ОсновнаяПродукция);
	
	РезультатЗатраты = Запрос.Выполнить();
	//ВыборкаЗатраты = РезультатЗатраты.Выбрать();
	
	//считаем остатки готовой продукции на складе
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА БюджетныйОстаткиИОбороты.Субконто1 ЕСТЬ NULL 
	               |			ТОГДА БюджетныйОстаткиИОбороты1.Субконто1
	               |		ИНАЧЕ БюджетныйОстаткиИОбороты.Субконто1
	               |	КОНЕЦ КАК Номенклатура,
	               |	ЕСТЬNULL(БюджетныйОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК Сумма1,
	               |	ЕСТЬNULL(БюджетныйОстаткиИОбороты.КоличествоНачальныйОстаток, 0) КАК Количество1,
	               |	ЕСТЬNULL(БюджетныйОстаткиИОбороты1.СуммаНачальныйОстаток, 0) КАК Сумма2,
	               |	ЕСТЬNULL(БюджетныйОстаткиИОбороты1.КоличествоНачальныйОстаток, 0) КАК Количество2,
	               |	ВЫБОР
	               |		КОГДА БюджетныйОстаткиИОбороты.Предприятия ЕСТЬ NULL 
	               |			ТОГДА БюджетныйОстаткиИОбороты1.Предприятия
	               |		ИНАЧЕ БюджетныйОстаткиИОбороты.Предприятия
	               |	КОНЕЦ КАК Предприятия,
	               |	ВЫБОР
	               |		КОГДА " + КлючПериод + "(БюджетныйОстаткиИОбороты.Период) ЕСТЬ NULL 
	               |			ТОГДА " + КлючПериод + "(БюджетныйОстаткиИОбороты1.Период)
	               |		ИНАЧЕ " + КлючПериод + "(БюджетныйОстаткиИОбороты.Период)
	               |	КОНЕЦ КАК Период
	               |ИЗ
	               |	РегистрБухгалтерии." + Регистр1 + ".ОстаткиИОбороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			" + КлючПериод + ",
	               |			,
	               |			Счет В (&Счет),
	               |			,
	               |			СценарийПлана = &Сценарий1
	               |				И предприятия В ИЕРАРХИИ (&Предприятия)
	               |				И " + УсловиеНоменклатура + ") КАК БюджетныйОстаткиИОбороты
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрБухгалтерии." + Регистр2 + ".ОстаткиИОбороты(
	               |				&Дата1,
	               |				&Дата2,
	               |				" + КлючПериод + ",
	               |				,
	               |				Счет В (&Счет),
	               |				,
	               |				СценарийПлана = &Сценарий2
	               |					И предприятия В ИЕРАРХИИ (&Предприятия)
	               |					И " + УсловиеНоменклатура + ") КАК БюджетныйОстаткиИОбороты1
	               |		ПО БюджетныйОстаткиИОбороты.Субконто1 = БюджетныйОстаткиИОбороты1.Субконто1
	               |			И БюджетныйОстаткиИОбороты.Предприятия = БюджетныйОстаткиИОбороты1.Предприятия
	               |			И (" + КлючПериод + "(БюджетныйОстаткиИОбороты.Период) = " + КлючПериод + "(БюджетныйОстаткиИОбороты1.Период))";
	
	
	Запрос.УстановитьПараметр("Предприятия", СписокПредприятий);
	Запрос.УстановитьПараметр("Сценарий1", ПараметрКоманды.Сценарий1);
	Запрос.УстановитьПараметр("Сценарий2", ПараметрКоманды.Сценарий2);
	Запрос.УстановитьПараметр("Дата1", ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ДатаКон);
	Запрос.УстановитьПараметр("Счет", ПланСчетов1.ГотоваяПродукция);
	Запрос.УстановитьПараметр("ОтборНоменклатуры", 1 - ПустаяСтрока(ПараметрКоманды.Номенклатура));
	Запрос.УстановитьПараметр("Номенклатура", ПараметрКоманды.Номенклатура);
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ОсновнаяПродукция);
	
	РезультатОстатки = Запрос.Выполнить();
	//ВыборкаОстатки = РезультатОстатки.Выбрать();
	
	
	ВыборкаПростой = Ложь;
	
	//ВыборкаПростой = ДобавитьЗатратыНаПростой(ТЗ, Регистр1, Регистр2, ПланСчетов1,ПланСчетов2, 
	//	ДатаНач, ДатаКон, СписокПредприятий, СчетчикМесяцев, КоэффициентОтступа, НачалоПериода, ВсегоПериодов, КлючПериод, ПараметрКоманды);
	
	
	Для каждого Предпр Из СписокПредприятий Цикл
		
		ПереньНоменклатур = Новый Массив; //массив с неповторяющейся номенклатурой
		СчетчикНоменклатур = 0;
		
		//заполняем объемы
		ВыборкаОбъемы = РезультатОбъемы.Выбрать();
		СтруктураПоиска = Новый Структура("Предприятия", Предпр); 
		Пока ВыборкаОбъемы.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если ПереньНоменклатур.Найти(ВыборкаОбъемы.Номенклатура) = Неопределено Тогда
				ПереньНоменклатур.Добавить(ВыборкаОбъемы.Номенклатура);
				СчетчикНоменклатур = СчетчикНоменклатур + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		
		//ВыборкаОбъемы = РезультатОбъемы.Выбрать();
		Для каждого Номенклатура Из ПереньНоменклатур Цикл
			
			Объем1 = Новый Массив(60);
			Объем2 = Новый Массив(60);
			ОстатокЦена1 = Новый Массив(60);
			ОстатокЦена2 = Новый Массив(60);
			ОстатокКол1 = Новый Массив(60);
			ОстатокКол2 = Новый Массив(60);
			
			Для т = 0 По 49 Цикл
				Объем1[т] = 0;
				Объем2[т] = 0;
				ОстатокЦена1[т] = 0;
				ОстатокЦена2[т] = 0;
				ОстатокКол1[т] = 0;
				ОстатокКол2[т] = 0;
			КонецЦикла;
			
			//вывод остатков ГП для Учета;
			СтруктураВыбораОбъемы = Новый Структура("Номенклатура, Предприятия", Номенклатура, Предпр);
			ВыборкаОстатки = РезультатОстатки.Выбрать();
			Пока ВыборкаОстатки.НайтиСледующий(СтруктураВыбораОбъемы) Цикл
				СчетчикМесяцев = ВыборкаОстатки.Период - НачалоПериода + 1;
				КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);


				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 3;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + строка("Остаток на начало");
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "Остаток на начало " + Строка(Номенклатура) + ":";
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = ВыборкаОстатки.Сумма1;
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = ВыборкаОстатки.Сумма2;
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 2;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + строка("Количество");
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "Количество";
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = ВыборкаОстатки.Количество1;
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = ВыборкаОстатки.Количество2;
				
				ОстатокЦ1 = ?(ВыборкаОстатки.Количество1, ВыборкаОстатки.Сумма1 / ВыборкаОстатки.Количество1, 0);
				ОстатокЦ2 = ?(ВыборкаОстатки.Количество2, ВыборкаОстатки.Сумма2 / ВыборкаОстатки.Количество2, 0);
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 2;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + строка("Цена");
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "Цена";
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = ОстатокЦ1;
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = ОстатокЦ2;
				
				ОстатокЦена1[СчетчикМесяцев] = ОстатокЦ1;
				ОстатокЦена2[СчетчикМесяцев] = ОстатокЦ2;
				
				ОстатокКол1[СчетчикМесяцев] = ВыборкаОстатки.Количество1;
				ОстатокКол2[СчетчикМесяцев] = ВыборкаОстатки.Количество2;
				
				
			КонецЦикла;
			
			
			//вывод объемов производства;
			//СтруктураВыбораОбъемы = Новый Структура("Номенклатура, Предприятия", Номенклатура, Предпр);
			ВыборкаОбъемы = РезультатОбъемы.Выбрать();
			Пока ВыборкаОбъемы.НайтиСледующий(СтруктураВыбораОбъемы) Цикл
				СчетчикМесяцев = ВыборкаОбъемы.Период - НачалоПериода + 1;
				КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
				
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 1;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + строка("Объем производства");
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "Объем производства " + Строка(Номенклатура);
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = ВыборкаОбъемы.Объем1;
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = ВыборкаОбъемы.Объем2;
				
				Объем1[СчетчикМесяцев] = ВыборкаОбъемы.Объем1;
				Объем2[СчетчикМесяцев] = ВыборкаОбъемы.Объем2;
			КонецЦикла;
			
			
			
			
			//очищаем массив и присваиваем числовой тип
			Сырье1 = Новый Массив(50);
			Сырье2 = Новый Массив(50);
			Переработка1 = Новый Массив(50);
			Переработка2 = Новый Массив(50);
			Итого1 = Новый Массив(50);
			Итого2 = Новый Массив(50);
			Для т = 0 По 49 Цикл
				Сырье1[т] = 0;
				Сырье2[т] = 0;
				Переработка1[т] = 0;
				Переработка2[т] = 0;
				Итого1[т] = 0;
				Итого2[т] = 0;
			КонецЦикла;
			//Номенклатура2.Добавить(ВыборкаОбъемы.Номенклатура);
			Выборка = РезультатЗатраты.Выбрать();
			Если ПараметрКоманды.Прочие Тогда
				СтруктураПоиска = Новый Структура("Номенклатура, Предприятия, ПризнакСтатьи", Номенклатура, Предпр, "ПроизводственныеЗатраты");	
			Иначе
				СтруктураПоиска = Новый Структура("Номенклатура, Предприятия", Номенклатура, Предпр);	
			КонецЕсли;
			
			Пока Выборка.НайтиСледующий(СтруктураПоиска) цикл
				
				СчетчикМесяцев = Выборка.Период - НачалоПериода + 1;
				КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
				
				//расшифровка по основному сырью
				Прочие = Ложь;
				Если Выборка.ПризнакСтатьи = "ПрочиеЗатраты" Тогда
					Прочие = Истина;				
				КонецЕсли;
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = ?(Выборка.ЭтоГруппа, 0, ?(Прочие, 1, 6));
				
				Если НЕ Выборка.ЭтоГруппа Тогда
					Если Выборка.Статья = Справочники.СтатьиЗатрат.ЗатратыОсн ИЛИ
						Выборка.Статья = Справочники.СтатьиЗатрат.ЗатратыВсп Тогда
						Сырье1[СчетчикМесяцев] = Сырье1[СчетчикМесяцев] + Выборка.Сумма1;
						Сырье2[СчетчикМесяцев] = Сырье2[СчетчикМесяцев] + Выборка.Сумма2;
						НоваяСтрока[0] = 0;
					иначе
						Переработка1[СчетчикМесяцев] = Переработка1[СчетчикМесяцев] + Выборка.Сумма1; 
						Переработка2[СчетчикМесяцев] = Переработка2[СчетчикМесяцев] + Выборка.Сумма2;									
					КонецЕсли;
				КонецЕсли;
				
				
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + строка(Выборка.Статья);
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = Выборка.Статья;
				НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(Объем1[СчетчикМесяцев], Выборка.Сумма1 / Объем1[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = Выборка.Сумма1;
				НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(Объем2[СчетчикМесяцев], Выборка.Сумма2 / Объем2[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Выборка.Сумма2;
				
				//расшифровка по основному сырью
				Всп = Ложь;
				Если Выборка.Статья = Справочники.СтатьиЗатрат.ЗатратыВсп Тогда
					Всп = Истина;				
				КонецЕсли;
				
				
				
				Если Выборка.Статья = Справочники.СтатьиЗатрат.ЗатратыОсн ИЛИ Всп ИЛИ Прочие Тогда
					
					ВыборкаСырье = РезультатСырье.Выбрать();
					СтруктураПоискаСтатьи = Новый Структура("Номенклатура, Период, Предприятия, СтатьяЗатрат", Номенклатура, Выборка.Период, Предпр, Выборка.Статья);	
					Пока ВыборкаСырье.НайтиСледующий(СтруктураПоискаСтатьи) цикл
						НоваяСтрока = ТЗ.Добавить();
						НоваяСтрока[0] = ?(Всп, 6, 1);
						НоваяСтрока[1] = 2;
						НоваяСтрока[2] = Строка(Номенклатура) + строка(ВыборкаСырье.Материал);
						НоваяСтрока[3] = Предпр;
						
						Если ПустаяСтрока(ПараметрКоманды.Сценарий2) Тогда //выводим кол*цена в строчках
							НоваяСтрока[4] = Строка(ВыборкаСырье.Материал) + " (К.- " + Строка(Формат(ВыборкаСырье.Количество1, "ЧДЦ=2")) 
								+ "; Ц.- " + Строка(Формат(ВыборкаСырье.Цена1, "ЧДЦ=2")) + ")";
							НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(Объем1[СчетчикМесяцев], ВыборкаСырье.Сумма1 / Объем1[СчетчикМесяцев], 0);
							НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = ВыборкаСырье.Сумма1;
							НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(Объем2[СчетчикМесяцев], ВыборкаСырье.Сумма2 / Объем2[СчетчикМесяцев], 0);
							НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = ВыборкаСырье.Сумма2;
						Иначе
							НоваяСтрока[4] = Строка(ВыборкаСырье.Материал) + " (количество*цена)";
							НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ВыборкаСырье.Количество1;
							НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = ?(ВыборкаСырье.Количество1, ВыборкаСырье.Цена1, ВыборкаСырье.Сумма1);
							НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ВыборкаСырье.Количество2;
							НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = ?(ВыборкаСырье.Количество2, ВыборкаСырье.Цена2, ВыборкаСырье.Сумма2);						
							
							
						КонецЕсли;
						
						
					КонецЦикла;
					
					
				КонецЕсли;
				
			КонецЦикла;
			
			//выводим Итоги
			СтруктураВыбораОбъемы = Новый Структура("Номенклатура, Предприятия", Номенклатура, Предпр);
			ВыборкаОбъемы = РезультатОбъемы.Выбрать();
			Пока ВыборкаОбъемы.НайтиСледующий(СтруктураВыбораОбъемы) Цикл
				
				СчетчикМесяцев = ВыборкаОбъемы.Период - НачалоПериода + 1;
				КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 7;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + "ИТОГО:";
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "ИТОГО:";
				НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(Объем1[СчетчикМесяцев], (Сырье1[СчетчикМесяцев] + Переработка1[СчетчикМесяцев]) / Объем1[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = Сырье1[СчетчикМесяцев] + Переработка1[СчетчикМесяцев];
				НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(Объем2[СчетчикМесяцев], (Сырье2[СчетчикМесяцев] + Переработка2[СчетчикМесяцев]) / Объем2[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Сырье2[СчетчикМесяцев] + Переработка2[СчетчикМесяцев];
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 7;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + "  переработка";
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "  переработка";
				НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(Объем1[СчетчикМесяцев], (Переработка1[СчетчикМесяцев]) / Объем1[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] =Переработка1[СчетчикМесяцев];
				НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(Объем2[СчетчикМесяцев], (Переработка2[СчетчикМесяцев]) / Объем2[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Переработка2[СчетчикМесяцев];
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 7;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + "  затраты на сырье";
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "  затраты на сырье";
				НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(Объем1[СчетчикМесяцев], (Сырье1[СчетчикМесяцев]) / Объем1[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] =Сырье1[СчетчикМесяцев];
				НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(Объем2[СчетчикМесяцев], (Сырье2[СчетчикМесяцев]) / Объем2[СчетчикМесяцев], 0);
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] =  Сырье2[СчетчикМесяцев];
				
				
				
			КонецЦикла;
			
			
			//считаем прочиеЗатраты
			Если ПараметрКоманды.Прочие Тогда
				Выборка = РезультатЗатраты.Выбрать();
				СтруктураПоиска = Новый Структура("Номенклатура, Предприятия, ПризнакСтатьи", Номенклатура, Предпр, "ПрочиеЗатраты");	
				Пока Выборка.НайтиСледующий(СтруктураПоиска) цикл
					
					СчетчикМесяцев = Выборка.Период - НачалоПериода + 1;
					КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
					
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока[0] = 1 - Выборка.ЭтоГруппа;
					
					Если НЕ Выборка.ЭтоГруппа Тогда
						Если Выборка.Статья = Справочники.СтатьиЗатрат.ЗатратыОсн ИЛИ
							Выборка.Статья = Справочники.СтатьиЗатрат.ЗатратыВсп Тогда
							Сырье1[СчетчикМесяцев] = Сырье1[СчетчикМесяцев] + Выборка.Сумма1;
							Сырье2[СчетчикМесяцев] = Сырье2[СчетчикМесяцев] + Выборка.Сумма2;
							НоваяСтрока[0] = 0;
						иначе
							Переработка1[СчетчикМесяцев] = Переработка1[СчетчикМесяцев] + Выборка.Сумма1; 
							Переработка2[СчетчикМесяцев] = Переработка2[СчетчикМесяцев] + Выборка.Сумма2;									
						КонецЕсли;
					КонецЕсли;
					
					
					НоваяСтрока[1] = 0;
					НоваяСтрока[2] = Строка(Номенклатура) + строка(Выборка.Статья);
					НоваяСтрока[3] = Предпр;
					НоваяСтрока[4] = Выборка.Статья;
					НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(Объем1[СчетчикМесяцев], Выборка.Сумма1 / Объем1[СчетчикМесяцев], 0);
					НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = Выборка.Сумма1;
					НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(Объем2[СчетчикМесяцев], Выборка.Сумма2 / Объем2[СчетчикМесяцев], 0);
					НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Выборка.Сумма2;
					
					
				КонецЦикла;
				
				//выводим Итоги ПОЛНЫЕ
				СтруктураВыбораОбъемы = Новый Структура("Номенклатура, Предприятия", Номенклатура, Предпр);
				ВыборкаОбъемы = РезультатОбъемы.Выбрать();
				Пока ВыборкаОбъемы.НайтиСледующий(СтруктураВыбораОбъемы) Цикл
					
					СчетчикМесяцев = ВыборкаОбъемы.Период - НачалоПериода + 1;
					КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
					
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока[0] = 7;
					НоваяСтрока[1] = 0;
					НоваяСтрока[2] = Строка(Номенклатура) + "ИТОГО ПОЛНАЯ СЕБЕСТОИМОСТЬ:";
					НоваяСтрока[3] = Предпр;
					НоваяСтрока[4] = "ИТОГО ПОЛНАЯ СЕБЕСТОИМОСТЬ:";
					НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(Объем1[СчетчикМесяцев], (Сырье1[СчетчикМесяцев] + Переработка1[СчетчикМесяцев]) / Объем1[СчетчикМесяцев], 0);
					НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = Сырье1[СчетчикМесяцев] + Переработка1[СчетчикМесяцев];
					НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(Объем2[СчетчикМесяцев], (Сырье2[СчетчикМесяцев] + Переработка2[СчетчикМесяцев]) / Объем2[СчетчикМесяцев], 0);
					НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Сырье2[СчетчикМесяцев] + Переработка2[СчетчикМесяцев];
					
					
					
				КонецЦикла;
			Конецесли;
			
			//выводим Итоги
			СтруктураВыбораОбъемы = Новый Структура("Номенклатура, Предприятия", Номенклатура, Предпр);
			ВыборкаОбъемы = РезультатОбъемы.Выбрать();
			Пока ВыборкаОбъемы.НайтиСледующий(СтруктураВыбораОбъемы) Цикл
				
				СчетчикМесяцев = ВыборкаОбъемы.Период - НачалоПериода + 1;
				КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
				
				НоваяСтрока = ТЗ.Добавить();
				НоваяСтрока[0] = 4;
				НоваяСтрока[1] = 0;
				НоваяСтрока[2] = Строка(Номенклатура) + " Средняя себестоимость:";
				НоваяСтрока[3] = Предпр;
				НоваяСтрока[4] = "Средняя себестоимость:";
				НоваяСтрока[СчетчикМесяцев * 2 + 8 + КоэффициентОтступа] = ?(ОстатокКол1[СчетчикМесяцев] + Объем1[СчетчикМесяцев], (ОстатокКол1[СчетчикМесяцев] * ОстатокЦена1[СчетчикМесяцев] + Сырье1[СчетчикМесяцев] + Переработка1[СчетчикМесяцев]) / (ОстатокКол1[СчетчикМесяцев] + Объем1[СчетчикМесяцев]), 0);
				НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = (ОстатокКол1[СчетчикМесяцев] * ОстатокЦена1[СчетчикМесяцев] + Сырье1[СчетчикМесяцев] + Переработка1[СчетчикМесяцев]);
				НоваяСтрока[СчетчикМесяцев * 2+ 10 + КоэффициентОтступа] = ?(ОстатокКол2[СчетчикМесяцев] + Объем2[СчетчикМесяцев], (ОстатокКол2[СчетчикМесяцев] * ОстатокЦена2[СчетчикМесяцев] + Сырье2[СчетчикМесяцев] + Переработка2[СчетчикМесяцев]) / (ОстатокКол2[СчетчикМесяцев] + Объем2[СчетчикМесяцев]), 0);
				НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = (ОстатокКол2[СчетчикМесяцев] * ОстатокЦена2[СчетчикМесяцев] + Сырье2[СчетчикМесяцев] + Переработка2[СчетчикМесяцев]);;
			Конеццикла;
			
		КонецЦикла;
		
		////считаем затраты на простой на 91 счете
		//Простой = 0;
		//Сум1 = 0;
		//Сум2 = 0;
		//СтруктураПоиска = Новый Структура("Предприятия", Предпр);
		//Выборка = ВыборкаПростой.Выбрать();
		//Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
		//	Если НЕ ПустаяСтрока(Выборка.Сумма1) Тогда
		//		Сум1 = Сум1 + Выборка.Сумма1;
		//	КонецЕсли; 
		//	
		//	Если НЕ ПустаяСтрока(Выборка.Сумма2) Тогда
		//		Сум2 = Сум2 + Выборка.Сумма2;
		//	КонецЕсли; 
		//конеццикла;
		//
		//Сырье1 = Новый Массив(50);
		//Сырье2 = Новый Массив(50);
		//Переработка1 = Новый Массив(50);
		//Переработка2 = Новый Массив(50);
		//
		//Для т = 0 По 49 Цикл
		//	Сырье1[т] = 0;
		//	Сырье2[т] = 0;
		//	Переработка1[т] = 0;
		//	Переработка2[т] = 0;
		//КонецЦикла;
		//
		//Если Сум1 или Сум2 Тогда
		//	Простой = 1;
		//	Выборка = ВыборкаПростой.Выбрать();
		//	Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
		//		СчетчикМесяцев = Выборка.Период - НачалоПериода + 1;
		//		КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
		//		
		//		НоваяСтрока = ТЗ.Добавить();
		//		НоваяСтрока[0] = 1;
		//		НоваяСтрока[1] = 0;
		//		НоваяСтрока[2] = "(ПРОСТОЙ)" + строка("Объем производства");
		//		НоваяСтрока[3] = Предпр;
		//		НоваяСтрока[4] = "Объем производства (ПРОСТОЙ)";
		//		
		//		Если Выборка.Период Тогда
		//			
		//			НоваяСтрока = ТЗ.Добавить();
		//			Если НЕ Выборка.ЭтоГруппа Тогда
		//				Если Выборка.Статья = Справочники.ИздержкиОбращения.ЗатратыОсн ИЛИ
		//					Выборка.Статья = Справочники.ИздержкиОбращения.ЗатратыВсп Тогда
		//					Сырье1[СчетчикМесяцев] = Сырье1[СчетчикМесяцев] + Выборка.Сумма1;
		//					Сырье2[СчетчикМесяцев] = Сырье2[СчетчикМесяцев] + Выборка.Сумма2;
		//				иначе
		//					Переработка1[СчетчикМесяцев] = Переработка1[СчетчикМесяцев] + Выборка.Сумма1; 
		//					Переработка2[СчетчикМесяцев] = Переработка2[СчетчикМесяцев] + Выборка.Сумма2;
		//				КонецЕсли;
		//			КонецЕсли;
		//			
		//			
		//			НоваяСтрока[0] = 1 - Выборка.ЭтоГруппа;
		//			
		//			Если НЕ Выборка.ЭтоГруппа И (Выборка.Статья = Справочники.ИздержкиОбращения.ЗатратыОсн ИЛИ
		//				Выборка.Статья = Справочники.ИздержкиОбращения.ЗатратыВсп) Тогда
		//				НоваяСтрока[0] = 0;
		//			КонецЕсли;
		//			
		//			
		//			НоваяСтрока[1] = 0;
		//			НоваяСтрока[2] = "(ПРОСТОЙ)" + строка(Выборка.Статья);
		//			НоваяСтрока[3] = Предпр;
		//			НоваяСтрока[4] = Выборка.Статья;
		//			НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] = Выборка.Сумма1;
		//			НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Выборка.Сумма2;
		//			
		//		КонецЕсли;
		//		
		//		
		//	КонецЦикла;
		//	
		//	Для СчетчикМесяцев = 1 По ВсегоПериодов Цикл
		//		КоэффициентОтступа = ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 0, СчетчикМесяцев * 2 - 2);
		//		
		//		//выводим Итоги
		//		НоваяСтрока = ТЗ.Добавить();
		//		НоваяСтрока[0] = 0;
		//		НоваяСтрока[1] = 0;
		//		НоваяСтрока[2] = "(ПРОСТОЙ)" + "ИТОГО:";
		//		НоваяСтрока[3] = Предпр;
		//		НоваяСтрока[4] = "ИТОГО:";
		//		НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] =Сырье1[СчетчикМесяцев] + Переработка1[СчетчикМесяцев];
		//		НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Сырье2[СчетчикМесяцев] + Переработка2[СчетчикМесяцев];
		//		
		//		НоваяСтрока = ТЗ.Добавить();
		//		НоваяСтрока[0] = 0;
		//		НоваяСтрока[1] = 0;
		//		НоваяСтрока[2] = "(ПРОСТОЙ)" + "  переработка";
		//		НоваяСтрока[3] = Предпр;
		//		НоваяСтрока[4] = "  переработка";
		//		НоваяСтрока[СчетчикМесяцев * 2 + 9 + КоэффициентОтступа] =Переработка1[СчетчикМесяцев];
		//		НоваяСтрока[СчетчикМесяцев * 2+ 11 + КоэффициентОтступа] = Переработка2[СчетчикМесяцев];
		//	КонецЦикла;
		//	
		//	
		//КонецЕсли;
		
		Простой = 0;
		//выводим всего по предприятию
		Если СчетчикНоменклатур + Простой > 1  Тогда
			//ТЗ.Свернуть("Шрифт, Порядок, Признак, Предприятие, Значение", НаборИмен);
			Т32 = ТЗ.Скопировать();
			Т32.Свернуть("Шрифт, Порядок, Признак, Предприятие, Значение, Резерв1, Резерв2, Резерв3, Резерв4, Резерв5", НаборИмен);;
			//считаем итого объем
			ОбъемВсего = Новый Массив(1000);
			ОстаткиВсего = Новый Массив(1000);
			СуммаОстаткиВсего = Новый Массив(1000);
			Для Строчка = 0 По Т32.Количество()-1 Цикл
				Если Т32[Строчка][3] = Предпр И НЕ Т32[Строчка][1] Тогда
					Если Лев(Т32[Строчка][4], 18) = "Объем производства" Тогда
						Для Колонка = 5 По 10 + ВсегоПериодов * 2 * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл
							ОбъемВсего[Колонка] =  ?(ОбъемВсего[Колонка] = Неопределено, 0, ОбъемВсего[Колонка]) + ?(Т32[Строчка][Колонка] = Неопределено, 0, Т32[Строчка][Колонка]);
						конеццикла;
					конецесли;
					
					Если Лев(Т32[Строчка][4], 17) = "Остаток на начало" Тогда
						Для Колонка = 5 По 10 + ВсегоПериодов * 2 * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл
							СуммаОстаткиВсего[Колонка] =  ?(СуммаОстаткиВсего[Колонка] = Неопределено, 0, СуммаОстаткиВсего[Колонка]) + ?(Т32[Строчка][Колонка] = Неопределено, 0, Т32[Строчка][Колонка]);
						конеццикла;
					конецесли;
					
					Если Лев(Т32[Строчка][4], 10) = "Количество" Тогда
						Для Колонка = 5 По 10 + ВсегоПериодов * 2 * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл
							ОстаткиВсего[Колонка] =  ?(ОстаткиВсего[Колонка] = Неопределено, 0, ОстаткиВсего[Колонка]) + ?(Т32[Строчка][Колонка] = Неопределено, 0, Т32[Строчка][Колонка]);
						конеццикла;
					конецесли;
					
				КонецЕсли; 
			конеццикла;
			
			Для Строчка = 0 По Т32.Количество()-1 Цикл
				Если Т32[Строчка][3] = Предпр И НЕ Т32[Строчка][1] Тогда
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока[0] = Т32[Строчка][0];
					НоваяСтрока[1] = Т32[Строчка][1];
					НоваяСтрока[2] = "всего-всего  переработка";
					НоваяСтрока[3] = Т32[Строчка][3];
					
					СуммаЕд = Истина;
					
					Если Лев(Т32[Строчка][4], 18) = "Объем производства" Тогда
						НоваяСтрока[4] = "Объем производства (ВСЕГО)";
					иначеЕсли Лев(Т32[Строчка][4], 17) = "Остаток на начало" Тогда
						НоваяСтрока[4] = "Остаток на начало (ВСЕГО)";
						СуммаЕд = Ложь;
					Иначе
						НоваяСтрока[4] = Т32[Строчка][4];
					конецесли;
					
					Если Лев(Т32[Строчка][4], 10) = "Количество" ИЛИ Лев(Т32[Строчка][4], 4) = "Цена" Тогда
						СуммаЕд = Ложь;
					КонецЕсли;
					
					Для Колонка = 7 По 10 + ВсегоПериодов * 2 * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл
						НоваяСтрока[Колонка - 1] = ?(ОбъемВсего[Колонка], ?(Т32[Строчка][Колонка] = Неопределено, 0, Т32[Строчка][Колонка]) / ОбъемВсего[Колонка], 0);
						НоваяСтрока[Колонка] =  Т32[Строчка][Колонка];
						Если Лев(Т32[Строчка][4], 4) = "Цена" Тогда
							НоваяСтрока[Колонка] =  ?(СчетчикНоменклатур, ?(ОстаткиВсего[Колонка], СуммаОстаткиВсего[Колонка] / ОстаткиВсего[Колонка], 0) / СчетчикНоменклатур, 0);
						КонецЕсли;
						НоваяСтрока[Колонка - 1] = ?(СуммаЕд, НоваяСтрока[Колонка - 1], 0);
						Колонка = Колонка + 1;
					конеццикла;
				КонецЕсли; 
			конеццикла;
		КонецЕсли;
		
		
	КонецЦикла; 
	
	
	//КонецЦикла;
	
	
	ТЗ.Свернуть("Шрифт, Порядок, Признак, Предприятие, Значение", НаборИмен);
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	Для Строчка = 0 По ТЗ.Количество()-1 Цикл
		
		
		//вывод шапки + остатки
		Если Лев(ТЗ[Строчка][4], 17) = "Остаток на начало" Тогда // выводим шапку
			
			//ОбластьШапка.Параметры.Номенклатура = Сред(ТЗ[Строчка][4], 19, СтрДлина(ТЗ[Строчка][4]));
			ОбластьШапка.Параметры.Предприятие = ТЗ[Строчка][3];
			ОбластьШапка.Параметры.Месяц = ПредставлениеПериода(ПараметрКоманды.Период.ДатаНачала, ПараметрКоманды.Период.ДатаОкончания);;
			
			ТабДок.Вывести(ОбластьШапка, 0);
			Период = 0;
			Для Колонка = 1 По ВсегоПериодов * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл
				Период = Период + Интервал;
				ОбластьШапкаСтолбцы.Параметры.Сценарий1 = ПараметрКоманды.Сценарий1;
				Если ВсегоПериодов > 1 Тогда
					ОбластьШапкаСтолбцы.Параметры.Месяц = ПредставлениеПериода(НачалоМесяца(ДобавитьМесяц(ПараметрКоманды.Период.ДатаНачала, Период - Интервал)), КонецМесяца(ДобавитьМесяц(ПараметрКоманды.Период.ДатаНачала, Период - 1)));	
				иначе
					ОбластьШапкаСтолбцы.Параметры.Месяц = ПредставлениеПериода(ПараметрКоманды.Период.ДатаНачала, ПараметрКоманды.Период.ДатаОкончания);	
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2)  Тогда
					ОбластьШапкаСтолбцы.Параметры.Сценарий2 = ПараметрКоманды.Сценарий2;
					Колонка = Колонка + 1;
				КонецЕсли;
				
				
				ТабДок.Присоединить(ОбластьШапкаСтолбцы, 0);
			КонецЦикла;
			
		Конецесли;
		
		Если БюджетныйНаСервере.РольДоступнаСервер("Учетчик") Тогда
			Уч = "Уч";
		Иначе
			Уч = "";	
		КонецЕсли;
		ОбластьОбъемСтолбцы = Макет.ПолучитьОбласть("ШапкаОбъем|ДанныеСтолбца" + Уч);
		
		//вывод шапки объем пр-ва
		Если Лев(ТЗ[Строчка][4], 18) = "Объем производства" Тогда // выводим шапку
			ОбластьОбъем.Параметры.Номенклатура = Сред(ТЗ[Строчка][4], 19, СтрДлина(ТЗ[Строчка][4]));
			ТабДок.Вывести(ОбластьОбъем, 0);
			Для Колонка = 1 По ВсегоПериодов * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл				
				ОбластьОбъемСтолбцы.Параметры.Объем1 = ТЗ[Строчка][Колонка * 2 + 4];
				Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2)  Тогда
					//ОбластьОбъемСтолбцы.Параметры.Сценарий2 = ПараметрКоманды.Сценарий2;
					ОбластьОбъемСтолбцы.Параметры.Объем2 = ТЗ[Строчка][Колонка * 2 + 6];
					ОбластьОбъемСтолбцы.Параметры.Объем3 = ОбластьОбъемСтолбцы.Параметры.Объем2 - ОбластьОбъемСтолбцы.Параметры.Объем1;
					Колонка = Колонка + 1;
				КонецЕсли;
				ТабДок.Присоединить(ОбластьОбъемСтолбцы, 0);
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		
		
		//получаем шрифт
		ОбластьДанные = Макет.ПолучитьОбласть("Строка" + строка(ТЗ[Строчка][0]) + "|СтолбецНачало");
		
		ОбластьДанныеСтолбцы = Макет.ПолучитьОбласть("Строка" + строка(ТЗ[Строчка][0]) + "|ДанныеСтолбца" + Уч);
		
		
		
		//получаем данные
		ОбластьДанные.Параметры.Статья = ТЗ[Строчка][4];
		
		Уровень = ?(ТЗ[Строчка][0], 1, 0);
		ВидимостьОбласти = ?(ТЗ[Строчка][0] > 1, Ложь, Истина);
		
		Если НЕ ВидимостьОбласти Тогда
			ИмяОбласти = "Остатки ГП на начало";			
		КонецЕсли;
		Если ТЗ[Строчка][0] = 4 Тогда
			ИмяОбласти = "Средняя себестоимость";			
		КонецЕсли;
		Если ТЗ[Строчка][0] = 6 Тогда
			ИмяОбласти = "Расшифровка затрат";			
		КонецЕсли;
		
			
		
		ТабДок.Вывести(ОбластьДанные, Уровень, ИмяОбласти, ВидимостьОбласти);
		Период = 0;
		Для Колонка = 1 По ВсегоПериодов * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл
			Период = Период + Интервал;
			ОбластьДанныеСтолбцы.Параметры.Сумма11 =  ТЗ[Строчка][Колонка * 2 + 3];
			ОбластьДанныеСтолбцы.Параметры.Сумма1 =  ТЗ[Строчка][Колонка * 2 + 4];
			Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2)  Тогда
				ОбластьДанныеСтолбцы.Параметры.Сумма21 = ТЗ[Строчка][Колонка * 2 + 5];
				ОбластьДанныеСтолбцы.Параметры.Сумма2 = ТЗ[Строчка][Колонка * 2 + 6];
				ОбластьДанныеСтолбцы.Параметры.Сумма31 = ОбластьДанныеСтолбцы.Параметры.Сумма21 - ОбластьДанныеСтолбцы.Параметры.Сумма11;
				ОбластьДанныеСтолбцы.Параметры.Сумма3 = ОбластьДанныеСтолбцы.Параметры.Сумма2 - ОбластьДанныеСтолбцы.Параметры.Сумма1;
				Колонка = Колонка + 1;
			КонецЕсли;
			
			СтруктураРасшифровки = Новый Структура;
			СтруктураРасшифровки.Вставить("ПараметрКоманды", "ПараметрКоманды.Д_Расшифровка");
			СтруктураРасшифровки.Вставить("Счет", ПланСчетов1.ЗатратыНаПрво);
			СтруктураРасшифровки.Вставить("Предприятие", ТЗ[Строчка][3]);
			СтруктураРасшифровки.Вставить("Субконто1", ТЗ[Строчка][4]);
			СтруктураРасшифровки.Вставить("Дата1", ?(ВсегоПериодов > 1, НачалоМесяца(ДобавитьМесяц(ПараметрКоманды.Период.ДатаНачала, Период - Интервал)), ПараметрКоманды.Период.ДатаНачала));
			СтруктураРасшифровки.Вставить("Дата2", ?(ВсегоПериодов > 1, КонецМесяца(ДобавитьМесяц(ПараметрКоманды.Период.ДатаНачала, Период - 1)), ПараметрКоманды.Период.ДатаОкончания));
			СтруктураРасшифровки.Вставить("ВидимостьШапки", 0);
			СтруктураРасшифровки.Вставить("Сценарий1", ПараметрКоманды.Сценарий1);
			
			ОбластьДанныеСтолбцы.Параметры.Расшифровка = СтруктураРасшифровки;
			Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2)  Тогда
				СтруктураРасшифровки2 = Новый Структура;
				СтруктураРасшифровки2.Вставить("ПараметрКоманды", "ПараметрКоманды.Д_Расшифровка");
				СтруктураРасшифровки2.Вставить("Счет", ПланСчетов2.ЗатратыНаПрво);
				СтруктураРасшифровки2.Вставить("Предприятие", ТЗ[Строчка][3]);
				СтруктураРасшифровки2.Вставить("Субконто1", ТЗ[Строчка][4]);
				СтруктураРасшифровки2.Вставить("Дата1", ?(ВсегоПериодов > 1, НачалоМесяца(ДобавитьМесяц(ПараметрКоманды.Период.ДатаНачала, Период - Интервал)), ПараметрКоманды.Период.ДатаНачала));
				СтруктураРасшифровки2.Вставить("Дата2", ?(ВсегоПериодов > 1, КонецМесяца(ДобавитьМесяц(ПараметрКоманды.Период.ДатаНачала, Период - 1)), ПараметрКоманды.Период.ДатаОкончания));
				СтруктураРасшифровки2.Вставить("ВидимостьШапки", 0);
				СтруктураРасшифровки2.Вставить("Сценарий1", ПараметрКоманды.Сценарий2);
				ОбластьДанныеСтолбцы.Параметры.Расшифровка2 = СтруктураРасшифровки2;
			КонецЕсли;
			
			ТабДок.Присоединить(ОбластьДанныеСтолбцы, Уровень, ИмяОбласти, ВидимостьОбласти);
			
			//Колонка = Колонка + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	//ТабДок.Вывести(ОбластьКрасота);
	//
	//Для Колонка = 1 По ВсегоПериодов * ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), 1, 2) Цикл
	//	ТабДок.Присоединить(ОбластьКрасотаСтолбцы);	
	//КонецЦикла;
	
	
	
	
	
	
КонецПроцедуры

