Процедура ВыполнитьРегламентнуюЗадачуЗагрузкаВыписокИзКлиентБанка() Экспорт
	
	ИмяСобытия = НСтр("ru = 'Загрузка выписок из клиент-банка'", ОбщегоНазначения.КодОсновногоЯзыка());
	Обработка = Обработки.сабЗагрузкаВыписокИзКлиентБанка.Создать();
	Обработка.ВыполнитьКоманду("сабЗагрузкаВыписокИзКлиентБанка", Неопределено);
    Комментарий = НСтр("ru = 'Задание выполнено'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Примечание, , , Комментарий);
	
КонецПроцедуры

Процедура ВыполнитьРегламентнуюЗадачуРассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту() Экспорт
	
	ИмяСобытия = НСтр("ru = 'Рассылка оповещений о создании документов на электронную почту'", ОбщегоНазначения.КодОсновногоЯзыка());
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	
	НаборЗаписей = РегистрыСведений.сабЭлектронныеПисьма.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для каждого Запись из НаборЗаписей Цикл
		
		Если Запись.Отправлено = Ложь Тогда
			
			ПараметрыОтправки = Новый Структура;
			ПараметрыОтправки.Вставить("Кому", Запись.Получатель);
			ПараметрыОтправки.Вставить("Тема", Запись.Тема);
			ПараметрыОтправки.Вставить("Тело", Запись.ТекстПисьма);
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыОтправки);
				Запись.Отправлено = Истина;
				Запись.ДатаОтправки = ТекущаяДата();
				УстановитьПривилегированныйРежим(Ложь);
			Исключение
				ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Примечание, , , ОписаниеОшибки);
			КонецПопытки;
			
		КонецЕсли; 
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Комментарий = НСтр("ru = 'Задание выполнено'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Примечание, , , Комментарий);
	
КонецПроцедуры
