
Процедура ОбработкаПроведения(Отказ, Режим)
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
		
	Если (СостояниеДокумента = Перечисления.Д_СостоянияДокументов.Исполнен ИЛИ СостояниеДокумента = Перечисления.Д_СостоянияДокументов.НаИсполнении) И ПометкаУдаления 
			И НЕ ПараметрыСеанса.ТекущийПользователь.ПринадлежитЭлементу(Справочники.Пользователи.Администрирование) 
			И НЕ ПараметрыСеанса.ТекущийПользователь = РуководительСлужбы Тогда
		Сообщить("Пометить на удаление согласованную заявку может только  - (" + Строка(РуководительСлужбы) + ").");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Доступность = Ложь;
	АрхивЗаявок.Очистить();
	ТекущаяЗадача = "";
	ТекущийБизнесПроцесс = "";
	Попытка
		ВидСЗ = Справочники.Д_ВидыВнутреннихДокументов.ЗаявкаНаЗакупкуПродажу;
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаТорговлю") Тогда
		// Заполнение шапки
		Автор = ДанныеЗаполнения.Автор;
		Предприятие = ДанныеЗаполнения.Предприятие;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Файл = ДанныеЗаполнения.Файл;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ФизическийОбъем = ДанныеЗаполнения.ФизическийОбъем;
		Цена = ДанныеЗаполнения.Цена;
		ТранспортныеРасходы = ДанныеЗаполнения.ТранспортныеРасходы;
		ВидДоставки = ДанныеЗаполнения.ВидДоставки;
		Задолженность = ДанныеЗаполнения.Задолженность;
		Примечания = ДанныеЗаполнения.Примечания;
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		Верхи = ДанныеЗаполнения.Верхи;
		ФормаОплаты = ДанныеЗаполнения.ФормаОплаты;
		ОтсрочкаПлатежа = ДанныеЗаполнения.ОтсрочкаПлатежа;
		ДатаПоставкиНач = ДанныеЗаполнения.ДатаПоставкиНач;
		ДатаПоставкиКон = ДанныеЗаполнения.ДатаПоставкиКон;
		Грузоотправитель = ДанныеЗаполнения.Грузоотправитель;
		ОтветственноеЛицо = ДанныеЗаполнения.ОтветственноеЛицо;
		ПриемПоВесам = ДанныеЗаполнения.ПриемПоВесам;
		КонтактноеЛицо = ДанныеЗаполнения.КонтактноеЛицо;
		Расстояние = ДанныеЗаполнения.Расстояние;
		КлассСырья = ДанныеЗаполнения.КлассСырья;
		ЮрЛицо = ДанныеЗаполнения.ЮрЛицо;
		НомерДоговора = ДанныеЗаполнения.НомерДоговора;
		ДатаДоговора = ДанныеЗаполнения.ДатаДоговора;
		Сорность = ДанныеЗаполнения.Сорность;
		Влажность = ДанныеЗаполнения.Влажность;
		Крахмалистость = ДанныеЗаполнения.Крахмалистость;
		ПрочиеРасходы = ДанныеЗаполнения.ПрочиеРасходы;
		ПрочиеРасходыКомментарий = ДанныеЗаполнения.ПрочиеРасходыКомментарий;
		ЦенаНДС = ДанныеЗаполнения.ЦенаНДС;
		ВерхНДС = ДанныеЗаполнения.ВерхНДС;
		ТранспортныеРасходыНДС = ДанныеЗаполнения.ТранспортныеРасходыНДС;
		ПрочиеРасходыНДС = ДанныеЗаполнения.ПрочиеРасходыНДС;
		РуководительСлужбы = ДанныеЗаполнения.РуководительСлужбы;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	  //из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры




