
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолныйСписокСценариев = Истина;
	Список.Параметры.УстановитьЗначениеПараметра("Дата1", НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", НачалоМесяца(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ПолныйСписокСценариев", ПолныйСписокСценариев);
КонецПроцедуры

&НаКлиенте
Процедура ПолныйСписокСценариевПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ПолныйСписокСценариев", ПолныйСписокСценариев);
КонецПроцедуры
