
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.ГУИД) И Запись.ВстроеноВРабочуюБазу Тогда
			ДобавитьГУИД();
			Возврат;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьГУИД()
	
	Гуид = Новый УникальныйИдентификатор;
	Для Каждого ЗаписьИзменений Из ЭтотОбъект Цикл
		ЗаписьИзменений.ГУИД = Гуид;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Новости.СоздатьМенеджерЗаписи();
		Запись.Пользователь = Выборка.Ссылка;
		Запись.Новость      = Гуид;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Запись.Пользователь = Выборка.Ссылка;
			Запись.Новость      = Гуид;
		КонецЕсли;
		Запись.НовостьПрочитана = Ложь;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры		
		