
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СозданнаяЗаявка = ЗаполнитьЗаявкуСервер(ПараметрКоманды);
	//ОткрытьЗначение(СозданнаяЗаявка);   
	ОткрытьФорму("Документ.WLog_ЗаявкаВЛогистику.Форма.ФормаДокумента", Новый Структура("Ключ", СозданнаяЗаявка), ПараметрыВыполненияКоманды);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗаявкуСервер(МЛОснование) 
	
	//ОткрытьФорму("Документ.WLog_ЗаявкаВЛогистику.ФормаДокумента",,ЭтаФорма); 
	
	НоваяЗаявка = Документы.WLog_ЗаявкаВЛогистику.СоздатьДокумент();  
	НоваяЗаявка.Дата = ТекущаяДата();
	НоваяЗаявка.Комментарий = "#саб МЛ " + СокрЛП(МЛОснование.Номер);
	
	Для Каждого ТекСтрокаМЛ Из МЛОснование.ТабличнаяЧасть Цикл
		НоваяСтрокаЗаявки = НоваяЗаявка.Заявки.Добавить();
		НоваяСтрокаЗаявки.НаименованиеЗаявки = ТекСтрокаМЛ.ЗаказКлиента;
		НоваяСтрокаЗаявки.ИмяКлиента = ТекСтрокаМЛ.ЗаказКлиента.Контрагент;
		НоваяСтрокаЗаявки.Адрес = ТекСтрокаМЛ.ЗаказКлиента.АдресДоставки;
		НоваяСтрокаЗаявки.НачальноеВремяДоставки = ТекСтрокаМЛ.ЗаказКлиента.ДатаДоставки;
		НоваяСтрокаЗаявки.ПоследнееВремяДоставки = ТекСтрокаМЛ.ЗаказКлиента.ДатаДоставкиДо;  
		НоваяСтрокаЗаявки.ИмяКлиента = ТекСтрокаМЛ.ЗаказКлиента.МенеджерКонтрагента;
		НоваяСтрокаЗаявки.НомерТелефона = ТекСтрокаМЛ.ЗаказКлиента.Телефон;
		
		СтрокиEMailКонтрагента = ТекСтрокаМЛ.ЗаказКлиента.Контрагент.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты));
		
		Если СтрокиEMailКонтрагента.Количество() Тогда
			НоваяСтрокаЗаявки.EMail = СтрокиEMailКонтрагента[0].Представление; 
			НоваяСтрокаЗаявки.ЭлПочта = СтрокиEMailКонтрагента[0].АдресЭП;
		КонецЕсли;
		
		НоваяСтрокаЗаявки.Вес = ТекСтрокаМЛ.ВесЗаказа;   
		НоваяСтрокаЗаявки.Объем = ТекСтрокаМЛ.ЗаказКлиента.ТабличнаяЧасть.Итог("Количество");
		НоваяСтрокаЗаявки.Стоимость = ТекСтрокаМЛ.Сумма; 
		НоваяСтрокаЗаявки.СтатусЗаявки = Строка(ТекСтрокаМЛ.Статус);
	КонецЦикла;
	
	НоваяЗаявка.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат НоваяЗаявка.Ссылка;
	
КонецФункции