
Функция ПреобразоватьВНоль(Сумм)
	Если Сумм = Null ИЛИ ПустаяСтрока(Сумм) или Сумм = Неопределено Тогда
		возврат 0;
	конецесли;
	возврат Сумм;
	
	
КонецФункции // Преобразовать()

Функция ПолучитьСумму(ТЗ, ИмяКолонки)
	Сумма = 0;
	РезультатПоиска = ТЗ.Колонки.Найти(ИмяКолонки);
	Если НЕ РезультатПоиска = Неопределено Тогда
		Сумма = ТЗ[0][РезультатПоиска.Имя];	
	КонецЕсли;
	Возврат Сумма;
КонецФункции // ()

Процедура РасчтитатьГруппы(ТЗ, Предприятия, Префикс)
	//расчет групповых статей
		
		//внх дз прочая
		Сумма1 = 0;
 		Сумма1 = Сумма1 + ПолучитьСумму(ТЗ, Префикс + "304");		
		Сумма1 = Сумма1 + ПолучитьСумму(ТЗ, Префикс + "305");
		ТЗ.Колонки.Добавить(Префикс + "1000");
		ТЗ[0][Префикс + "1000"] = Сумма1;
		
		
		//основноеСырье
		Сумма2 = 0;
 		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "167");		
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "168");
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "166");
		ТЗ.Колонки.Добавить(Префикс + "1001");
		ТЗ[0][Префикс + "1001"] = Сумма2;
		
		
		//запасы
 		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "169");		
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "191");
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "175");
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "306");
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "181");
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "201");
		Сумма2 = Сумма2 + ПолучитьСумму(ТЗ, Префикс + "1018");
		ТЗ.Колонки.Добавить(Префикс + "1002");
		ТЗ[0][Префикс + "1002"] = Сумма2;
		
		//прочие дз
		Сумма3 = 0;
		Сумма3 = Сумма3 + ПолучитьСумму(ТЗ, Префикс + "253");
		Сумма3 = Сумма3 + ПолучитьСумму(ТЗ, Префикс + "307");
		ТЗ.Колонки.Добавить(Префикс + "1015");
		ТЗ[0][Префикс + "1015"] = Сумма3;
		
		//прочие деб
		Сумма3 = 0;
 		Сумма3 = Сумма3 + ПолучитьСумму(ТЗ, Префикс + "251");		
		Сумма3 = Сумма3 + ПолучитьСумму(ТЗ, Префикс + "253");
		Сумма3 = Сумма3 + ПолучитьСумму(ТЗ, Префикс + "307");
		Сумма3 = Сумма3 + ПолучитьСумму(ТЗ, Префикс + "252");
		ТЗ.Колонки.Добавить(Префикс + "1003");
		ТЗ[0][Префикс + "1003"] = Сумма3;
		
		//налоги и сборы актив
		Сумма4 = 0;
 		Сумма4 = Сумма4 + ПолучитьСумму(ТЗ, Префикс + "261");		
		Сумма4 = Сумма4 + ПолучитьСумму(ТЗ, Префикс + "262");
		Сумма4 = Сумма4 + ПолучитьСумму(ТЗ, Префикс + "263");
		ТЗ.Колонки.Добавить(Префикс + "1004");
		ТЗ[0][Префикс + "1004"] = Сумма4;
		
		//прибыль партнера
		Сумма5 = 0;
 		Сумма5 = Сумма5 + ПолучитьСумму(ТЗ, Префикс + "212");		
		Сумма5 = Сумма5 + ПолучитьСумму(ТЗ, Префикс + "213");
		Сумма5 = Сумма5 + ПолучитьСумму(ТЗ, Префикс + "214");
			ТЗ.Колонки.Добавить(Префикс + "1005");
			ТЗ[0][Префикс + "1005"] = Сумма5;
		
		//прибыль участников
 		Сумма5 = Сумма5 + ПолучитьСумму(ТЗ, Префикс + "215");		
		Сумма5 = Сумма5 + ПолучитьСумму(ТЗ, Префикс + "211");
			ТЗ.Колонки.Добавить(Префикс + "1006");
			ТЗ[0][Префикс + "1006"] = Сумма5;
		
		//налоги пассив
		Сумма6 = 0;
 		Сумма6 = Сумма6 + ПолучитьСумму(ТЗ, Префикс + "380");		
		Сумма6 = Сумма6 + ПолучитьСумму(ТЗ, Префикс + "381");
		Сумма6 = Сумма6 + ПолучитьСумму(ТЗ, Префикс + "382");
			ТЗ.Колонки.Добавить(Префикс + "1007");
			ТЗ[0][Префикс + "1007"] = Сумма6;
		
		//прочая КЗ
		Сумма7 = 0;
 		Сумма7 = Сумма7 + ПолучитьСумму(ТЗ, Префикс + "394");		
		Сумма7 = Сумма7 + ПолучитьСумму(ТЗ, Префикс + "395");
		Сумма7 = Сумма7 + ПолучитьСумму(ТЗ, Префикс + "396");
		Сумма7 = Сумма7 + ПолучитьСумму(ТЗ, Префикс + "397");
		Сумма7 = Сумма7 + ПолучитьСумму(ТЗ, Префикс + "398");
			ТЗ.Колонки.Добавить(Префикс + "1008");
			ТЗ[0][Префикс + "1008"] = Сумма7;
			
		//сторонняя КЗ
		ТЗ.Колонки.Добавить(Префикс + "1009");
		ТЗ[0][Префикс + "1009"] = Сумма6 + Сумма7;
		
		// ДЗ покупателей
		Сумма8 = 0;
 		Сумма8 = Сумма8 + ПолучитьСумму(ТЗ, Префикс + "241");		
		Сумма8 = Сумма8 + ПолучитьСумму(ТЗ, Префикс + "242");
		ТЗ.Колонки.Добавить(Префикс + "1010");
		ТЗ[0][Префикс + "1010"] = Сумма8;
		
		// МБП
		Сумма11 = 0;
 		Сумма11 = Сумма11 + ПолучитьСумму(ТЗ, Префикс + "175");		
		Сумма11 = Сумма11 + ПолучитьСумму(ТЗ, Префикс + "306");
		Сумма11 = Сумма11 + ПолучитьСумму(ТЗ, Префикс + "176");
		ТЗ.Колонки.Добавить(Префикс + "1013");
		ТЗ[0][Префикс + "1013"] = Сумма11;

		
		//итого актив
		Сумма9 = 0;
		Сумма9 = Сумма9 + ПолучитьСумму(ТЗ, Префикс + "161");
		Сумма9 = Сумма9 + Сумма2;
		Сумма9 = Сумма9 + ПолучитьСумму(ТЗ, Префикс + "221");
		Сумма9 = Сумма9 + Сумма8;
		Сумма9 = Сумма9 + Сумма3;
		Сумма9 = Сумма9 + Сумма4;
		Сумма9 = Сумма9 + ПолучитьСумму(ТЗ, Префикс + "270");
		Сумма9 = Сумма9 + ПолучитьСумму(ТЗ, Префикс + "303");
		Сумма9 = Сумма9 + Сумма1;
		ТЗ.Колонки.Добавить(Префикс + "1011");
		ТЗ[0][Префикс + "1011"] = Сумма9;
		
		//итого пассив
		Сумма10 = 0;
		Сумма10 = Сумма10 + ПолучитьСумму(ТЗ, Префикс + "1014");
		Сумма10 = Сумма10 + Сумма5;
		Сумма10 = Сумма10 + ПолучитьСумму(ТЗ, Префикс + "350");
		Сумма10 = Сумма10 + ПолучитьСумму(ТЗ, Префикс + "360");
		Сумма10 = Сумма10 + Сумма6 + Сумма7;
		Сумма10 = Сумма10 + ПолучитьСумму(ТЗ, Префикс + "400");
		Сумма10 = Сумма10 + ПолучитьСумму(ТЗ, Префикс + "410");
		ТЗ.Колонки.Добавить(Префикс + "1012");
		ТЗ[0][Префикс + "1012"] = Сумма10;
		
		//Казна
		Если Префикс = "ОБ" Тогда
			Сумма11 = ПолучитьСумму(ТЗ, Префикс + "350");
			Сумма11 = Сумма11 + Сумма9 - Сумма10;
			ТЗ.Колонки.Добавить(Префикс + "1016");
			ТЗ[0][Префикс + "1016"] = Сумма11;
			ТЗ[0][Префикс + "1012"] = Сумма9;
		Иначе
			ТЗ.Колонки.Добавить(Префикс + "1017");
			ТЗ[0][Префикс + "1017"] = Сумма9 - Сумма10;
		КонецЕсли;
		

	

КонецПроцедуры

//получает остатки из выборки по счету
//ТипОстатка:
// "Дт" - Дебетовый
// "Кт" - Кредитовый
// "" - Свернутый
Функция ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, Счет, ТипОстатка = "", СубконтоКлюч = "", СубконтоПараметр = "")
	Если НЕ (СубконтоКлюч = "") Тогда
		СтруктураПоиска = Новый Структура("Предприятия, КодСчета, " + СубконтоКлюч, Предприятия, Счет, СубконтоПараметр);	
	Иначе
		СтруктураПоиска = Новый Структура("Предприятия, КодСчета", Предприятия, Счет);	
	КонецЕсли;
	Сумма = 0;
	ВыборкаФакт = РезультатФакт.Выбрать();
	Пока ВыборкаФакт.НайтиСледующий(СтруктураПоиска) Цикл
		Если ТипОстатка = "Дт" Тогда
			Сумма = Сумма + ВыборкаФакт.СуммаОстатокДт;
		ИначеЕсли ТипОстатка = "Кт" Тогда
			Сумма = Сумма + ВыборкаФакт.СуммаОстатокКт;
		Иначе
			Сумма = Сумма + ВыборкаФакт.Сумма;
		КонецЕсли;
	
	КонецЦикла;
    Возврат Сумма;
КонецФункции // ()
 
Функция ОпределитьКвартал(НомерМесяца)
	Если НомерМесяца / 3 <= 1 Тогда
		Возврат 1;
	ИначеЕсли НомерМесяца / 3 > 1 И НомерМесяца / 3 <= 2 Тогда 
		Возврат 2;
	ИначеЕсли  НомерМесяца / 3 > 2 И НомерМесяца / 3 <= 3 Тогда
		Возврат 3;
	ИначеЕсли НомерМесяца / 3 > 3 И НомерМесяца / 3 <= 4 Тогда
		Возврат 4;	
	КонецЕсли; 
КонецФункции // ()

Процедура ЗаполнитьТаблицу(ТабДок, ПараметрКоманды) Экспорт
	ТабДок.Очистить();
	//при выборе сценария факта в одном из полей Сценарий
	ПланСчетов1 = ?(ПараметрКоманды.Сценарий1 = Справочники.СценарииПланирования.Факт, ПланыСчетов.Учетный, ПланыСчетов.Учетный);
	ПланСчетов2 = ?(ПараметрКоманды.Сценарий2 = Справочники.СценарииПланирования.Факт, ПланыСчетов.Учетный, ПланыСчетов.Учетный);
	Регистр1 = ?(ПараметрКоманды.Сценарий1 = Справочники.СценарииПланирования.Факт, "Учетный", "Бюджетный");
	Регистр2 = ?(ПараметрКоманды.Сценарий2 = Справочники.СценарииПланирования.Факт, "Учетный", "Бюджетный");
	
	
	
	Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий1) и  НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2) Тогда
		Макет = Отчеты.Д_ОборотныйБаланс.ПолучитьМакет("МакетПланФакт");
	иначе
		Если ПараметрКоманды.Сценарий1 = Справочники.СценарииПланирования.Факт Тогда
			Если ПараметрКоманды.ВидСХ Тогда
				Макет = Отчеты.Д_ОборотныйБаланс.ПолучитьМакет("ФактСХ");
			Иначе
				Макет = Отчеты.Д_ОборотныйБаланс.ПолучитьМакет("Факт");		
			КонецЕсли;			
		Иначе
			Макет = Отчеты.Д_ОборотныйБаланс.ПолучитьМакет("Макет");		
		КонецЕсли;
		
	КонецЕсли; 
	
	//ОбластьШапка = Макет.ПолучитьОбласть("Шапка|СтолбецНачало");
	//ОбластьШапкаСтолбцы = Макет.ПолучитьОбласть("Шапка|ДанныеСтолбца");
	
	ВставлятьРазделительСтраниц = Ложь;
	
	
	
	Интервал = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, 1, ?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, 3, 12));
	
	КлючПериод = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, "Месяц", ?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, "Квартал", "Год"));
	
	КлючДни = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, "30", ?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, "90", "365"));
	
	НачалоПериода = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, Месяц(ПараметрКоманды.Период.ДатаНачала),?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, ОпределитьКвартал(Месяц(ПараметрКоманды.Период.ДатаНачала)), Год(ПараметрКоманды.Период.ДатаНачала)));
	
	КонецПериода = ?(ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Помесячно, Месяц(ПараметрКоманды.Период.ДатаОкончания),?(
	ПараметрКоманды.Интервал = Перечисления.Д_Интервал.Поквартально, ОпределитьКвартал(Месяц(ПараметрКоманды.Период.ДатаОкончания)), Год(ПараметрКоманды.Период.ДатаОкончания)));
	
	
	ВсегоПериодов = КонецПериода - НачалоПериода + 1;
	
	СчетчикПредприятий = 0;
	
	
	ПредприятияМассив = Новый Массив;
	МассивПредприятийДляВыборки = Новый Массив;
	
	Для каждого Т Из ПараметрКоманды.Предприятие Цикл
		Если Т.Пометка Тогда
			ПредприятияМассив.Добавить(Т.Значение);
			МассивПредприятийДляВыборки.Добавить(Т.Значение);
		КонецЕсли;
	КонецЦикла;
	
	
	
	Если ПараметрКоманды.Сводный Тогда
		ПредприятияМассив = Новый Массив;
		ПредприятияМассив.Добавить("Сводный");	
	КонецЕсли;
	
	
	Предпр = Т.Значение;
	ДатаНач = ПараметрКоманды.Период.ДатаНачала;
	ДатаКон = ПараметрКоманды.Период.ДатаОкончания;
	СчетчикМесяцев = 0;
	СчетчикНоменклатур = 0;
	КоэффициентОтступа = 0;
	
	
	
	//считаем лимиты
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БюджетныйОбороты.Субконто1.Код КАК КодСчета,
	               |	ВЫБОР
	               |		КОГДА (НЕ БюджетныйОбороты.СуммаОборотДт = 0)
	               |			ТОГДА БюджетныйОбороты.СуммаОборот
	               |		ИНАЧЕ -БюджетныйОбороты.СуммаОборот
	               |	КОНЕЦ КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА &Сводный = ИСТИНА
	               |			ТОГДА ""Сводный""
	               |		ИНАЧЕ БюджетныйОбороты.Предприятия
	               |	КОНЕЦ КАК Предприятия
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			Месяц,
	               |			Счет = &Счет1,
	               |			,
	               |			СценарийПлана = &Сценарий1
	               |				И Предприятия В ИЕРАРХИИ (&Предприятия),
	               |			,
	               |			) КАК БюджетныйОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	БюджетныйОбороты.Субконто1.Код";
	
	Запрос.УстановитьПараметр("Предприятия", МассивПредприятийДляВыборки);
	Запрос.УстановитьПараметр("Сценарий1", ПараметрКоманды.Сценарий1);
	Запрос.УстановитьПараметр("Сценарий2", ПараметрКоманды.Сценарий2);
	Запрос.УстановитьПараметр("Дата1", ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ДатаКон);
	Запрос.УстановитьПараметр("Счет1", ПланыСчетов.Учетный.СчетЛИМ());
	Запрос.УстановитьПараметр("Сводный", ПараметрКоманды.Сводный);
	
	Результат = Запрос.Выполнить();
	
	//считаем остатки по счетам
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БюджетныйОстатки.Счет.Код КАК КодСчета,
	               |	СУММА(БюджетныйОстатки.СуммаОстаток) КАК Сумма,
	               |	СУММА(БюджетныйОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
	               |	СУММА(БюджетныйОстатки.СуммаОстатокКт) КАК СуммаОстатокКт,
	               |	БюджетныйОстатки.Субконто1.ТипУчредителя КАК ТипУчредителя,
	               |	БюджетныйОстатки.Субконто1.Ссылка КАК ВидНалога,
	               |	БюджетныйОстатки.Субконто1.Д_ВидКонтрагента КАК ВидКонтрагента,
	               |	ВЫБОР
	               |		КОГДА &Сводный = ИСТИНА
	               |			ТОГДА ""Сводный""
	               |		ИНАЧЕ БюджетныйОстатки.Предприятия
	               |	КОНЕЦ КАК Предприятия
	               |ИЗ
	               |	РегистрБухгалтерии." + ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), Регистр1, Регистр2) + ".Остатки(
	               |			&Дата2,
	               |			,
	               |			,
	               |			СценарийПлана = &Сценарий2
	               |				И Предприятия В ИЕРАРХИИ (&Предприятия)) КАК БюджетныйОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОстатки.Счет.Код,
	               |	БюджетныйОстатки.Субконто1.ТипУчредителя,
	               |	БюджетныйОстатки.Субконто1.Ссылка,
	               |	БюджетныйОстатки.Субконто1.Д_ВидКонтрагента,
	               |	ВЫБОР
	               |		КОГДА &Сводный = ИСТИНА
	               |			ТОГДА ""Сводный""
	               |		ИНАЧЕ БюджетныйОстатки.Предприятия
	               |	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Предприятия", МассивПредприятийДляВыборки);
	//Запрос.УстановитьПараметр("Сценарий1", ПараметрКоманды.Сценарий1);
	Запрос.УстановитьПараметр("Сценарий2", ?(ПустаяСтрока(ПараметрКоманды.Сценарий2), ПараметрКоманды.Сценарий1, ПараметрКоманды.Сценарий2));
	Запрос.УстановитьПараметр("Дата1", ДатаНач);
	Запрос.УстановитьПараметр("Дата2", ДатаКон);
	Запрос.УстановитьПараметр("Сводный", ПараметрКоманды.Сводный);
	
	Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2) ИЛИ ПараметрКоманды.Сценарий1 = Справочники.СценарииПланирования.Факт Тогда
		РезультатФакт = Запрос.Выполнить();
	Иначе
		РезультатФакт = Неопределено;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Д_СтатьиОборотки.Код
	|ИЗ
	|	Справочник.Д_СтатьиОборотки КАК Д_СтатьиОборотки";
	

	РезультатОБ = Запрос.Выполнить();
	
	
	
	ОбластьДанные = Макет.ПолучитьОбласть("ДанныеСтроки");
	
	Для каждого Предприятия Из ПредприятияМассив Цикл
		
		ОбластьДанные.Параметры.Предприятия = Предприятия;
		ОбластьДанные.Параметры.Дата1 = ПараметрКоманды.Период.ДатаОкончания;
		
		СтруктураПоиска = Новый Структура("Предприятия", Предприятия);
		Выборка = Результат.Выбрать();
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Добавить();
		
		//добавляем колонки с нулевыми значениями
		ВыборкаОБ = РезультатОБ.Выбрать();
	    Пока ВыборкаОБ.Следующий() Цикл
	    	ИмяКолонки = СокрЛП(Строка(ВыборкаОБ.Код));
			ТЗ.Колонки.Добавить(ИмяКолонки);
			ТЗ[0][ИмяКолонки] = 0;
		КонецЦикла;

		//заполняем значения
		Пока Выборка.НайтиСледующий(СтруктураПоиска) Цикл
			ИмяКолонки = СокрЛП(Строка(Выборка.КодСчета));
			ТЗ[0][ИмяКолонки] = Выборка.Сумма;		
		КонецЦикла;
		
		РасчтитатьГруппы(ТЗ, Предприятия, "ОБ");
		

		Если НЕ ПустаяСтрока(ПараметрКоманды.Сценарий2) ИЛИ ПараметрКоманды.Сценарий1 = Справочники.СценарииПланирования.Факт Тогда
			ТЗ2 = Новый ТаблицаЗначений;
			ТЗ2.Добавить();

			//01+08
			ИмяКолонки = "фОб161";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "01") 
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "08.01") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "08.02");
				
			//10.1
			ИмяКолонки = "фОб166";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "10.01");
			
			//60.1Дт
			ИмяКолонки = "фОб167";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.01", "Дт");
			
			//10.2 + 60.2Дт
			ИмяКолонки = "фОб169";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "10.02") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.02", "Дт");
			
			//10.3 + 10.4 + 10.5
			ИмяКолонки = "фОб175";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "10.03") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "10.04")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "10.05") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.04", "Дт");
			
			//10.7
			ИмяКолонки = "фОб306";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "10.07");
			
			//10.6
			ИмяКолонки = "фОб176";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "10.06");
			
			//11
			ИмяКолонки = "фОб1018";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ?(ПараметрКоманды.ВидСХ, ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "11"), 0);
			
			//20
			ИмяКолонки = "фОб181";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "20");
			
			//43
			ИмяКолонки = "фОб191";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "43");
			
			//43
			ИмяКолонки = "фОб201";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "41");
			
			//50+51
			ИмяКолонки = "фОб221";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "50.01")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "50.02")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "51.01")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "51.02")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "51")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "50");
			
			//62Дт
			ИмяКолонки = "фОБ241";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "62.01", "Дт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "62.02", "Дт") 
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "62.03", "Дт");
			
			//60.3Дт + 76Дт + 71
			ИмяКолонки = "фОб307";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.03", "Дт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.01", "Дт") 
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.02", "Дт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.03", "Дт") 
					+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.05", "Дт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "71.01") 
						+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "71.02") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "71.03") 
							+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.06", "Дт");
						
			//68Дт
			ИмяКолонки = "фОб263";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "68", "Дт");
			
			//97
			ИмяКолонки = "фОб270";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "97");
			
			//79Дт
			ИмяКолонки = "фОБ305";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "79.01", "Дт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "79.02", "Дт")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "79.03", "Дт");
			
			//83 + 75.1
			ИмяКолонки = "фОб1014";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "83.01") - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "83.02") 
				- ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "75.01");
			
			//75.2 + 75.3 Врн
			ИмяКолонки = "фОб211";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			Врн = Справочники.Д_СтатьиОборотки.Воронеж;
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "75.02",, "ТипУчредителя", Врн);
			//партнер
			ИмяКолонки = "фОБ212";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			Партнер1 = Справочники.Д_СтатьиОборотки.Партнер1;
			Партнер2 = Справочники.Д_СтатьиОборотки.Партнер2;
			Партнер3 = Справочники.Д_СтатьиОборотки.Партнер3;
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "75.02",, "ТипУчредителя", Партнер1)- ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "75.02",, "ТипУчредителя", Партнер2) 
					- ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "75.02",, "ТипУчредителя", Партнер3);
			//Z
			ИмяКолонки = "фОб215";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			Z = Справочники.Д_СтатьиОборотки.Z;
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "75.02",, "ТипУчредителя", Z);
			
			//55.1 + 55.2
			ИмяКолонки = "фОб350";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "55");

			
			//67.1 + 67.2
			ИмяКолонки = "фОб360";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "67.01") - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "67.02");
			
			//68Кт
			//Акциз
			ИмяКолонки = "фОб380";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			//Акциз = Справочники.НалогиИСборы.Акциз;
			//ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "68", "Кт", "ВидНалога", Акциз);
			ТЗ2[0][ИмяКолонки] = 0;
			//НДС
			ИмяКолонки = "фОб381";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			//НДС = Справочники.НалогиИСборы.НДС;
			//ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "68", "Кт", "ВидНалога", НДС);
			ТЗ2[0][ИмяКолонки] = 0;
			//прочие налоги
			ИмяКолонки = "фОб382";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "68", "Кт") - ТЗ2[0]["фОб380"] - ТЗ2[0]["фОб381"];

			
			
			//60.3Кт + 76.1Кт + 76.2Кт + 76.3Кт + 76.5Кт + 60.1Кт + 60.2Кт + 60.4Кт + 60.5Кт + 60.6Кт
			ИмяКолонки = "фОБ394";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.01", "Кт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.02", "Кт");
			ИмяКолонки = "фОБ395";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "70");
			ИмяКолонки = "фОБ396";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.01", "Кт");
			ИмяКолонки = "фОБ397";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "62.01", "Кт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "62.02", "Кт")
									+  ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "62.03", "Кт");
			ИмяКолонки = "фОБ398";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.03", "Кт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.03", "Кт")
					+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "76.05", "Кт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.02", "Кт") 
						+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.04", "Кт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.05", "Кт") 
							+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "60.06", "Кт");
							
					
			//79Кт
			ИмяКолонки = "фОб400";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "79.01", "Кт") + ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "79.02", "Кт")
				+ ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "79.03", "Кт");
				
			//98
			ИмяКолонки = "фОб410";
			ТЗ2.Колонки.Добавить(ИмяКолонки);
			ТЗ2[0][ИмяКолонки] = - ПолучитьОстатокПоСчету(РезультатФакт, Предприятия, "98");
			
			
			РасчтитатьГруппы(ТЗ2, Предприятия, "фОБ");
			
			Для каждого ТекСтрока Из ТЗ2 Цикл
				ОбластьДанные.Параметры.Заполнить(ТекСтрока);
			КонецЦикла;
		КонецЕсли;
		
		Для каждого ТекСтрока Из ТЗ Цикл
			ОбластьДанные.Параметры.Заполнить(ТекСтрока);
		КонецЦикла;
		ТабДок.Вывести(ОбластьДанные,);

	КонецЦикла; 
	

	
КонецПроцедуры

