
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
			Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	//д1 14.12.17
	Для Каждого Запись Из ЭтотОбъект Цикл //цикл норма, т.к. запись одна в наборе
		Если ЗначениеЗаполнено(Запись.БанковскиеСчета) И ТипЗнч(Запись.БанковскиеСчета) = Тип("СправочникСсылка.Кассы") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Д_ИсточникППСрезПоследних.Предприятие КАК Предприятие
			|ИЗ
			|	РегистрСведений.Д_ИсточникПП.СрезПоследних(, БанковскиеСчета = &БанковскийСчет) КАК Д_ИсточникППСрезПоследних";
			
			Запрос.УстановитьПараметр("БанковскийСчет", Запись.БанковскиеСчета);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				КассаОбъект = Запись.БанковскиеСчета.ПолучитьОбъект();
				КассаОбъект.Предприятие = Выборка.Предприятие;
				КассаОбъект.Записать();
			КонецЦикла;

			
		КонецЕсли;
	КонецЦикла;//конец
КонецПроцедуры
