Процедура ДобавитьЗапись(ДатаДействия,Пользователь,ДействияПриИзмененииПлатежногоКалендаря,Документ,Сумма,Дополнительно) Экспорт
	МенеджерЗаписи = РегистрыСведений.сабИсторияИзмененийПлатежногоКалендаря.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДатаДействия = ДатаДействия;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.ДействияПриИзмененииПлатежногоКалендаря = ДействияПриИзмененииПлатежногоКалендаря;
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Сумма = Сумма;
	МенеджерЗаписи.Дополнительно = Дополнительно;
	МенеджерЗаписи.Записать();
КонецПроцедуры