
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Казна 
	ТаблицаДвижений = ПроцентныеНачисления.Выгрузить();
	ТаблицаДвижений.Свернуть("Предприятие,Счет,Субконто1,Субконто2", "Сумма");
	
	Движения.Учетный.Записывать = Истина;
	
	Если ВидОперации = Перечисления.ВидыОперацийПроцентыПоКредитам.ПроцентыПоКазне Тогда
		
		Для Каждого ТекСтрокаПроцентныеНачисления Из ТаблицаДвижений Цикл
			Движение = Движения.Учетный.Добавить();
			Движение.Период = Дата;
			Движение.Предприятия = Предприятие;
			Если ВидОстатка = "дебетовый" Тогда
				Движение.СчетДт = ПланыСчетов.Учетный.Счет5501();    			
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Предприятия", Истина)] = ТекСтрокаПроцентныеНачисления.Предприятие;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = Статья;
				Движение.СчетКт = КоррСчет;
				Если ЗначениеЗаполнено(Субконто1) Тогда
					УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт, Движение.СчетКт, 1, Субконто1);
				КонецЕсли;	
				Если ЗначениеЗаполнено(Субконто2) Тогда
					УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт, Движение.СчетКт, 2, Субконто2);
				КонецЕсли;
				Если ЗначениеЗаполнено(Субконто3) Тогда
					УЧ_Сервер.УстановитьСубконто(Движение.СубконтоКт, Движение.СчетКт, 3, Субконто3);
				КонецЕсли;	
				Если Движение.СчетКт.УчетПоПодразделениям Тогда
					Движение.ПодразделениеКт = Предприятие.ВидДеятельности;
				КонецЕсли;	
			Иначе
				Движение.СчетКт = ПланыСчетов.Учетный.Счет5501();    			
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Предприятия", Истина)] = ТекСтрокаПроцентныеНачисления.Предприятие;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = Статья;
				Движение.СчетДт = КоррСчет;
				Если ЗначениеЗаполнено(Субконто1) Тогда
					УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт, Движение.СчетДт, 1, Субконто1);
				КонецЕсли;	
				Если ЗначениеЗаполнено(Субконто2) Тогда
					УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт, Движение.СчетДт, 2, Субконто2);
				КонецЕсли;
				Если ЗначениеЗаполнено(Субконто3) Тогда
					УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт, Движение.СчетДт, 3, Субконто3);
				КонецЕсли;
				Если Движение.СчетДт.УчетПоПодразделениям Тогда
					Движение.ПодразделениеДт = Предприятие.ВидДеятельности;
				КонецЕсли;	
			КонецЕсли;
			Движение.Сумма = ТекСтрокаПроцентныеНачисления.Сумма;
		КонецЦикла;	
	Иначе	
		Для Каждого ТекСтрокаПроцентныеНачисления Из КредитыИЗаймы Цикл
			
			сабОбщегоНазначения.НоваяСтрокаРегистраБух(
			Движения,
			Дата,
			Предприятие,
			Справочники.СценарииПланирования.НайтиПоНаименованию("Факт", Истина),
			"начислены проценты",
			КоррСчет,
			Субконто1,
			Субконто2,
			Субконто3,
			Предприятие.ВидДеятельности,
			,
			,
			,
			ТекСтрокаПроцентныеНачисления.СчетНачисления,
			ТекСтрокаПроцентныеНачисления.Субконто1,
			ТекСтрокаПроцентныеНачисления.Субконто2,
			,
			Предприятие.ВидДеятельности,
			,
			,
			,
			?(ТекСтрокаПроцентныеНачисления.Сумма = ТекСтрокаПроцентныеНачисления.СуммаКт, ТекСтрокаПроцентныеНачисления.Сумма, -ТекСтрокаПроцентныеНачисления.Сумма),
			ТекСтрокаПроцентныеНачисления.Сумма = ТекСтрокаПроцентныеНачисления.СуммаКт,
			,
			);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = ПроцентныеНачисления.Итог("Сумма");
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	сабОбщегоНазначенияБУХ.сабОбработкиЗаполненияУчпетныхДокументовОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры


