
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресВХранилище") Тогда
		
		СтруктураВХранилище = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
		СтруктураВХранилище.Свойство("Штрихкод", Штрихкод);
		СтруктураВХранилище.Свойство("МагнитныйКод", МагнитныйКод);
		Элементы.ТаблицаВыбораВыбрана.Видимость = Ложь;
		Элементы.ТаблицаВыбораКодПоиска.Видимость = Ложь;
		СтрокаЗаголовка = "";
		Если ЗначениеЗаполнено(Штрихкод) Тогда
			СтрокаЗаголовка = НСтр("ru = 'Выбор данных поиска по штрихкоду %1'");
			СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаЗаголовка, Штрихкод);
		Иначе
			СтрокаЗаголовка = НСтр("ru = 'Выбор данных поиска по магнитному коду %1'");
			СтрокаЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаЗаголовка, МагнитныйКод);
		КонецЕсли;
		ЭтотОбъект.Заголовок = СтрокаЗаголовка;
		ЭтотОбъект.АвтоЗаголовок = Ложь;
		ТаблицаВХранилище = СтруктураВХранилище.ТаблицаВыбора;
		СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
		Для Каждого СтрокаХранилища Из ТаблицаВХранилище Цикл
			НоваяСтрока = СтрокиДерева.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаХранилища);
			Если ЗначениеЗаполнено(СтрокаХранилища.Карта) Тогда
				НоваяСтрока.ПредставлениеОбъекта = "" + СтрокаХранилища.Карта + " (" + СтрокаХранилища.ТипКарты + ")";
				Если СтрокаХранилища.ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная Тогда
					НоваяСтрока.ЭтоРегистрационнаяКарта = Истина;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(СтрокаХранилища.СерийныйНомер) Тогда
				НоваяСтрока.ПредставлениеОбъекта = "" + СтрокаХранилища.СерийныйНомер + " (" + СтрокаХранилища.Номенклатура + ")";
			Иначе
				НоваяСтрока.ПредставлениеОбъекта = "" + СтрокаХранилища.Номенклатура + ", " + СтрокаХранилища.Характеристика + ", " + СтрокаХранилища.Упаковка;
			КонецЕсли;
		КонецЦикла;
		Элементы.ТаблицаВыбора.ТолькоПросмотр = Истина;
	ИначеЕсли Параметры.Свойство("ПовторяющиесяШтрихкоды") Тогда
		
		ЕстьПовторяющиесяШтрихкоды = Истина;
		
		ЭтотОбъект.Заголовок = НСтр("ru = 'Выбор данных поиска'");
		ЭтотОбъект.АвтоЗаголовок = Ложь;
		ПовторяющиесяШтрихкоды = Параметры.ПовторяющиесяШтрихкоды;
		СтрокиДерева = ДеревоВыбора.ПолучитьЭлементы();
		ПоследнийШтрихкод = "";
		Для Каждого СтрокаШтрихкода Из ПовторяющиесяШтрихкоды.ЗначенияПоиска Цикл
			Если ПоследнийШтрихкод <> СтрокаШтрихкода.Штрихкод Тогда
				НоваяСтрокаРодитель = СтрокиДерева.Добавить();
				НоваяСтрокаРодитель.КодПоиска = СтрокаШтрихкода.Штрихкод;
				ПодчиненныеСтроки = НоваяСтрокаРодитель.ПолучитьЭлементы();
				ПоследнийШтрихкод = СтрокаШтрихкода.Штрихкод;
			КонецЕсли;
			НоваяСтрока = ПодчиненныеСтроки.Добавить();
			НоваяСтрока.КодПоиска = СтрокаШтрихкода.Штрихкод;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШтрихкода);
			Если СтрокаШтрихкода.Свойство("Карта") Тогда
				НоваяСтрока.ПредставлениеОбъекта = "" + СтрокаШтрихкода.Карта + " (" + СтрокаШтрихкода.ТипКарты + ")";
				Если СтрокаШтрихкода.ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная Тогда
					НоваяСтрока.ЭтоРегистрационнаяКарта = Истина;
				КонецЕсли;
			ИначеЕсли СтрокаШтрихкода.Свойство("СерийныйНомер") Тогда
				НоваяСтрока.ПредставлениеОбъекта = "" + СтрокаШтрихкода.СерийныйНомер + " (" + СтрокаШтрихкода.Номенклатура + ")";
			Иначе
				НоменклатураСтрока = ?(СтрокаШтрихкода.Свойство("Номенклатура"), СтрокаШтрихкода.Номенклатура, "");
				ХарактеристикаСтрока = ?(СтрокаШтрихкода.Свойство("Характеристика"), СтрокаШтрихкода.Характеристика, "");
				УпаковкаСтрока = ?(СтрокаШтрихкода.Свойство("Упаковка"), СтрокаШтрихкода.Упаковка, "");
				НоваяСтрока.ПредставлениеОбъекта = "" + НоменклатураСтрока + ", " + ХарактеристикаСтрока + ", " + УпаковкаСтрока;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаВыбора;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВыбора

&НаКлиенте
Процедура ТаблицаВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЕстьПовторяющиесяШтрихкоды Тогда
		Закрыть(ПодготовитьСтруктуруВыбора());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВыбранаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПодчиненныеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
			ПодчиненнаяСтрока.Выбрана = ТекущаяСтрока.Выбрана;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодготовитьСтруктуруВыбора()
	
	СтруктураРезультат = ПодключаемоеОборудованиеРТВызовСервера.СтруктураДанныхПоиска();
	СтруктураРезультат.НеизвестныеДанныеПО = Ложь;
	
	Если ЕстьПовторяющиесяШтрихкоды Тогда
		СтрокиКодов = ДеревоВыбора.ПолучитьЭлементы();
		Для Каждого СтрокаКода Из СтрокиКодов Цикл
			ПодчиненныеСтроки = СтрокаКода.ПолучитьЭлементы();
			Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
				Если ПодчиненнаяСтрока.Выбрана Тогда
					СтруктураСтроки = Новый Структура;
					СтруктураСтроки.Вставить("Штрихкод", СтрокаКода.КодПоиска);
					СтруктураСтроки.Вставить("МагнитныйКод", "");
					СтруктураСтроки.Вставить("ДанныеПО",  СтрокаКода.КодПоиска);
					
					СтруктураРезультат.ДанныеПО = Штрихкод;
					СтруктураРезультат.ТипДанныхПО = "Штрихкод";
					СтруктураСтроки.Вставить("ТипШтрихкода", ПодчиненнаяСтрока.ТипШтрихкода);
					
					Если ЗначениеЗаполнено(ПодчиненнаяСтрока.СерийныйНомер) Тогда
						СтруктураСтроки.Вставить("СерийныйНомер", ПодчиненнаяСтрока.СерийныйНомер);
						СтруктураСтроки.Вставить("Номенклатура", ПодчиненнаяСтрока.Номенклатура);
					ИначеЕсли ЗначениеЗаполнено(ПодчиненнаяСтрока.Карта) Тогда
						СтруктураСтроки.Вставить("Карта", ПодчиненнаяСтрока.Карта);
						СтруктураСтроки.Вставить("ВладелецКарты", ПодчиненнаяСтрока.ВладелецКарты);
						СтруктураСтроки.Вставить("ТипКарты", ПодчиненнаяСтрока.ТипКарты);
						СтруктураСтроки.Вставить("ЭтоРегистрационнаяКарта", ПодчиненнаяСтрока.ЭтоРегистрационнаяКарта);
					Иначе
						
						СтруктураСтроки.Вставить("Номенклатура", ПодчиненнаяСтрока.Номенклатура);
						СтруктураСтроки.Вставить("Характеристика", ПодчиненнаяСтрока.Характеристика);
						СтруктураСтроки.Вставить("Упаковка", ПодчиненнаяСтрока.Упаковка);
						СтруктураСтроки.Вставить("Количество", ПодчиненнаяСтрока.Количество);
					КонецЕсли;
					
					СтруктураРезультат.ЗначенияПоиска.Добавить(СтруктураСтроки);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		ТекущиеДанные = Элементы.ТаблицаВыбора.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			СтруктураСтроки = Новый Структура;
			Если ЗначениеЗаполнено(Штрихкод) Тогда
				СтруктураСтроки.Вставить("Штрихкод", Штрихкод);
				СтруктураСтроки.Вставить("МагнитныйКод", "");
				СтруктураСтроки.Вставить("ДанныеПО", Штрихкод);
				
				СтруктураРезультат.ДанныеПО = Штрихкод;
				СтруктураРезультат.ТипДанныхПО = "Штрихкод";
			Иначе
				СтруктураСтроки.Вставить("Штрихкод", "");
				СтруктураСтроки.Вставить("МагнитныйКод", МагнитныйКод);
				СтруктураСтроки.Вставить("ДанныеПО", МагнитныйКод);
				СтруктураРезультат.ДанныеПО = МагнитныйКод;
				СтруктураРезультат.ТипДанныхПО = "МагнитныйКод";
			КонецЕсли;
			СтруктураСтроки.Вставить("ТипШтрихкода", ТекущиеДанные.ТипШтрихкода);
			
			Если ЗначениеЗаполнено(ТекущиеДанные.СерийныйНомер) Тогда
				СтруктураСтроки.Вставить("СерийныйНомер", ТекущиеДанные.СерийныйНомер);
				СтруктураСтроки.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
			ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Карта) Тогда
				СтруктураСтроки.Вставить("Карта", ТекущиеДанные.Карта);
				СтруктураСтроки.Вставить("ВладелецКарты", ТекущиеДанные.ВладелецКарты);
				СтруктураСтроки.Вставить("ТипКарты", ТекущиеДанные.ТипКарты);
				СтруктураСтроки.Вставить("ЭтоРегистрационнаяКарта", ТекущиеДанные.ЭтоРегистрационнаяКарта);
			Иначе
				
				СтруктураСтроки.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
				СтруктураСтроки.Вставить("Характеристика", ТекущиеДанные.Характеристика);
				СтруктураСтроки.Вставить("Упаковка", ТекущиеДанные.Упаковка);
				СтруктураСтроки.Вставить("Количество", ТекущиеДанные.Количество);
			КонецЕсли;
			
			СтруктураРезультат.ЗначенияПоиска.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

#КонецОбласти
