
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//меняем наименование пользователя по последней должности
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ДолжностиПользователяСрезПоследних.Период
	//               |ИЗ
	//               |	РегистрСведений.ДолжностиПользователя.СрезПоследних(, Пользователь = &Пользователь) КАК ДолжностиПользователяСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Пользователь", Запись.Пользователь);
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//ПоследняяЗапись = Дата('00010101000000');
	//Пока Выборка.Следующий() Цикл
	//	ПоследняяЗапись = Выборка.Период;
	//КонецЦикла;
	//
	//Если Запись.Период >= ПоследняяЗапись Тогда
	//	
	//	ТекНаимПользователя = Строка(Запись.Пользователь);
	//	НовоеНаимПользователя = Запись.Пользователь.ИмяПользователя + ?(ЗначениеЗаполнено(Запись.Должность), " (" + Строка(Запись.Должность) + ")", "");
	//	
	//	Если НЕ ТекНаимПользователя = НовоеНаимПользователя Тогда
	//		ТекОб = Запись.Пользователь.ПолучитьОбъект();
	//		ТекОб.Наименование = НовоеНаимПользователя;
	//		ТекОб.Записать();
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//ОповеститьОбИзменении(Запись.Сотрудник);
КонецПроцедуры
