
Перем ЭтоНовыйОбъект;

Процедура ПриЗаписи(Отказ)
		
	Если ЭтоНовыйОбъект Тогда
		СоздатьЗаписиПлановыхВалютныхРегистров();
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВалютаПредприятийСрезПоследних.Предприятие,
		               |	ВалютаПредприятийСрезПоследних.Сценарий,
		               |	ВалютаПредприятийСрезПоследних.Валюта
		               |ИЗ
		               |	РегистрСведений.Б_ПараметрыБюджета КАК ВалютаПредприятийСрезПоследних
		               |ГДЕ
		               |	ВалютаПредприятийСрезПоследних.Сценарий = &Сценарий";
		
		Запрос.УстановитьПараметр("Сценарий", Ссылка);			   
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Не Выборка.Количество() Тогда
			СоздатьЗаписиПлановыхВалютныхРегистров();
		Иначе
			
			Пока Выборка.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(Выборка.Валюта) Тогда
					СоздатьЗаписиПлановыхВалютныхРегистров();
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Истина Тогда
		НоваяЗапись = РегистрыСведений.Б_ПлановыеКурсыВалют.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сценарий = Ссылка;
		НоваяЗапись.Период = ?(АктуальнаяДата = Дата('00010101'), Дата('20000101'), АктуальнаяДата);
		НоваяЗапись.Валюта1 = УЧ_Сервер.НациональнаяВалюта();
		НоваяЗапись.Валюта2 = УЧ_Сервер.НациональнаяВалюта();
		НоваяЗапись.Курс = 1;
		НоваяЗапись.Записать();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СценарииПланирования.Ссылка
	|ИЗ
	|	Справочник.СценарииПланирования КАК СценарииПланирования
	|ГДЕ
	|	СценарииПланирования.ДатаНачала = &ДатаНачала
	|	И СценарииПланирования.ДатаКонца = &ДатаКонца
	|	И СценарииПланирования.ВидБюджета = &ВидБюджета";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	Запрос.УстановитьПараметр("ВидБюджета", ВидБюджета);
	
	
	Результат = Запрос.Выполнить();
	Колич = Результат.Выбрать().Количество();
	
	Ошибка = ?(ЗначениеЗаполнено(Ссылка), Колич > 1, Колич);
	
	//Если Ошибка Тогда
	//	сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(
	//	ЭтотОбъект,
	//	"Вид сценария родителя не должен совпадать с текущим видом.",
	//	,
	//	,
	//	"ВидБюджета",
	//	Отказ);
	//КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ЭтоНовыйОбъект = Истина
	Иначе
		ЭтоНовыйОбъект = Ложь
	КонецЕсли;
	
	//подписка на событие
	БюджетныйНаСервере.ПередЗаписиЭлементовСправочниковПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура СоздатьЗаписиПлановыхВалютныхРегистров()
		
	// запись в регистр "Валюта предприятий"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВалютаПредприятийСрезПоследних.Предприятие,
	               |	ВалютаПредприятийСрезПоследних.Сценарий,
	               |	ВалютаПредприятийСрезПоследних.Валюта
	               |ИЗ
	               |	РегистрСведений.Б_ПараметрыБюджета КАК ВалютаПредприятийСрезПоследних
	               |ГДЕ
	               |	ВалютаПредприятийСрезПоследних.Сценарий = &СценарийРодитель
	               |	И ВалютаПредприятийСрезПоследних.Предприятие.ЭтоГруппа = ЛОЖЬ
	               |	И ВалютаПредприятийСрезПоследних.Предприятие.ПометкаУдаления = ЛОЖЬ";
				   
	Запрос.УстановитьПараметр("СценарийРодитель", Ссылка.Родитель);			   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() Тогда 
		
		Пока Выборка.Следующий() Цикл
			
			// если не заполнена валюта по сценарию родителю
			Если ЗначениеЗаполнено(Ссылка.Родитель) Тогда
				НаборЗаписей = РегистрыСведений.Б_ПараметрыБюджета.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Предприятие.Установить(Выборка.Предприятие);
				НаборЗаписей.Отбор.Сценарий.Установить(Ссылка.Родитель);
				НаборЗаписей.Прочитать();
				
				Если Не НаборЗаписей.Количество() Тогда
					НоваяЗапись = РегистрыСведений.Б_ПараметрыБюджета.СоздатьМенеджерЗаписи();
					НоваяЗапись.Предприятие = Выборка.Предприятие;
					НоваяЗапись.Сценарий = Ссылка.Родитель;
					НоваяЗапись.Валюта = Выборка.Предприятие.ОсновнаяВалютаУчета;	
					НоваяЗапись.Записать();
				Иначе
					ТекущаяЗапись = НаборЗаписей[0];
					
					Если Не ЗначениеЗаполнено(ТекущаяЗапись.Валюта) Тогда 
						ТекущаяЗапись.Валюта = Выборка.Предприятие.ОсновнаяВалютаУчета;
						НаборЗаписей.Записать();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.Б_ПараметрыБюджета.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Предприятие.Установить(Выборка.Предприятие);
			НаборЗаписей.Отбор.Сценарий.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			
			Если НЕ НаборЗаписей.Количество() Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Предприятие = Выборка.Предприятие;
				НоваяЗапись.Сценарий = Ссылка;
				НоваяЗапись.Валюта = Выборка.Валюта;	
			Иначе
				ТекущаяЗапись = НаборЗаписей[0];
				
				Если Не ЗначениеЗаполнено(ТекущаяЗапись.Валюта) Тогда 
					ТекущаяЗапись.Валюта = Выборка.Валюта;
				КонецЕсли;
				
			КонецЕсли;
			
			НаборЗаписей.Записать();
		КонецЦикла;
		
	Иначе
		ЗапросПредприятий = Новый Запрос;
		ЗапросПредприятий.Текст = "ВЫБРАТЬ
		                          |	Предприятия.Ссылка КАК Предприятие,
		                          |	Предприятия.ОсновнаяВалютаУчета
		                          |ИЗ
		                          |	Справочник.Предприятия КАК Предприятия
		                          |ГДЕ
		                          |	Предприятия.ПометкаУдаления = ЛОЖЬ
		                          |	И Предприятия.ЭтоГруппа = ЛОЖЬ";
		Результат = ЗапросПредприятий.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ОсновнаяВалютаУчета = Справочники.Валюты.ПустаяСсылка() Тогда
				ТекВал = УЧ_Сервер.НациональнаяВалюта();
			Иначе
				ТекВал = Выборка.ОсновнаяВалютаУчета;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.Б_ПараметрыБюджета.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Предприятие.Установить(Выборка.Предприятие);
			НаборЗаписей.Отбор.Сценарий.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			
			Если НЕ НаборЗаписей.Количество() Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Предприятие = Выборка.Предприятие;
				НоваяЗапись.Сценарий = Ссылка;
				НоваяЗапись.Валюта = ТекВал;	
			Иначе
				ТекущаяЗапись = НаборЗаписей[0];
				
				Если Не ЗначениеЗаполнено(ТекущаяЗапись.Валюта) Тогда 
					ТекущаяЗапись.Валюта = ТекВал;
				КонецЕсли;
				
			КонецЕсли;
			
			НаборЗаписей.Записать();			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры
