
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьВыбор(Отказ);
КонецПроцедуры

Процедура ПроверитьВыбор(Отказ)
	
	Если НЕ БюджетныйНаСервере.РольАдминаДоступнаСервер() И НЕ РольДоступна("Кадровик") Тогда
		Если БюджетныйНаСервере.ПолучитьПредприятия().Найти(Запись.Предприятие) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Вы выбрали недоступное вам предприятие!";
			Сообщение.Поле = "Предприятие";
			//Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если БПСервер.ПолучитьМассивПользователей().Найти(БПСервер.ПолучитьРуководителя(Запись.Сотрудник)) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данный пользователь не находится в вашем непосредственном подчинении.";
			Сообщение.Поле = "Запись.Сотрудник";
			//Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить(); 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	//проверяем на уникальность в случае только доступа
	Если НЕ Запись.Должность = Перечисления.ОсновныеДолжностиПредприятия.БезДолжности Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОсновныеДолжностиПредприятия.Предприятие,
		               |	ОсновныеДолжностиПредприятия.Должность,
		               |	ОсновныеДолжностиПредприятия.Подразделение
		               |ИЗ
		               |	РегистрСведений.ОсновныеДолжностиПредприятия КАК ОсновныеДолжностиПредприятия
		               |ГДЕ
		               |	ОсновныеДолжностиПредприятия.Предприятие = &Предприятие
		               |	И ОсновныеДолжностиПредприятия.Должность = &Должность
		               |	И ОсновныеДолжностиПредприятия.Подразделение = &Подразделение";
		
		Запрос.УстановитьПараметр("Предприятие", Запись.Предприятие);
		Запрос.УстановитьПараметр("Должность", Запись.Должность);
		Запрос.УстановитьПараметр("Подразделение", Запись.Подразделение);
		
		Результат = Запрос.Выполнить();
		ЭтоНоваяЗапись = ?(ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Должность), Ложь, Истина); 
		Выборка = ?(ЭтоНоваяЗапись, Результат.Выбрать().Количество(), Результат.Выбрать().Количество() - ЭтоНоваяЗапись) ;
		
		
		Если Выборка Тогда
			
			Если БПСервер.ПолучитьМассивПользователей().Найти(БПСервер.ПолучитьРуководителя(Запись.Сотрудник)) = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Невозможно назначение двух пользователей на уникальные должности.";
				Сообщение.Поле = "Запись.Должность";
				//Сообщение.УстановитьДанные(ЭтаФорма);
				Сообщение.Сообщить(); 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	ТекПараметры = БюджетныйНаСервере.ВернутьРеквизиты(Запись.Предприятие, "УчетПоПодразделениям, ЭтоГруппа");
	Если НЕ ТекПараметры = Неопределено И ТекПараметры.Свойство("ЭтоГруппа") И НЕ ТекПараметры.ЭтоГруппа Тогда
		Элементы.Подразделение.Доступность = ТекПараметры.УчетПоПодразделениям;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПредприятиеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Запись.Сотрудник);
КонецПроцедуры


