
&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
	ПоказатьДиалогОтправкиПоЭлектроннойПочте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогОтправкиПоЭлектроннойПочте()
	
	ТабличныеДокументы = Новый СписокЗначений;
	ТабличныеДокументы.Добавить(ЭтаФорма.ТекстДокумента, Заголовок);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТабличныеДокументы", ТабличныеДокументы);
	ПараметрыФормы.Вставить("Тема", Заголовок);
	ПараметрыФормы.Вставить("АдресEmail", АдресEmail);
	ПараметрыФормы.Вставить("Предмет", Заявка);
	ПараметрыФормы.Вставить("Заголовок", СтрЗаменить(
	НСтр("ru = 'Отправка печатной формы документа ""%1"" по почте'"),
	"%1",
	Заголовок));
	
	ОтчетНаименованиеТекущегоВарианта = Заголовок;
	
	ТабличныеДокументы = Новый СписокЗначений;
	ТабличныеДокументы.Добавить(ЭтаФорма.ТекстДокумента, ОтчетНаименованиеТекущегоВарианта);
	
	ЗаголовокСохранения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Отправка печатной формы документа ""%1"" по почте'"), ОтчетНаименованиеТекущегоВарианта);
	
	ПараметрыОтправки = Новый Структура("Тема, Получатель, Предмет", ОтчетНаименованиеТекущегоВарианта, АдресEmail, Заявка);
	
	МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
	МодульРаботаСПочтовымиСообщениямиКлиент.ОтправитьТабличныеДокументы(ТабличныеДокументы, ЗаголовокСохранения, ПараметрыОтправки);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ссылка") Тогда
		ИмяДокумента = Параметры.Ссылка[0].Метаданные().Имя;
		Заявка = Параметры.Ссылка[0];
	Иначе
		ИмяДокумента = "Д_СлужебнаяЗаписка";
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяКоманды") Тогда
		ИмяКоманды = Параметры.ИмяКоманды;	
	КонецЕсли;
	
	Если Параметры.Свойство("АдресEmail") Тогда
		АдресEmail = Параметры.АдресEmail;
	КонецЕсли;
	
	Если Параметры.Свойство("Заявка") Тогда
		Заявка = Параметры.Заявка;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//табДок
	#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
		ЭтоМобильныйКлиент = Истина;
	#Иначе
		ЭтоМобильныйКлиент = Ложь;
	#КонецЕсли
	
	//ПриОткрытииНаСервере(ЭтоМобильныйКлиент);	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ЭтоМобильныйКлиент)
	
	а = 1;
	//МассивЗаявок = Новый Массив;
	//МассивЗаявок.Добавить(Заявка);
	//
	//ТабДок = Новый ТабличныйДокумент;	
	//БюджетныйНаСервере.УниверсальнаяПечатьСервер(ТабДок, МассивЗаявок, ЭтоМобильныйКлиент); //второй раз для отображения картинок - первый раз в бюджетном на клиенте!!! нужно исправить
	//ТекстДокумента = ТабДок;
	

КонецПроцедуры



