
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок = Параметры.Заголовок;	
	КонецЕсли;
	
	Если Параметры.Свойство("ТекКонтрагент") Тогда
		УжеДоступныеПредприятия = Параметры.ТекКонтрагент.Предприятия.Выгрузить().ВыгрузитьКолонку("Предприятие");
	Иначе
		УжеДоступныеПредприятия = Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Предприятия.Ссылка КАК Предприятие
	               |ИЗ
	               |	Справочник.Предприятия КАК Предприятия
	               |ГДЕ
	               |	НЕ Предприятия.Ссылка В (&Ссылка)
	               |	И Предприятия.Родитель = ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |	И Предприятия.Ссылка В (&ДоступныеПредприятия)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Предприятие
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", УжеДоступныеПредприятия);
	Запрос.УстановитьПараметр("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выгрузить();
	
	Для каждого ТекСтрока Из Выборка Цикл
		НоваяСтрока = Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);	
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОтобранныеСТроки = Список.НайтиСтроки(Новый Структура("Галочка", Истина));
	ОтобранныеМассив = Новый Массив;
	Для каждого ТекСТрока Из ОтобранныеСТроки Цикл
		ОтобранныеМассив.Добавить(ТекСТрока.Предприятие);	
	КонецЦикла; 
	ОповеститьОВыборе(ОтобранныеМассив);
КонецПроцедуры
