
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Добавить(
	"УпрГруппа",
	Тип("ГруппаФормы"),
	ЭтаФорма);
	
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Поведение  = ПоведениеОбычнойГруппы.Свертываемая;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Группа.Заголовок = "Реквизиты (Управленка):";
	
	ПолеВвода = Элементы.Добавить("ПриоритетныйПорядокРасчетов", Тип("ПолеФормы"), Группа); 
	ПолеВвода.Заголовок = "Приоритетный порядок расчетов";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ПриоритетныйПорядокРасчетов"; 
	
	ПолеВвода = Элементы.Добавить("СчетВзаиморасчетов", Тип("ПолеФормы"), Группа); 
	ПолеВвода.Заголовок = "Счет взаиморасчетов";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.СчетВзаиморасчетов"; 
		
	Выборка = ПолучитьСчетаВзаиморасчетов();
	Пока Выборка.Следующий() Цикл
		ПолеВВода.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Код + " " + Выборка.Наименование);	
	КонецЦикла;
	Если ПолеВВода.СписокВыбора.Количество() Тогда
		//Удалось получить список счетов взаиморасчетов, ограничем выбор
		ПолеВвода.РежимВыбораИзСписка = Истина;
	КонецЕсли;  
	
КонецПроцедуры    

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьСчетаВзаиморасчетов()
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныйВидыСубконто.Ссылка КАК Ссылка,
	               |	УчетныйВидыСубконто.Ссылка.Код КАК Код,
	               |	УчетныйВидыСубконто.Ссылка.Наименование КАК Наименование
	               |ИЗ
	               |	ПланСчетов.Учетный.ВидыСубконто КАК УчетныйВидыСубконто
	               |ГДЕ
	               |	УчетныйВидыСубконто.ВидСубконто = &ВидСубконто
	               |	И НЕ УчетныйВидыСубконто.Ссылка.Забалансовый
	               |	И НЕ УчетныйВидыСубконто.Ссылка.ЗапретитьИспользоватьВПроводках"; 
	
	ВидСубконтоДоговоры = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Договоры");
	
	Запрос.УстановитьПараметр("ВидСубконто", ВидСубконтоДоговоры); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Выборка
	
КонецФункции
#КонецОбласти

