
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = ПечатьЗаданиеНаПроизводство(ПараметрКоманды);
		
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.АвтоМасштаб = Истина;
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента", Новый Структура("ВозможностьРедактирования", Истина), ПараметрыВыполненияКоманды.Источник);
	ФормаПечати.Результат = ТабДок;
	ФормаПечати.Открыть();
	
КонецПроцедуры

Функция ПечатьЗаданиеНаПроизводство(ПараметрКоманды)
	
	Возврат Документы.ЗаказНаПроизводство.ПечатьЗаданиеНаПроизводство(ПараметрКоманды);
	
КонецФункции