
&НаКлиенте
Процедура РасшифровкиСтрокПослеУдаления(Элемент)
	ОбновитьСуммуИтого();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСуммуИтого();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкиСтрокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		Элементы.РасшифровкиСтрок.ТекущиеДанные.УИДСтрокиЗаявки = УИДСтрокиЗаявки;
		Элементы.РасшифровкиСтрок.ТекущиеДанные.ЦФО = ЦФО;
		Элементы.РасшифровкиСтрок.ТекущиеДанные.Подразделение = ПодразделениеЦФО;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуИтого()
	
	//ОтобранныеСтроки = РасшифровкаСтрок.НайтиСтроки(Новый Структура("УИДСтрокиЗаявки", УИДСтрокиЗаявки));
	СуммаИтого = 0;
	ВалютнаяСуммаИтого = 0;
	
	Для каждого ТекСтрока Из РасшифровкаСтрок Цикл
		СуммаИтого = СуммаИтого + ТекСтрока.Сумма;
		ВалютнаяСуммаИтого = ВалютнаяСуммаИтого + ТекСтрока.ВалютнаяСумма;
	КонецЦикла; 


КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Оповестить("сабИзменитьСуммуВСтроке", Новый Структура("Сумма, ВалютнаяСумма, Расшифровка", СуммаИтого, ВалютнаяСуммаИтого, ВернутьТЧ()));
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ВернутьТЧ()

	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(РасшифровкаСтрок.Выгрузить());	

КонецФункции // ()

&НаКлиенте
Процедура РасшифровкиСтрокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.РасшифровкиСтрок.ТекущиеДанные.УИДСтрокиЗаявки = УИДСтрокиЗаявки;
	ОбновитьСуммуИтого();
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкиСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыЦФО = ПараметрыЦФО(Элементы.РасшифровкиСтрок.ТекущиеДанные.ЦФО);

	Если НЕ ПараметрыЦФО.УчетПоПодразделениям Тогда
		Элементы.РасшифровкиСтрок.ТекущиеДанные.Подразделение = ПараметрыЦФО.ВидДеятельности;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыЦФО(тЦФО)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("УчетПоПодразделениям", ?(ЗначениеЗаполнено(тЦФО.УчетПоПодразделениям), тЦФО.УчетПоПодразделениям, Ложь));
	СтруктураПараметров.Вставить("ВидДеятельности", ?(ЗначениеЗаполнено(тЦФО.ВидДеятельности), тЦФО.ВидДеятельности, Справочники.СтруктураПредприятия.ПустаяСсылка()));
	
	Возврат СтруктураПараметров;
	
КонецФункции	

&НаКлиенте
Процедура РасшифровкиСтрокЦФОПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РасшифровкиСтрок.ТекущиеДанные;
	ТекРекв = БюджетныйНаСервере.ВернутьРеквизиты(ТекСтрока.ЦФО, "ВидДеятельности, ОсновнаяВалютаУчета");
	ТекСтрока.Валюта = ТекРекв.ОсновнаяВалютаУчета;
	ТекСтрока.Подразделение = ТекРекв.ВидДеятельности;
	
КонецПроцедуры




