
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Добавить(
	ЭтаФорма,
	Тип("ГруппаФормы"),
	ЭтаФорма);
	
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Группа.Заголовок = "Параметры для учета (Упр.):";
	
	ПолеВвода = Элементы.Добавить("ПользовательЭл", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "ФизическоеЛицо.Пользователь"; 
	
	ПолеВвода = Элементы.Добавить("ВнешнийКодДанон", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "ФизическоеЛицо.ВнешнийКодДанон";

	
	ГруппаТелеграм = Элементы.Добавить(
	"ГруппаДляОтправкиТелеграм",
	Тип("ГруппаФормы"),
	Элементы.Страницы.ПодчиненныеЭлементы.ГруппаКонтактнаяИнформация);
	ГруппаТелеграм.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаТелеграм.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВвода = Элементы.Добавить("ОтпралятьСообщенияИзПриемки", Тип("ПолеФормы"), ГруппаТелеграм);
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "ФизическоеЛицо.ОтпралятьСообщенияИзПриемки";

	ПолеВвода = Элементы.Добавить("ИДТелеграм", Тип("ПолеФормы"), ГруппаТелеграм);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "ФизическоеЛицо.ИДТелеграм";
	
КонецПроцедуры
