
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Попытка
		ЭтотОбъект2 = ВнешниеОтчеты.Создать("сабСравнениеНоменклатурыБУУУ");	
	Исключение
		ЭтотОбъект2 = Отчеты.сабСравнениеНоменклатурыБУУУ;
	КонецПопытки;
	
	СКД = ЭтотОбъект2.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Источник = новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	КомпоновщикНастроек2 = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек2.Инициализировать(Источник);
	КомпоновщикНастроек2.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	КомпоновщикНастроек2.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек2.ПолучитьНастройки();

	СКД.НаборыДанных.НаборДанных3.Элементы[1].Запрос = СтрЗаменить(СКД.НаборыДанных.НаборДанных3.Элементы[1].Запрос,
		"УчетныйОстаткиИОбороты.Предприятия КАК Предприятия,", 
		"УчетныйОстаткиИОбороты.Организация.Предприятие КАК Предприятия,");
	
	СКД.НаборыДанных.НаборДанных3.Элементы[1].Запрос = СтрЗаменить(СКД.НаборыДанных.НаборДанных3.Элементы[1].Запрос,
		"РегистрБухгалтерии.Учетный.ОстаткиИОбороты(", 
		"РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиДляКомпоновкиМакета, ДанныеРасшифровки, Неопределено);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	СтандартнаяОбработка = Ложь;


КонецПроцедуры
