

Функция ПолучитьДокументыИсходногоПериода()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УЧ_Реализация.Ссылка КАК Ссылка,
	               |	УЧ_Реализация.Дата КАК Дата
	               |ИЗ
	               |	Документ.УЧ_Реализация КАК УЧ_Реализация
	               |ГДЕ
	               |	УЧ_Реализация.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И УЧ_Реализация.Проведен = ИСТИНА
	               |	И ВЫБОР
	               |			КОГДА &Предприятие = ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ УЧ_Реализация.Предприятие В (&Предприятие)
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("Дата1", ИсходныйПериод.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", КонецДня(ИсходныйПериод.ДатаОкончания));
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	
	Результат = Запрос.Выполнить();
	
	Массив = Новый Массив;
	Выборка = Результат.Выгрузить();
	Для каждого ТекСТрока Из Выборка Цикл
		Массив.Добавить(Новый Структура("Ссылка, Дата", ТекСТрока.Ссылка, ТекСТрока.Дата));
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Процедура ВыполнитьКопированиеДока(Объект)
	
	Об = Объект.Ссылка.Скопировать();
	Об.Номер = "";
	Об.Дата = Об.Дата + 24*60*60;
	
	ВБудущее = НачалоМесяца(ПериодНазначения.ДатаНачала) - НачалоМесяца(ИсходныйПериод.ДатаНачала) > 0;
	КоличествоМесяцев = 0;
	ТекПериод = НачалоМесяца(ИсходныйПериод.ДатаНачала);
	Пока ?(ВБудущее, ТекПериод < НачалоМесяца(ПериодНазначения.ДатаНачала), ТекПериод > НачалоМесяца(ПериодНазначения.ДатаНачала)) Цикл
		ТекПериод = ДобавитьМесяц(ТекПериод, 1);
		КоличествоМесяцев = КоличествоМесяцев + 1;
	КонецЦикла;
	Об.Дата = ДобавитьМесяц(Объект.Дата, КоличествоМесяцев); 
	Если Об.Дата > ПериодНазначения.ДатаОкончания Тогда
		Об.Дата = ПериодНазначения.ДатаОкончания;
	КонецЕсли;
	Если КонецДня(Объект.Ссылка.Дата) = КонецМесяца(Объект.Ссылка.Дата) Тогда //если док-основание явно в конце месяца
		Об.Дата = КонецМесяца(Об.Дата);	
	КонецЕсли;
	Если ОставлятьНепроведенными Тогда
		Об.Записать();
	Иначе
		Об.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКопирование(Команда)
	Обработ = ПолучитьДокументыИсходногоПериода();
	//Возврат;
	счСтроки = 0;
	ВремяНачала = ТекущаяДата();
	ЧислоСтрок  = Обработ.Количество();
	
	Для каждого ТекОбр Из Обработ Цикл
		счСтроки = счСтроки + 1;
		СкоростьЗагрузки = ?(ТекущаяДата() - ВремяНачала = 0, 0, Окр(счСтроки / (ТекущаяДата() - ВремяНачала), 2));
		ОсталосьВремени = Окр((ТекущаяДата() - ВремяНачала) / счСтроки * (ЧислоСтрок - счСтроки) / 60, 2);
		
		Если счСтроки / 100 = Окр(счСтроки / 100, 0) ИЛИ СкоростьЗагрузки < 20 ИЛИ ЧислоСтрок < 100 Тогда
			Состояние("Копирование..." + " Осталось " + Строка(ОсталосьВремени) + " мин." + " Скорость " + Строка(СкоростьЗагрузки) + " стр/сек",
			счСтроки / ЧислоСтрок * 100, "№ дока: " +  Строка(ТекОбр.Ссылка) +
			" (" + Строка(счСтроки) + "/" + Строка(ЧислоСтрок) + ")" );
		КонецЕсли;
		
		ОбработкаПрерыванияПользователя();
		
		ВыполнитьКопированиеДока(ТекОбр);
		//Прервать;
	КонецЦикла;
	ОповеститьОбИзменении(Тип("ДокументСсылка.УЧ_Реализация"));
КонецПроцедуры

