Функция Счет50() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("50");	

КонецФункции // ()

Функция Счет51() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("51");	

КонецФункции // ()

Функция Счет5101() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("51.01");	

КонецФункции // ()

Функция Счет5102() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("51.02");	

КонецФункции // ()

Функция Счет5001() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("50.01");	

КонецФункции // ()

Функция Счет5002() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("50.02");	

КонецФункции // ()

Функция Счет5501() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("55.01");	

КонецФункции // ()

Функция Счет5502() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("55.02");	

КонецФункции // ()

Функция Счет002() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("002");	

КонецФункции // ()

Функция Счет41() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("41");	

КонецФункции // ()

Функция Счет45() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("45");	

КонецФункции // ()

Функция Счет43() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("43");	

КонецФункции // ()

Функция Счет40() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("40");	

КонецФункции // ()

Функция Счет25() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("25");	

КонецФункции // ()

Функция Счет26() Экспорт
	Счет26 = ПланыСчетов.Учетный.НайтиПоКоду("26");
	Если Не ЗначениеЗаполнено(Счет26) Тогда
		Возврат ПланыСчетов.Учетный.НайтиПоКоду("25");	
	Иначе	
		Возврат Счет26;	
	КонецЕсли;
КонецФункции // ()

Функция Счет20() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("20");	

КонецФункции // ()

Функция Счет9002() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("90.02");	

КонецФункции // ()

Функция Счет9001() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("90.01");	

КонецФункции // ()

Функция Счет99() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("99");	

КонецФункции // ()

Функция Счет90() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("90");	

КонецФункции // ()

Функция Счет91() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("91");	

КонецФункции // ()

Функция Счет9003() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("90.03");	

КонецФункции // ()

Функция Счет7502() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("75.02");	

КонецФункции // ()

Функция Счет84() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("84");	

КонецФункции // ()

Функция Счет60() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("60");	

КонецФункции // ()

Функция Счет6001() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("60.01");	

КонецФункции // ()

Функция Счет6002() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("60.02");	

КонецФункции // ()

Функция Счет6005() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("60.05");	

КонецФункции // ()

Функция Счет6003() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("60.03");	

КонецФункции // ()

Функция Счет00() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("00");	

КонецФункции // ()

Функция Счет0803() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("08.03");	

КонецФункции // ()

Функция Счет0804() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("08.04");	

КонецФункции // ()

Функция Счет01() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("01");	

КонецФункции // ()

Функция Счет02() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("02");	

КонецФункции // ()

Функция Счет1001() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("10.01");	

КонецФункции // ()

Функция Счет7902(Предприятие = Неопределено) Экспорт
	
	Если Не Предприятие = Неопределено Тогда
		СчетУчПолитики = Предприятие.УчетнаяПолитика.СчетВНХТоварныхВзаиморасчетов;
		Если ЗначениеЗаполнено(СчетУчПолитики) Тогда
			Возврат СчетУчПолитики;		
		КонецЕсли;
	КонецЕсли;

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("79.02");	

КонецФункции // ()

Функция Счет7901() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("79.01");	

КонецФункции // ()

Функция Счет7601() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("76.01");	

КонецФункции // ()

Функция Счет6801() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("68.01");	

КонецФункции // ()

Функция Счет6201() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("62.01");	

КонецФункции // ()

Функция Счет6202() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("62.02");	

КонецФункции // ()

Функция Счет6203() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("62.03");	

КонецФункции // ()

Функция Счет9005() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("90.05");	

КонецФункции // ()

Функция Счет6701() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("67.01");	

КонецФункции // ()

Функция Счет70() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("70");	

КонецФункции // ()

Функция Счет6702() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("67.02");	

КонецФункции // ()

Функция Счет79() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("79");	

КонецФункции // ()

Функция СчетЗАК() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("0041");	

КонецФункции // ()

Функция Счет62() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("62");	

КонецФункции // ()

Функция Счет76() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("76");	

КонецФункции // ()

Функция Счет10() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("10");	

КонецФункции // ()

Функция Счет9004() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("90.04");	

КонецФункции // ()

Функция Счет97() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("97");	

КонецФункции // ()

Функция Счет9009() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("90.09");	

КонецФункции // ()

Функция Счет98() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("98");	

КонецФункции // ()

Функция Счет7303() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("73.03");	

КонецФункции // ()

Функция МОЛИспользуются() Экспорт
	
	Счет41 = ПланыСчетов.Учетный.Счет10();
	Используется = Ложь;
	Для каждого ТекСубконто Из Счет41.ВидыСубконто Цикл
		Если ТекСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("МОЛ", Истина) Тогда
			Используется = Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Используется;
	
КонецФункции // ()

Функция Счет7101() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("71.01");	

КонецФункции // ()


Функция Счет19() Экспорт

	Возврат ПланыСчетов.Учетный.НайтиПоКоду("19");	

КонецФункции
