
&НаКлиенте
Процедура Автозаполнение(Команда)
	ВыполнитьАвтозаполение();
	ОбновитьИнтерфейс();
	Объект.Выполнено = Истина;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАвтозаполение()
	//Константы.сабИспользоватьНесколькоПредприятий.Установить(Истина);
	//Константы.УчетДДСПоЦФО.Установить(Истина);
	////Константы.БП_ВидимостьНепройденныхСогласователей.Установить(Истина);
	//Константы.ИспользоватьЗаявкиНаОплату.Установить(Истина);
	//Константы.ИспользоватьРеестрыЗаявокНаОплату.Установить(Истина);
	//Константы.сабИспользоватьПодсистемуБюджетирование.Установить(Истина);
	//Константы.сабИспользоватьПодсистемуУправленческийУчет.Установить(Истина);
	//Константы.сабИспользоватьПодсистемуБанкИКасса.Установить(Истина);
	////Константы.сабИспользоватьПодсистемуДокументооборот.Установить(Истина);
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуНастройки(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаКонстант",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

