
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ТекущийЗаказ,СозданаНаОснованииИзЗаказаПоставщику", ПараметрКоманды,Истина);
	ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаПриемки", ПараметрыФормы,,ПараметрыВыполненияКоманды.Уникальность);
	//ТекФорма = ПолучитьФорму("Документ.ЗаказПоставщику.Форма.ФормаПриемки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//ТекФорма.Далее(Неопределено);
	//ТекФорма.Открыть();

КонецПроцедуры
