

&НаКлиенте
Процедура ПодобратьИЗакрыть(Команда)
	
	Результат = Новый СписокЗначений;
	ОбщееКоличество = 0;
	Для Каждого СтрокаТЧ Из Документы Цикл
		Результат.Добавить(СтрокаТЧ.Документ,СтрокаТЧ.ДокументПредставление);
		
		ОбщееКоличество = ОбщееКоличество + СтрокаТЧ.Количество;
	КонецЦикла;
	СтруктураВозврата = Новый Структура("Документы, ОбщееКоличество", Результат, ОбщееКоличество);
	Закрыть(СтруктураВозврата);   
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Контрагент = БюджетныйНаСервере.ВернутьРеквизит(Параметры.Заказ, "Контрагент");
	СписокПодходящихнакладныхВетис = ПолучитьСписокПодходящихнакладныхВетис(Контрагент, Параметры.НомерТТН, Параметры.ДатаТТН);
	МассивДокументов = Новый Массив;
	Для каждого ЭдементСписокПодходящихнакладныхВетис  Из СписокПодходящихнакладныхВетис Цикл
		МассивДокументов.Добавить(ЭдементСписокПодходящихнакладныхВетис.Документ);
	КонецЦикла;
	ФормаВыбора = ПолучитьФорму("Справочник.ВетеринарноСопроводительныйДокументВЕТИС.ФормаВыбора"); 
	Для Каждого ЭлементСписка Из ФормаВыбора.Элементы.Список.ПодчиненныеЭлементы Цикл 
		ЭлементСписка.Видимость = ЭлементСписка.Имя = "Продукция" ИЛИ ЭлементСписка.Имя = "КоличествоВЕТИС"
		ИЛИ ЭлементСписка.Имя = "ДатаПроизводстваНачалоПериода" ИЛИ ЭлементСписка.Имя = "СрокГодностиНачалоПериода"
		ИЛИ ЭлементСписка.Имя = "НомерТТН" ИЛИ ЭлементСписка.Имя = "ДатаТТН";
		Если ЭлементСписка.Имя = "ДатаПроизводстваНачалоПериода" Тогда
			ЭлементСписка.Заголовок = "Дата производства";
		КонецЕсли; 
		Если ЭлементСписка.Имя = "СрокГодностиНачалоПериода" Тогда
			ЭлементСписка.Заголовок = "Срок годности";
		КонецЕсли;
	КонецЦикла;
	ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ПравоеЗначение = МассивДокументов;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОповещениеПослеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеОкончанияВыбораВЕТИС", ЭтотОбъект, Новый Структура("СписокПодходящихнакладныхВетис",СписокПодходящихнакладныхВетис));
	ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОповещениеПослеВыбора;
	ФормаВыбора.Открыть();  
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончанияВыбораВЕТИС(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТД = Элементы.Документы.ТекущиеДанные;	
	ТД.Документ = Результат; 
	Для каждого ЭдементСписокПодходящихнакладныхВетис  Из ДопПараметры.СписокПодходящихнакладныхВетис Цикл
		Если Результат = ЭдементСписокПодходящихнакладныхВетис.Документ Тогда
			ТД.Количество = ЭдементСписокПодходящихнакладныхВетис.Количество;
			ТД.ДокументПредставление = ЭдементСписокПодходящихнакладныхВетис.Представление;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьСписокПодходящихнакладныхВетис(Контрагент, НомерТТН, ДатаТТН)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВетеринарноСопроводительныйДокументВЕТИС.Ссылка КАК Документ,
	|	ВетеринарноСопроводительныйДокументВЕТИС.Идентификатор КАК Идентификатор, 
	|	ВетеринарноСопроводительныйДокументВЕТИС.Представление КАК Представление,
	|	ВетеринарноСопроводительныйДокументВЕТИС.КоличествоВЕТИС КАК Количество
	|ИЗ
	|	Справочник.ВетеринарноСопроводительныйДокументВЕТИС КАК ВетеринарноСопроводительныйДокументВЕТИС
	|ГДЕ
	|   ВетеринарноСопроводительныйДокументВЕТИС.ГрузоотправительХозяйствующийСубъект.Контрагент = &Контрагент
	|	И НЕ ВетеринарноСопроводительныйДокументВЕТИС.ПометкаУдаления";
	Если ЗначениеЗаполнено(НомерТТН) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И НЕ ВетеринарноСопроводительныйДокументВЕТИС.ПометкаУдаления",
		"И НЕ ВетеринарноСопроводительныйДокументВЕТИС.ПометкаУдаления И ВетеринарноСопроводительныйДокументВЕТИС.НомерТТН = &НомерТТН ");
		Запрос.УстановитьПараметр("НомерТТН",НомерТТН);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаТТН) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И НЕ ВетеринарноСопроводительныйДокументВЕТИС.ПометкаУдаления",
		"И НЕ ВетеринарноСопроводительныйДокументВЕТИС.ПометкаУдаления И ВетеринарноСопроводительныйДокументВЕТИС.ДатаТТН = &ДатаТТН ");
		Запрос.УстановитьПараметр("ДатаТТН",ДатаТТН);
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент",Контрагент); 
	РезультатЗапроса =  Запрос.Выполнить();
	РезультатМассив = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			ПредставлениеСправочника = СокрЛП(СтрЗаменить(Выборка.Представление,Выборка.Идентификатор,""));
			СтруктураДанныхВетис = Новый Структура("Документ,Количество,Представление",Выборка.Документ,Выборка.Количество,ПредставлениеСправочника);
			РезультатМассив.Добавить(СтруктураДанныхВетис);
		КонецЦикла;
	КонецЕсли; 
	Возврат РезультатМассив;
	
КонецФункции


&НаКлиенте
Процедура ДокументыПриИзменении(Элемент)
	
	Количество = Документы.Итог("Количество"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыДокументПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Контрагент = БюджетныйНаСервере.ВернутьРеквизит(Параметры.Заказ, "Контрагент");
	СписокПодходящихнакладныхВетис = ПолучитьСписокПодходящихнакладныхВетис(Контрагент, Параметры.НомерТТН, Параметры.ДатаТТН);
	МассивДокументов = Новый Массив;
	Для каждого ЭдементСписокПодходящихнакладныхВетис  Из СписокПодходящихнакладныхВетис Цикл
		МассивДокументов.Добавить(ЭдементСписокПодходящихнакладныхВетис.Документ);
	КонецЦикла;
	ФормаВыбора = ПолучитьФорму("Справочник.ВетеринарноСопроводительныйДокументВЕТИС.ФормаВыбора"); 
	Для Каждого ЭлементСписка Из ФормаВыбора.Элементы.Список.ПодчиненныеЭлементы Цикл 
		ЭлементСписка.Видимость = ЭлементСписка.Имя = "Продукция" ИЛИ ЭлементСписка.Имя = "КоличествоВЕТИС"
		ИЛИ ЭлементСписка.Имя = "ДатаПроизводстваНачалоПериода" ИЛИ ЭлементСписка.Имя = "СрокГодностиНачалоПериода"
		ИЛИ ЭлементСписка.Имя = "НомерТТН" ИЛИ ЭлементСписка.Имя = "ДатаТТН";
		Если ЭлементСписка.Имя = "ДатаПроизводстваНачалоПериода" Тогда
			ЭлементСписка.Заголовок = "Дата производства";
		КонецЕсли; 
		Если ЭлементСписка.Имя = "СрокГодностиНачалоПериода" Тогда
			ЭлементСписка.Заголовок = "Срок годности";
		КонецЕсли;
	КонецЦикла;
	ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ПравоеЗначение = МассивДокументов;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОповещениеПослеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеОкончанияВыбораВЕТИС", ЭтотОбъект, Новый Структура("СписокПодходящихнакладныхВетис",СписокПодходящихнакладныхВетис));
	ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОповещениеПослеВыбора;
	ФормаВыбора.Открыть(); 
	
КонецПроцедуры



