
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = ПечатьЗаказаНаСервере(ПараметрКоманды);
		
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.АвтоМасштаб = Истина;
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента");
	ФормаПечати.Результат = ТабДок;
	Если НЕ ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ФормаПечати.Заголовок = ПараметрКоманды;
	ИначеЕсли ПараметрКоманды.Количество() = 1 Тогда
		РеквизитыЗаявки = ПолучитьНужныеРеквизиты(ПараметрКоманды[0]);
		Организация = РеквизитыЗаявки.Организация;
		ФормаПечати.АдресEmail = РеквизитыЗаявки.АдресEmail;
		ФормаПечати.Заявка = ПараметрКоманды[0];
		ФормаПечати.Заголовок = Строка(ПараметрКоманды[0]) + ?(ЗначениеЗаполнено(Организация), " (" + Строка(Организация) + ")", "");
	КонецЕсли; 
	ФормаПечати.Открыть();
	
КонецПроцедуры

Функция ПечатьЗаказаНаСервере(ПараметрКоманды)
	
	Возврат Документы.ЗаказПоставщику.ПечатьЗаказПоставщику(ПараметрКоманды);
	
КонецФункции

Функция ПолучитьНужныеРеквизиты(ТекЗаявка)
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ЗаказПоставщику.Ссылка,
	                 |	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресEmail,
	                 |	ЗаказПоставщику.Организация
	                 |ИЗ
	                 |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	                 |		ПО ЗаказПоставщику.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	                 |			И (КонтрагентыКонтактнаяИнформация.Вид = &ВидКонтактнойИнформации)
	                 |ГДЕ
	                 |	ЗаказПоставщику.Ссылка = &Ссылка";
	  
	  Запрос.УстановитьПараметр("Ссылка", ТекЗаявка);
	  Запрос.УстановитьПараметр("ВидКонтактнойИнформации", Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
	  
	  Результат = Запрос.Выполнить();
	  Выборка = Результат.Выбрать();
	  
	  Пока Выборка.Следующий() Цикл
	  	Возврат Новый Структура("Организация, АдресEmail", Выборка.Организация, Выборка.АдресEmail); 
	  КонецЦикла;
 
 КонецФункции // ()
 