Процедура ЗаполнитьПоДокументуОснованию(Объект) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.ДокОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	Если ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.УЧ_Реализация") Тогда
		// Заполнение шапки
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	УЧ_Реализация.Ссылка КАК Ссылка,
		               |	УЧ_Реализация.Предприятие КАК Предприятие,
		               |	УЧ_Реализация.Контрагент КАК Контрагент,
		               |	УЧ_Реализация.Договор КАК Договор,
		               |	УЧ_Реализация.Подразделение КАК Подразделение,
		               |	УЧ_Реализация.ФлагВалюты КАК ФлагВалюты,
		               |	УЧ_Реализация.Валюта КАК Валюта,
		               |	УЧ_Реализация.Курс КАК Курс,
		               |	УЧ_Реализация.УчитыватьНДС КАК УчитыватьНДС,
		               |	УЧ_Реализация.Организация КАК Организация,
		               |	УЧ_Реализация.Склад КАК Склад,
		               |	УЧ_Реализация.УчетПартий.(
		               |		Ссылка КАК Ссылка,
		               |		НомерСтроки КАК НомерСтроки,
		               |		Номенклатура КАК Номенклатура,
		               |		Количество КАК Количество,
		               |		СуммаБезНДС КАК СуммаБезНДС,
		               |		СуммаНДС КАК СуммаНДС,
		               |		ВидДвижения КАК ВидДвижения
		               |	) КАК УчетПартий,
		               |	УЧ_Реализация.Товары.(
		               |		Ссылка КАК Ссылка,
		               |		НомерСтроки КАК НомерСтроки,
		               |		Счет КАК Счет,
		               |		Номенклатура КАК Номенклатура,
		               |		Склад КАК Склад,
		               |		Количество КАК Количество,
		               |		КоличествоКРХ КАК КоличествоКРХ,
		               |		Цена КАК Цена,
		               |		Доставка КАК Доставка,
		               |		СуммаОтгрузки КАК СуммаОтгрузки,
		               |		СуммаДоставки КАК СуммаДоставки,
		               |		ВидДоставки КАК ВидДоставки,
		               |		ВнеобАктивы КАК ВнеобАктивы,
		               |		ДоставкаАвто КАК ДоставкаАвто,
		               |		СуммаДоставкиАвто КАК СуммаДоставкиАвто,
		               |		Расстояние КАК Расстояние,
		               |		СуммаДоставкиНачислено КАК СуммаДоставкиНачислено,
		               |		КорСчет КАК КорСчет,
		               |		КорСубконто1 КАК КорСубконто1,
		               |		КорСубконто2 КАК КорСубконто2,
		               |		КорСубконто3 КАК КорСубконто3,
		               |		Основание КАК Основание,
		               |		СуммаВерха КАК СуммаВерха,
		               |		Счет76 КАК Счет76,
		               |		ВерхКонтрагент КАК ВерхКонтрагент,
		               |		Верх КАК Верх,
		               |		ПроцВерха КАК ПроцВерха,
		               |		ЦенаКлиента КАК ЦенаКлиента,
		               |		ВидДеятельности КАК ВидДеятельности,
		               |		СтавкаНДС КАК СтавкаНДС,
		               |		Сумма КАК Сумма,
		               |		СуммаНДС КАК СуммаНДС,
		               |		ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
		               |		ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		               |		АбсолютнаяСкидка КАК АбсолютнаяСкидка,
		               |		Характеристика КАК Характеристика,
		               |		Штрихкод КАК Штрихкод
		               |	) КАК Товары,
		               |	УЧ_Реализация.Счет КАК СчетКонтрагента
		               |ИЗ
		               |	Документ.УЧ_Реализация КАК УЧ_Реализация
		               |ГДЕ
		               |	УЧ_Реализация.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.ДокОснование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(Объект, Выборка,, "УчетПартий, Товары");
			//Объект.Дата = ТекущаяДата();
			Объект.ЦенаВключаетНДС = Истина;  //в Реализации подразумеваем, что всегда включает
			
			ВыборкаТЧ = Выборка.Товары.Выбрать();
			Пока ВыборкаТЧ.Следующий() Цикл
				НоваяСтрока = Объект.Товары.Добавить();
				//НоваяСтрока.АлкогольнаяПродукция 	= ВыборкаТЧ.АлкогольнаяПродукция;
				НоваяСтрока.КоличествоДоИзменения 	= ВыборкаТЧ.Количество;
				НоваяСтрока.Количество 				= ВыборкаТЧ.Количество;
				НоваяСтрока.Номенклатура 	= ВыборкаТЧ.Номенклатура;
				НоваяСтрока.Склад 			= ВыборкаТЧ.Склад;
				НоваяСтрока.СтавкаНДСДоИзменения 	= ВыборкаТЧ.СтавкаНДС;
				НоваяСтрока.СтавкаНДС 				= ВыборкаТЧ.СтавкаНДС;
				НоваяСтрока.СуммаДоИзменения 	= ВыборкаТЧ.Сумма;
				НоваяСтрока.Сумма 				= ВыборкаТЧ.Сумма;
				НоваяСтрока.СуммаНДСДоИзменения = ВыборкаТЧ.СуммаНДС;
				НоваяСтрока.СуммаНДС 			= ВыборкаТЧ.СуммаНДС;
				НоваяСтрока.ЦенаДоИзменения 	= ВыборкаТЧ.Цена;
				НоваяСтрока.Цена 				= ВыборкаТЧ.Цена;
				НоваяСтрока.Счет				= ВыборкаТЧ.Счет;
				НоваяСтрока.ЕстьВДокументеРеализация = Истина;
			КонецЦикла;
			
			ВыборкаУчетПартий = Выборка.УчетПартий.Выбрать();
			Пока ВыборкаУчетПартий.Следующий() Цикл
				
				НоваяСтрока = Объект.УчетПартий.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаУчетПартий.Номенклатура;
				//НоваяСтрока.КоличествоДоИзменения 	= ВыборкаУчетПартий.Количество;
				НоваяСтрока.Количество 				= ВыборкаУчетПартий.Количество;
				//НоваяСтрока.СуммаБезНДСДоИзменения 	= ВыборкаУчетПартий.СуммаБезНДС;
				НоваяСтрока.СуммаБезНДС 			= ВыборкаУчетПартий.СуммаБезНДС;
				//НоваяСтрока.СуммаНДСДоИзменения 	= ВыборкаУчетПартий.СуммаНДС;
				НоваяСтрока.СуммаНДС 				= ВыборкаУчетПартий.СуммаНДС;
				НоваяСтрока.ВидДвижения 			= ВыборкаУчетПартий.ВидДвижения;
				//НоваяСтрока.ЕстьВДокументеПоступления = Истина;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры