
&НаКлиенте
Процедура УУ_ДоступенПриИзмененииПеред(Элемент)
	
	сабПриИзмененииДоступностиВариантаОтчетаСервер();
	
КонецПроцедуры

&НаСервере
Процедура сабПриИзмененииДоступностиВариантаОтчетаСервер()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Пользователи.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Пользователи.Наименование"; 
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ПользователиВарианта.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаПользователиВарианта = ПользователиВарианта.Добавить();
		НоваяСтрокаПользователиВарианта.Значение = Выборка.Ссылка;
	КонецЦикла;
		
КонецПроцедуры
