
&НаКлиенте
Процедура СписокЦенПоследниеПриАктивизацииСтроки(Элемент)
	
	//ТекДанные = Элементы.СписокЦенПоследние.ТекущиеДанные;
	//СписокЦен.Отбор.Элементы.Очистить();
	//
	//Если НЕ ТекДанные = Неопределено Тогда
	//	//ТекКонтр = ТекДанные.Контрагент;
	//	ТекНом = ТекДанные.Номенклатура;
	//	ТекПредпр = ТекДанные.Предприятие;
	//	ТекТипЦен = ТекДанные.ВидЦены;
	//Иначе
	//	ТекКонтр = Неопределено;
	//	ТекНом = Неопределено;
	//КонецЕсли;
	//
	////НовыйОтбор = СписокЦен.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
	////НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	////НовыйОтбор.ПравоеЗначение = ТекКонтр;
	//
	//НовыйОтбор = СписокЦен.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
	//НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//НовыйОтбор.ПравоеЗначение = ТекНом;
	//
	//НовыйОтбор = СписокЦен.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Предприятие");
	//НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//НовыйОтбор.ПравоеЗначение = ТекПредпр;
	//
	//НовыйОтбор = СписокЦен.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидЦены");
	//НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//НовыйОтбор.ПравоеЗначение = ТекТипЦен;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не (РольДоступна("сабУправлениеАссортиментом") Или РольДоступна("сабПолныйПросмотрОперативныйУчет") Или БюджетныйНаСервере.РольАдминаДоступнаСервер()) Тогда
		НовыйОтборГруппа = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НовыйОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		НовыйОтбор = НовыйОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("УстановкаЦенПоставщика");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ПравоеЗначение = Истина;
	КонецЕсли;
	
КонецПроцедуры
