
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	Если НЕ БПСервер.ТекПользовательИсполнительЗадачи(ПараметрКоманды, Истина) Тогда
		Предупреждение("Вы не являетесь исполнителем по данной задаче! Установка нового срока невозможно!");
		Возврат;
	Иначе	
		ОткрытьФорму("Справочник.Задача.Форма.ФормаУстановкиСрока", Новый Структура("Ключ", ПараметрКоманды)); 
	КонецЕсли;
	
	//ОткрытьФорму("Справочник.Задача.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
