
&НаКлиенте
Процедура СерииНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.СерииНоменклатуры.ТекущиеДанные.Номенклатура = Номенклатура;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИЗакрыть(Команда)
	Если ДокументПодбора = "УЧ_ВыпускПродукции" Тогда
		Если СерииНоменклатуры.Итог("Количество") > Количество Тогда
			Сообщить("Превышено выбираемое количество");
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	СтруктураПараметров = ПолучитьМассивСтруктур();
	Закрыть(Новый Структура("НомерСтрокиРеализации, СерииНоменклатуры", НомерСтрокиРеализации, СтруктураПараметров));
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтруктур()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(СерииНоменклатуры.Выгрузить());	
КонецФункции // ()


&НаКлиенте
Процедура СерииНоменклатурыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	КоличествоНовое = СерииНоменклатуры.Итог("Количество");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоНовое = СерииНоменклатуры.Итог("Количество");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Параметры.Свойство("СвязиПараметровВыбораМассив") Тогда
	//	Если ТипЗнч(Параметры.СвязиПараметровВыбораМассив) = Тип("ФиксированныйМассив") Тогда
	//		Если Параметры.СвязиПараметровВыбораМассив.Количество > 0 Тогда
	//			Элементы.СерииНоменклатуры.ПодчиненныеЭлементы.СерииНоменклатурыСерияНоменклатуры.СвязиПараметровВыбора = Параметры.СвязиПараметровВыбораМассив;	
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерииНоменклатурыСерияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СерииНоменклатуры.ТекущиеДанные;
	НовыйПараметрКоличество = Новый ПараметрВыбора("КоличествоПодбора",ТекДанные.Количество); 
	МассивПараметры = Новый Массив(Элемент.ПараметрыВыбора);
	Для Каждого ПараметрВыбораЭлементМассива Из МассивПараметры Цикл
		Если ПараметрВыбораЭлементМассива.Имя = "КоличествоПодбора" Тогда 
			ПраметрКоличествоИндекс = МассивПараметры.Найти(ПараметрВыбораЭлементМассива);
			Если ПраметрКоличествоИндекс <> Неопределено Тогда
				МассивПараметры.Установить(ПраметрКоличествоИндекс,НовыйПараметрКоличество);
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ФиксМассивПараметры = Новый ФиксированныйМассив(МассивПараметры);
	Элемент.ПараметрыВыбора = ФиксМассивПараметры;

КонецПроцедуры
