
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для каждого ТекЗаявка Из ПараметрКоманды Цикл
		Если НЕ БПСервер.ТекПользовательИсполнительЗадачи(ТекЗаявка, Истина) Тогда
			ПоказатьПредупреждение(Неопределено, "Вы не являетесь исполнителем по данной задаче! Перенаправление задачи невозможно!");
			Возврат;
		КонецЕсли;	
	КонецЦикла; 

	
	
	СтруктураПараметров = Неопределено;
	
	ОткрытьФорму("Справочник.Задача.Форма.ФормаПеренаправления",,,,,, Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	
	
	СтруктураПараметров = Результат;
	
	Если Не СтруктураПараметров = Неопределено Тогда
		Если НЕ ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
			МассивЗадач = Новый Массив;
			МассивЗадач.Добавить(ПараметрКоманды);
		Иначе
			МассивЗадач = ПараметрКоманды;
		КонецЕсли;
		Отказ = Ложь;
		БПСервер.ПеренаправитьЗадачиСервер(МассивЗадач, СтруктураПараметров, Отказ);
		Если НЕ ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Задача.Форма.СписокМоихЗадач" И НЕ ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Задача.Форма.СписокМоихЗадач7"  И НЕ ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.Задача.Форма.ФормаУниверсальная" Тогда
			ПараметрыВыполненияКоманды.Источник.Закрыть();	
		КонецЕсли;
		
		Если Не Отказ Тогда
			ОповеститьОбИзменении(МассивЗадач[0]);
			Оповестить("ОбновитьСписокЗадач");
			Для Каждого ТекЗадача Из ПараметрКоманды Цикл
				БПСервер.ЗаписатьДействиеПользователяВЛог(ТекЗадача, "Перенаправить");
			КонецЦикла;
		Иначе
			ПоказатьПредупреждение(Неопределено, "Невозможно перенаправить задачу.");
		КонецЕсли;
	КонецЕсли;
	
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Задача.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры




