
&Вместо("ЗапросНаОформлениеТранспортнойПартииXML")
Функция УУ_ЗапросНаОформлениеТранспортнойПартииXML(ДокументСсылка, ПараметрыПередачи, ДополнительныеПараметры)

	СообщенияXML = Новый Массив;

	Операция = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеТранспортнойПартии;
	ПараметрыЗапросаВЕТИС = Перечисления.ВидыОперацийВЕТИС.ПараметрыЗапросаВЕТИС(Операция, Перечисления.ФорматыОбменаВЕТИС.V2_1);

	ДанныеДокумента = ДанныеИсходящейПартии(ДокументСсылка, Операция);
	Шапка = ДанныеДокумента.Шапка[0];

	Если Шапка.ПоследнийНомерВерсии>0 тогда

    ЕстьОшибкиОформленияТранспортнойПартиии = Ложь;
    ДанныеПоследнегоСообщения = Справочники.ВЕТИСПрисоединенныеФайлы.ПоследнееСообщение(ДокументСсылка, "СОшибкой");
    Если ДанныеПоследнегоСообщения <> Неопределено Тогда
        Если ДанныеПоследнегоСообщения.Операция = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияТранспортнойПартии Тогда   
            ЕстьОшибкиОформленияТранспортнойПартиии = Истина;
        КонецЕсли;
    КонецЕсли;
    Если ЕстьОшибкиОформленияТранспортнойПартиии = Ложь тогда  
        Возврат СообщенияXML;
    КонецЕсли;
        
	КонецЕсли;   
	
	Результат = ПродолжитьВызов(ДокументСсылка, ПараметрыПередачи, ДополнительныеПараметры);
	Возврат Результат; 
	
КонецФункции

