
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПереданныхПараметров = Параметры.СтруктураПараметров;
	АвтоматическиОбновлятьЗависимыеЦены = СтруктураПереданныхПараметров.АвтоматическиОбновлятьЗависимыеЦены;
	ОбновлятьЦеныПоставщикаИзЦеныПоступления = СтруктураПереданныхПараметров.ОбновлятьЦеныПоставщикаИзЦеныПоступления;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидыЦен(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбновлятьЦеныПоставщикаИзЦеныПоступления", ОбновлятьЦеныПоставщикаИзЦеныПоступления);
	СтруктураПараметров.Вставить("АвтоматическиОбновлятьЗависимыеЦены", АвтоматическиОбновлятьЗависимыеЦены);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры
