

&Вместо("ВыполнитьАвтоматическоеСопоставлениеОбъектовИнформационныхБазПоУмолчанию")
Процедура УУ_ВыполнитьАвтоматическоеСопоставлениеОбъектовИнформационныхБазПоУмолчанию(Отказ, СписокПолейСопоставления)
	ТаблицаИсточника = ДанныеИнформационнойБазыИсточника(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаИсточника.Количество() Тогда
		Если ТаблицаИсточника[0].ТипСтрокой = "ДокументСсылка.ЗаказКлиента" 
			ИЛИ ТаблицаИсточника[0].ТипСтрокой = "ДокументСсылка.Д_ЗаявкаНаФинансирование" Тогда
				Возврат;		
		КонецЕсли;
	КонецЕсли;
	
	// Получаем массив полей, которые выбрал пользователь.
	ПользовательскиеПоля = СписокИспользуемыхПолей.ВыгрузитьЗначения();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Получаем таблицы сопоставления объектов (сопоставленные, несопоставленные).
	ДанныеСопоставленияОбъектов(ТаблицаИсточника, ПользовательскиеПоля, МенеджерВременныхТаблиц);
	
	// Получаем таблицу автоматического сопоставления.
	ДанныеАвтоматическогоСопоставления(ТаблицаИсточника, СписокПолейСопоставления, ПользовательскиеПоля, МенеджерВременныхТаблиц);
	
	// Загружаем обновленную таблицу неутвержденных связей в реквизит объекта.
	ТаблицаНеутвержденныхСвязей.Загрузить(ОбъединитьТаблицыНеутвержденныхСвязейИАвтоматическогоСопоставления(МенеджерВременныхТаблиц));
	
	МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&Вместо("ПолучитьИнформациюДайджестаСопоставленияОбъектов")
Процедура УУ_ПолучитьИнформациюДайджестаСопоставленияОбъектов(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаИсточника = ДанныеИнформационнойБазыИсточника(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаИсточника.Количество() Тогда
		Если ТаблицаИсточника[0].ТипСтрокой = "ДокументСсылка.ЗаказКлиента" 
			ИЛИ ТаблицаИсточника[0].ТипСтрокой = "ДокументСсылка.Д_ЗаявкаНаФинансирование" Тогда
				Возврат;		
		КонецЕсли;
	КонецЕсли;
	
	// Указываем пустой массив пользовательских полей, т.к. выборку полей производить нет необходимости.
	ПользовательскиеПоля = Новый Массив;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Получаем таблицы сопоставления объектов (сопоставленные, несопоставленные).
	ДанныеСопоставленияОбъектов(ТаблицаИсточника, ПользовательскиеПоля, МенеджерВременныхТаблиц);
	
	// Получаем информацию дайджеста сопоставления объектов.
	ПолучитьДайджестСопоставления(МенеджерВременныхТаблиц);
	
	МенеджерВременныхТаблиц.Закрыть();

КонецПроцедуры
