

Процедура ПриКопировании(ОбъектКопирования)
	//СогласованиеЗатрат.Очистить();	
	//СогласованиеЗакупок.Очистить();
	//СогласованиеИнвестиций.Очистить();
	//СогласованиеПродаж.Очистить();
	//ДоступностьТЧ.Очистить();
	Недоступен = Ложь;
	ВыполняласьЗагрузка = Ложь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//проводим реализацию
	//Реализация();
	
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоМесяца(Сценарий.ДатаНачала + 60 * 60 * 24);
	Если Автор.Пустая() Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры



///////////////////////////////////////////реализация/////////////////////////////////////////////////////
Процедура Реализация()
	
		
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого Строка ИЗ БюджетПродаж Цикл
		Если ЗначениеЗаполнено(Строка.Авто) И НЕ ЗначениеЗаполнено(Строка.ВозмещениеТр2) Тогда  			
			Текст = "При заполненой ставке транспортных расходов на Авто необходимо указать условие доставки!!";
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ЭтотОбъект, Текст, "БюджетПродаж", Строка.НомерСтроки , "ВозмещениеТр2", отказ);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Номенклатура) И Строка.Номенклатура.ПометкаУдаления Тогда  			
			Текст = "Номенклатура " + Строка(Строка.Номенклатура) + " помечена на удаление!";
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ЭтотОбъект, Текст, "БюджетПродаж", Строка.НомерСтроки , "Номенклатура", отказ);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.ЖД) И НЕ ЗначениеЗаполнено(Строка.ВозмещениеТр) Тогда
			Текст = "При заполненой ставке транспортных расходов на ж/д необходимо указать условие доставки!!";
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ЭтотОбъект, Текст, "БюджетПродаж", Строка.НомерСтроки , "ВозмещениеТр", отказ);
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.Сопровождение) И НЕ ЗначениеЗаполнено(Строка.ВозмещениеСопровождения) Тогда
			Текст = "При заполненой ставке расходов на сопровождение необходимо указать условие доставки!!";
			сабОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ЭтотОбъект, Текст, "БюджетПродаж", Строка.НомерСтроки , "ВозмещениеСопровождения", отказ);
		КонецЕсли;

	КонецЦикла;
	
	
	
	//	Если ЗначениеЗаполнено(СтрокаТЧ.Сопровождение) Тогда 
	//		Если Не ЗначениеЗаполнено(СтрокаТЧ.ВозмещениеСопровождения) Тогда 
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = "При заполненой ставке расходов на сопровождение необходимо указать условие доставки!";
	//			НомерСтроки = СтрокаТЧ.НомерСтроки - 1;
	//			Сообщение.Поле = "БюджетПродаж[" + НомерСтроки + "].Сопровождение";  
	//			Сообщение.Сообщить();
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
		
	//КонецЦикла;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры


















