
&НаКлиенте
&Вместо("УстановитьОтборПоОрганизации")
Процедура УУ_УстановитьОтборПоОрганизации()
	Если  ТипВладельца = ТипЗнч(Неопределено) Тогда
		ТипВладельца = Тип("СправочникСсылка.Организации");
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ЭтотОбъект.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
			"Владелец",
			ОтборОрганизация,
			Неопределено,
			,
			ОтборОрганизацияИспользование);
	ИначеЕсли ЗначениеЗаполнено(ТипВладельца) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ЭтотОбъект.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "ТипВладельца", ТипВладельца);
	КонецЕсли;
КонецПроцедуры
