&НаСервере
Функция ПроверкаДолжности(Должность)

	Если ТипЗнч(Должность) = "Справочник.Д_Должности" Тогда
		Если НЕ Должность = Справочники.Д_Должности.Директор И НЕ Должность = Справочники.Д_Должности.Дивизионер Тогда
			Возврат 0;
		КонецЕсли;	
	КонецЕсли; 
	Возврат 1;

КонецФункции // ПроверкаДолжности()
 


&НаКлиенте
Процедура МаршрутЗаявкиСубъектСогласованияПриИзменении(Элемент)
	Если НЕ ПроверкаДолжности(Элементы.МаршрутЗаявки.ТекущиеДанные.СубъектСогласования) Тогда
		Предупреждение("Возможен выбор должность директора или дивизионера, в остальных случаях точками маршрута являются пользователи.");	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = БюджетныйНаСервере.ПолучитьПользователя();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутЗаявкиСубъектСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Пользователь");
	СписокВыбора.Добавить("Должность");
	ТекТип = СписокВыбора.ВыбратьЭлемент("Выберите тип субъекта согласования", Элемент);
	Если НЕ ТекТип = Неопределено Тогда
		Если ТекТип.Значение = "Пользователь" Тогда
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",,Элемент); 
		Иначе
			СписокВыбора2 = Новый СписокЗначений;
			СписокВыбора2.Добавить("Дивизионер");
			СписокВыбора2.Добавить("Директор");
			СписокВыбора2.Добавить("Менеджер");
			СписокВыбора2.Добавить("ЗавЛабораторией", "Заведующий лабораторией");
			СписокВыбора2.Добавить("ЗаместительДивизионера", "Заместитель дивизионера");
			СписокВыбора2.Добавить("ОтветственныйЗаОтгрузку", "Логист");
			СписокВыбора2.Добавить("Снабженец");
			СписокВыбора2.Добавить("Учетчик");
			СписокВыбора2.Добавить("Финансист");
			ТекДолжность = СписокВыбора2.ВыбратьЭлемент("Выберите должность", Элемент);
			Если НЕ ТекДолжность = Неопределено Тогда
				Элементы.МаршрутЗаявки.ТекущиеДанные.СубъектСогласования = ТекДолжность;
			КонецЕсли;
		КонецЕсли;
	
		
	
	КонецЕсли;
КонецПроцедуры
