
&НаСервере
&Вместо("ВосстановитьНастройкиПечатныхФорм")
Процедура УУ_ВосстановитьНастройкиПечатныхФорм(СохраненныеНастройкиПечатныхФорм)

	Если СохраненныеНастройкиПечатныхФорм = Неопределено Тогда
		СохраненныеНастройкиПечатныхФорм = НастройкиКомплектаПоУмолчанию;
	КонецЕсли;
	
	Если СохраненныеНастройкиПечатныхФорм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ_ТекущиеНастройкиПФ = НастройкиПечатныхФорм.Выгрузить();
	ТЗ_ТекущиеНастройкиПФ.Колонки.Добавить("ИмяМакетаСохраненнойНастройки");
	
	Для Каждого ТекСтрокаТЗ Из ТЗ_ТекущиеНастройкиПФ Цикл		
		ИндексПозицииРазделителя = СтрНайти(ТекСтрокаТЗ.ИмяМакета, ".", НаправлениеПоиска.СКонца);
		
		Если ЗначениеЗаполнено(ИндексПозицииРазделителя) Тогда
			ТекСтрокаТЗ.ИмяМакетаСохраненнойНастройки = Прав(ТекСтрокаТЗ.ИмяМакета, СтрДлина(ТекСтрокаТЗ.ИмяМакета) - ИндексПозицииРазделителя); 
		Иначе
			ТекСтрокаТЗ.ИмяМакетаСохраненнойНастройки = ТекСтрокаТЗ.ИмяМакета;
		КонецЕсли;

	КонецЦикла;
	
	Для Каждого СохраненнаяНастройка Из СохраненныеНастройкиПечатныхФорм Цикл 
		
		Если СохраненнаяНастройка.ИмяМакета = "УниверсальныйПередаточныйДокументКомплект" Тогда
			НайденныеНастройки = ТЗ_ТекущиеНастройкиПФ.НайтиСтроки(Новый Структура("Название", "Универсальный передаточный документ"));
		Иначе
			НайденныеНастройки = ТЗ_ТекущиеНастройкиПФ.НайтиСтроки(Новый Структура("ИмяМакетаСохраненнойНастройки", СохраненнаяНастройка.ИмяМакета));
		КонецЕсли;
						
		Если Не НайденныеНастройки.Количество() Тогда
			НайденныеНастройки = ТЗ_ТекущиеНастройкиПФ.НайтиСтроки(Новый Структура("ПозицияПоУмолчанию", СохраненнаяНастройка.ПозицияПоУмолчанию));							
		КонецЕсли;
		
		Для Каждого НастройкаПечатнойФормы Из НайденныеНастройки Цикл
			ИндексСтроки = ТЗ_ТекущиеНастройкиПФ.Индекс(НастройкаПечатнойФормы);
			//НастройкиПечатныхФорм.Сдвинуть(ИндексСтроки, НастройкиПечатныхФорм.Количество()-1 - ИндексСтроки); // сдвиг в конец
			НастройкиПечатныхФорм[ИндексСтроки].Количество = СохраненнаяНастройка.Количество;
			НастройкиПечатныхФорм[ИндексСтроки].Печатать = НастройкиПечатныхФорм[ИндексСтроки].Количество > 0;
		КонецЦикла;  
		
	КонецЦикла;

КонецПроцедуры
