
&НаСервере
Функция ПоискБП(Ссылка)
	//ищем созданные бизнес-процессы
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УтверждениеБюджета.Ссылка
	               |ИЗ
	               |	БизнесПроцесс.УтверждениеБюджета КАК УтверждениеБюджета
	               |ГДЕ
	               |	УтверждениеБюджета.Заявка = &Заявка
	               |	И УтверждениеБюджета.ТипБюджета = &ТипБюджета
	               |	И УтверждениеБюджета.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	Запрос.УстановитьПараметр("ТипБюджета", Перечисления.Д_ТипыБюджетов.БюджетЗатрат);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
КонецФункции // ()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//БП = ПоискБП(ПараметрКоманды);
	//Если НЕ БП = Неопределено Тогда
	//	Предупреждение("Документ уже имеет запущенный бизнес-процесс указанного типа.");
	//	Возврат;		
	//КонецЕсли;
	
	Если Вопрос("После оповещения пользователя изменения предварительного бюджета продаж станут невозможны. Уверены что хотите оповестить о готовности?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТекПользователь = ОткрытьФормуМодально("Справочник.Пользователи.ФормаВыбора"); 
		
		СоздатьБПИнтерактивно(ПараметрКоманды, ТекПользователь);
		ЗаблокироватьДокумент(ПараметрКоманды);
		ОповеститьОбИзменении(ПараметрКоманды);
	КонецЕсли;

	
КонецПроцедуры


&НаСервере
Функция СоздатьБПИнтерактивно(ПараметрКоманды, ТекПользователь)
	
	БПСервер.СоздатьОповещение(ТекПользователь,
								"Бюджет продаж от пользователя " + Строка(ПараметрыСеанса.ТекущийПользователь) + " готов.",
								Строка(ПараметрыСеанса.ТекущийПользователь) +  ": бюджет продаж готов", ПараметрКоманды, Истина);	
	
КонецФункции

&НаСервере
Процедура ЗаблокироватьДокумент(ПараметрКоманды)

	ТекОбъект = ПараметрКоманды.ПолучитьОбъект();
	ТекОбъект.Недоступен = Истина;
	ТекОбъект.Записать();

КонецПроцедуры


