
&НаКлиенте
Процедура НепринятыеСтрокиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.НепринятыеСтроки.ТекущиеДанные.Принять = НЕ Элементы.НепринятыеСтроки.ТекущиеДанные.Принять; 
КонецПроцедуры

&НаКлиенте
Процедура ЗабратьВБюджет(Команда)
	
	МассивПринимаемых = Новый Массив;
	Для каждого ТекСтрока Из НепринятыеСтроки.НайтиСтроки(Новый Структура("Принять", Истина))  Цикл
		МассивПринимаемых.Добавить(ТекСтрока.УИДОперативногоБюджета);	
	КонецЦикла; 
	Оповестить("ПереносВБюджет", Новый Структура("МассивПринимаемых", МассивПринимаемых));
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Д_БюджетПрочихПроектовЗатраты.Ссылка,
	               |	Д_БюджетПрочихПроектовЗатраты.Ссылка.Предприятие КАК ЦФОЗаявителя,
	               |	Д_БюджетПрочихПроектовЗатраты.Ссылка.Подразделение КАК ПодразделениеЗаявителя,
	               |	Д_БюджетПрочихПроектовЗатраты.Ссылка.Автор КАК АвторЗаписи,
	               |	Д_БюджетПрочихПроектовЗатраты.СтатьяЗатрат,
	               |	Д_БюджетПрочихПроектовЗатраты.СуммаСеб,
	               |	Д_БюджетПрочихПроектовЗатраты.СуммаБДДС,
	               |	Д_БюджетПрочихПроектовЗатраты.Основание,
	               |	Д_БюджетПрочихПроектовЗатраты.Месяц КАК Месяц,
	               |	Д_БюджетПрочихПроектовЗатраты.УИД КАК УИДОперативногоБюджета,
	               |	Д_БюджетПрочихПроектовЗатраты.Деятельность
	               |ИЗ
	               |	Документ.Д_БюджетПрочихПроектов.Затраты КАК Д_БюджетПрочихПроектовЗатраты
	               |ГДЕ
	               |	Д_БюджетПрочихПроектовЗатраты.Ссылка.Сценарий = &Сценарий
	               |	И Д_БюджетПрочихПроектовЗатраты.ЦФО = &ЦФО
	               |	И НЕ Д_БюджетПрочихПроектовЗатраты.УИД В (&УИД)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Месяц,
	               |	ЦФОЗаявителя,
	               |	АвторЗаписи
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Сценарий", Параметры.Сценарий);
	Запрос.УстановитьПараметр("ЦФО", Параметры.Предприятие);
	Запрос.УстановитьПараметр("УИД", Параметры.УИД);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выгрузить();
	Для каждого ТекСтрока Из Выборка Цикл
		НоваяСтрока = НепринятыеСтроки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);	
		НоваяСтрока.Принять = Истина;
	КонецЦикла; 
		
КонецПроцедуры
