
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("", );
	ТекФорма = ПолучитьФорму("Документ.БП_Поручение.ФормаОбъекта", Новый Структура("Ключ", ПараметрКоманды), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Для каждого ТекЭлемент Из ПараметрКоманды Цикл
		Если БюджетныйНаСервере.ВернутьРеквизит(ТекЭлемент, "ЭтоГруппа") Тогда
			НовыйМассивПользователей = ДобавитьПодчиненных(ТекЭлемент, ПараметрКоманды);
			Для каждого ТекСтрока Из НовыйМассивПользователей Цикл
				НоваяСтрока = ТекФорма.Объект.СписокИсполнителей.Добавить();
				НоваяСтрока.Исполнитель = ТекСтрока;
			КонецЦикла; 
		Иначе
			НоваяСтрока = ТекФорма.Объект.СписокИсполнителей.Добавить();
			НоваяСтрока.Исполнитель = ТекЭлемент;
		КонецЕсли;
	КонецЦикла; 
	ТекФорма.Открыть();
КонецПроцедуры

&НаСервере
Функция ДобавитьПодчиненных(ТекЭлемент, ПараметрКоманды)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	(Пользователи.Родитель = &Родитель
	|			ИЛИ Пользователи.Родитель.Родитель = &Родитель
	|			ИЛИ Пользователи.Родитель.Родитель.Родитель = &Родитель
	|			ИЛИ Пользователи.Родитель.Родитель.Родитель.Родитель = &Родитель)";
	
	Запрос.УстановитьПараметр("Родитель", ТекЭлемент);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	
	
	
	
КонецФункции