
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСервер();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Д_ВидыВнутреннихДокументов.Ссылка,
	               |	Д_ВидыВнутреннихДокументов.Наименование,
	               |	"""" КАК Синоним,
	               |	Д_ВидыВнутреннихДокументов.ИмяДокумента,
	               |	Д_ВидыВнутреннихДокументов.Родитель
	               |ИЗ
	               |	Справочник.Д_ВидыВнутреннихДокументов КАК Д_ВидыВнутреннихДокументов
	               |ГДЕ
	               |	Д_ВидыВнутреннихДокументов.Предопределенный = ИСТИНА";
	
	
	Результат = Запрос.Выполнить();
	ВыборкаВидовДокументов = Результат.Выгрузить();
	

	ТипыЗаявок = Метаданные.Задачи.Задача.Реквизиты["Заявка"].Тип.Типы();
	
	
	Для каждого ТекДокументМетаданные Из Метаданные.Документы Цикл
		Для каждого ТекущийТип Из ТипыЗаявок Цикл
			Если ТипЗнч(Документы[ТекДокументМетаданные.Имя].ПустаяСсылка()) = ТекущийТип Тогда
				ТекСтроки = ВыборкаВидовДокументов.НайтиСтроки(Новый Структура("Наименование", ТекДокументМетаданные.Синоним));
				Для каждого ТекСтрока Из ТекСтроки Цикл
					ТекСтрока.ИмяДокумента = ТекДокументМетаданные.Имя;
					ТекПодчиненные = ВыборкаВидовДокументов.НайтиСтроки(Новый Структура("Родитель", ТекСтрока.Ссылка));
					Для каждого ТекПодчиненный Из ТекПодчиненные Цикл
						ТекПодчиненный.ИмяДокумента = ТекДокументМетаданные.Имя;					
					КонецЦикла; 
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	
	Для каждого ТекСтрока Из ВыборкаВидовДокументов Цикл
		ТекСтрокаОб = ТекСтрока.Ссылка.ПолучитьОбъект();
		ТекСтрокаОб.ИмяДокумента = ТекСтрока.ИмяДокумента;
		ТекСтрокаОб.Записать();	
	КонецЦикла; 
	

КонецПроцедуры

