
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БюджетныйНаСервере.ДействияПриСозданииФормыСправочника(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ДатаЗаписи = ТекущаяДата();
	ПолучитьДолю();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДолю()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	ДоляУчредителяСрезПоследних.ДоляУчредителя
	//|ИЗ
	//|	РегистрСведений.ДоляУчредителя.СрезПоследних(
	//|			&Дата1,
	//|			Предприятие = &Предприятие
	//|				И Учредитель = &Учредитель) КАК ДоляУчредителяСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Дата1", Объект.ДатаЗаписи);
	//Запрос.УстановитьПараметр("Предприятие", Объект.Предприятие);
	//Запрос.УстановитьПараметр("Учредитель", Объект.Ссылка);
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	Объект.Доля = Выборка.ДоляУчредителя;	
	//КонецЕсли;
	
КонецПроцедуры
