
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.УЧ_ВыплатаЗП.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УЧ_ВыплатаЗП.Подразделение КАК Подразделение,
	|	УЧ_ВыплатаЗП.Дата КАК Дата,
	|	УЧ_ВыплатаЗП.Номер КАК Номер,
	|	УЧ_ВыплатаЗП.Предприятие КАК Предприятие,
	|	УЧ_ВыплатаЗП.СуммаДокумента КАК СуммаДокумента,
	|	УЧ_ВыплатаЗП.ТабличнаяЧасть.(
	|		Сотрудник КАК Сотрудник,
	|		СУММА(Сумма) КАК Сумма,
	|		Сотрудник.Код КАК ТабельныйНомер
	|	) КАК ТабличнаяЧасть
	|ИЗ
	|	Документ.УЧ_ВыплатаЗП КАК УЧ_ВыплатаЗП
	|ГДЕ
	|	УЧ_ВыплатаЗП.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УЧ_ВыплатаЗП.ТабличнаяЧасть.(Сотрудник,
	|	Сотрудник.Код)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТабличнаяЧастьШапка = Макет.ПолучитьОбласть("ТабличнаяЧастьШапка");
	ОбластьТабличнаяЧасть = Макет.ПолучитьОбласть("ТабличнаяЧасть");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();
	ТабДок.Автомасштаб = Истина;
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;


		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.СуммаДокументаПрописью = ЧислоПрописью(Выборка.СуммаДокумента,"ЧЦ=15;ЧДЦ=2","рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТабличнаяЧастьШапка);
		ВыборкаТабличнаяЧасть = Выборка.ТабличнаяЧасть.Выбрать();
		Пока ВыборкаТабличнаяЧасть.Следующий() Цикл
			ОбластьТабличнаяЧасть.Параметры.Заполнить(ВыборкаТабличнаяЧасть);
			ТабДок.Вывести(ОбластьТабличнаяЧасть, ВыборкаТабличнаяЧасть.Уровень());
		КонецЦикла;
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПодвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    
    Параметры.СпособПоискаСтроки = СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть;
    
КонецПроцедуры