Функция СерииНоменклатурыИспользуются() Экспорт
	
	Счет41 = ПланыСчетов.Учетный.Счет41();
	Используется = Ложь;
	Для каждого ТекСубконто Из Счет41.ВидыСубконто Цикл
		Если ТекСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Серии номенклатуры", Истина) Тогда
			Используется = Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Используется;
	
КонецФункции // ()

Функция СоздатьПолучитьСерию(Владелец, ДатаПроизводства, СрокГодности = Неопределено, ГоденДо = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Владелец = &Владелец
	|	И НАЧАЛОПЕРИОДА(СерииНоменклатуры.ДатаПроизводства, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПроизводства, ДЕНЬ)
	|	И (СерииНоменклатуры.ГоденДо = &ГоденДо
	|			ИЛИ СерииНоменклатуры.ГоденДо = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ДатаПроизводства", ДатаПроизводства);
	Запрос.УстановитьПараметр("ГоденДо", ГоденДо);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		НоваяСерия.Владелец = Владелец;
		НоваяСерия.ДатаПроизводства = ДатаПроизводства;
		НоваяСерия.СрокГодности = СрокГодности;
		НоваяСерия.ГоденДо = ГоденДо;
		НоваяСерия.Наименование = Формат(ДатаПроизводства, "ДФ=dd.MM.yyyy");
		НоваяСерия.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат НоваяСерия.Ссылка;
	КонецЕсли;
	
КонецФункции // ()


Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = ?(ЗначениеЗаполнено(Данные.Ссылка.ДатаПроизводства), Формат(Данные.Ссылка.ДатаПроизводства,"ДФ=dd.MM.yyyy"), Данные.Ссылка.Наименование);
КонецПроцедуры


Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	Запрос = Новый Запрос;
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СерииНоменклатуры.Ссылка КАК Ссылка,
			|	СерииНоменклатуры.Представление КАК Представление,
			|	СерииНоменклатуры.ДатаПроизводства КАК ДатаПроизводства
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|ГДЕ
			|	СерииНоменклатуры.Владелец = &Владелец И СТРОКА(СерииНоменклатуры.ДатаПроизводства) ПОДОБНО &СтрокаПоиска
			
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПроизводства";  
			Запрос.УстановитьПараметр("Владелец", Параметры.Отбор.Владелец); 
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СерииНоменклатуры.Ссылка КАК Ссылка,
			|	СерииНоменклатуры.Представление КАК Представление,
			|	СерииНоменклатуры.ДатаПроизводства КАК ДатаПроизводства
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|ГДЕ
			|	СТРОКА(СерииНоменклатуры.ДатаПроизводства) ПОДОБНО &СтрокаПоиска
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаПроизводства";
		КонецЕсли;	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СерииНоменклатуры.Ссылка КАК Ссылка,
		|	СерииНоменклатуры.Представление КАК Представление,
		|	СерииНоменклатуры.ДатаПроизводства КАК ДатаПроизводства
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СТРОКА(СерииНоменклатуры.ДатаПроизводства) ПОДОБНО &СтрокаПоиска
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПроизводства";
	КонецЕсли;
	Запрос.УстановитьПараметр("СтрокаПоиска", СокрЛП(Параметры.СтрокаПоиска)+"%"); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ДанныеВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
	КонецЦикла;
	
	Для каждого СтрокаВыбора Из ДанныеВыбора Цикл
		СтрокаВыбора.Представление = ВернутьФорматированнуюСтрокуПоиска(СтрокаВыбора.Представление,Параметры.СтрокаПоиска);
	КонецЦикла;
	
КонецПроцедуры 

Функция ВернутьФорматированнуюСтрокуПоиска(СтрокаДляРазбора,СтрокаПоиска) Экспорт
	
	СтрокаЗамены = "";
	Для стр = 1 По СтрДлина(СтрокаПоиска) Цикл
		СтрокаЗамены = СтрокаЗамены + "@";
	КонецЦикла;
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрЗаменить(СтрокаДляРазбора,СтрокаПоиска,СтрокаЗамены+"_"+СтрокаЗамены),СтрокаЗамены);
	ФормСтрока = Новый Массив;
	Для каждого СтрокаИзМассива Из МассивСтрок Цикл
		Если СтрокаИзМассива = "_" Тогда
			ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаПоиска,Новый Шрифт(,,Истина),WebЦвета.ЗеленыйЛес));
		Иначе
			ФормСтрока.Добавить(Новый ФорматированнаяСтрока(СтрокаИзМассива))
		КонецЕсли;
	КонецЦикла;
	Возврат Новый ФорматированнаяСтрока(ФормСтрока); 
	
КонецФункции 




