Функция СерииНоменклатурыИспользуются() Экспорт
	
	Счет41 = ПланыСчетов.Учетный.Счет41();
	Используется = Ложь;
	Для каждого ТекСубконто Из Счет41.ВидыСубконто Цикл
		Если ТекСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Серии номенклатуры", Истина) Тогда
			Используется = Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Используется;
	
КонецФункции // ()

Функция СоздатьПолучитьСерию(Владелец, ДатаПроизводства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СерииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|ГДЕ
	|	СерииНоменклатуры.Владелец = &Владелец
	|	И НАЧАЛОПЕРИОДА(СерииНоменклатуры.ДатаПроизводства, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаПроизводства, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ДатаПроизводства", ДатаПроизводства);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		НоваяСерия.Владелец = Владелец;
		НоваяСерия.ДатаПроизводства = ДатаПроизводства;
		НоваяСерия.Наименование = Формат(ДатаПроизводства, "ДФ=dd.MM.yyyy");
		НоваяСерия.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат НоваяСерия.Ссылка;
	КонецЕсли;
	
КонецФункции // ()

