
Процедура ПередЗаписью(Отказ)
	Наименование = Формат(ДатаПроизводства, "ДФ=dd.MM.yyyy");
    Если Наименование = "" Тогда
		Наименование = "<Без серии>";	
	КонецЕсли;
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииНоменклатуры.Представление КАК Представление
		|ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ
		|	СерииНоменклатуры.Владелец = &Владелец
		|	И СерииНоменклатуры.Ссылка <> &Ссылка
		|	И СерииНоменклатуры.ДатаПроизводства = &ДатаПроизводства
		|	И СерииНоменклатуры.ГоденДо = &ГоденДо";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаПроизводства", ДатаПроизводства);
	Запрос.УстановитьПараметр("ГоденДо", ГоденДо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТекстСообщения = "Серия номенклатуры с указанными датой производства и окончанием срока годности уже существует (";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если Прав(ТекстСообщения,1) = "(" Тогда
			ТекстСообщения = ТекстСообщения + ВыборкаДетальныеЗаписи.Представление;
		Иначе
			ТекстСообщения = ТекстСообщения + "," + ВыборкаДетальныеЗаписи.Представление;
		КонецЕсли;
	КонецЦикла;
	ТекстСообщения = ТекстСообщения + ")";
	Отказ = Истина;
	Сообщить(ТекстСообщения);
	КонецЕсли;

	
	
	
	
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверятьЗаполнениеГоденДо = Справочники.сабМониторВнедрения.НайтиПоНаименованию("ПроверятьЗаполнениеГоденДо", Истина).Значение;
	Если Не ПроверятьЗаполнениеГоденДо = Неопределено И ПроверятьЗаполнениеГоденДо Тогда
		ПроверяемыеРеквизиты.Добавить("ГоденДо");	
	КонецЕсли;
	
КонецПроцедуры
