Процедура ДействияПриСозданииФормыСправочника(Форма, Параметры = Неопределено) экспорт
		
КонецПроцедуры

Процедура ДействияПриСозданииФормыДокумента(Форма, Объект) экспорт
	
	ДонастроитьФункционалДокументовТМЦ(Форма, Объект);
		
КонецПроцедуры

Процедура ДонастроитьФункционалДокументовТМЦ(Форма, Объект)
	Если НЕ Объект = Неопределено И Объект.Свойство("Ссылка") Тогда
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.УЧ_ПеремещениеТоваров") Тогда
			Форма.Элементы.ВидОперации.РежимВыбораИзСписка = Истина;
			Форма.Элементы.ВидОперации.СписокВыбора.Очистить();
			Форма.Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПеремещений.Перемещение"));
			Форма.Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПеремещений.ПеремещениеНаПредприятие"));
			Форма.Элементы.ВидОперации.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПеремещений.ПеремещениеНаПредприятиеБезВозмещения"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДозаполнитьНоваяЗадача(Задача, Исполнитель, Заголовок, БП, ТочкаМаршрутаБизнесПроцесса, ВозвратСсылки = Ложь, Предприятие = "", ДокументОбязательныйКПрикреплению = Неопределено, ВРаботе = Ложь, СтрокаТЧБП = Неопределено) Экспорт
	
	Попытка
		Задача.Предприятие = БП.Заявка.Предприятие;	
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Предприятие) Тогда
		Задача.Предприятие = Предприятие;	
	КонецЕсли;
	
	Если ТипЗнч(БП) = Тип("БизнесПроцессСсылка.ЗаявкиАдминистратору") Тогда
		Попытка
			Задача.Проект = Документы.Д_ОбращенияВТехПоддержку.ПолучитьРПервогоРодителяПроекта(БП.Заявка.Проект);	
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

Процедура ЗапросНаДоступныеПроекты(Запрос) Экспорт
	
	Запрос.Текст = "ВЫБРАТЬ
		|	Проекты.Ссылка КАК Родитель0,
		|	Проекты.Родитель КАК Родитель1,
		|	Проекты.Родитель.Родитель КАК Родитель2,
		|	Проекты.Родитель.Родитель.Родитель КАК Родитель3,
		|	Проекты.Родитель.Родитель.Родитель.Родитель КАК Родитель4,
		|	Проекты.Родитель.Родитель.Родитель.Родитель.Родитель КАК Родитель5
		|ПОМЕСТИТЬ Родители
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Родители.Родитель5 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ИЛИ Родители.Родитель5 ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА Родители.Родитель4 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|							ИЛИ Родители.Родитель4 ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА Родители.Родитель3 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|										ИЛИ Родители.Родитель3 ЕСТЬ NULL
		|									ТОГДА ВЫБОР
		|											КОГДА Родители.Родитель2 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|													ИЛИ Родители.Родитель2 ЕСТЬ NULL
		|												ТОГДА ВЫБОР
		|														КОГДА Родители.Родитель1 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|																ИЛИ Родители.Родитель1 ЕСТЬ NULL
		|															ТОГДА Родители.Родитель0
		|														ИНАЧЕ Родители.Родитель1
		|													КОНЕЦ
		|											ИНАЧЕ Родители.Родитель2
		|										КОНЕЦ
		|								ИНАЧЕ Родители.Родитель3
		|							КОНЕЦ
		|					ИНАЧЕ Родители.Родитель4
		|				КОНЕЦ
		|		ИНАЧЕ Родители.Родитель5
		|	КОНЕЦ КАК Родитель
		|ПОМЕСТИТЬ Род
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Родители КАК Родители
		|		ПО (Проекты.Ссылка = Родители.Родитель0
		|				ИЛИ Проекты.Ссылка = Родители.Родитель1
		|				ИЛИ Проекты.Ссылка = Родители.Родитель2
		|				ИЛИ Проекты.Ссылка = Родители.Родитель3
		|				ИЛИ Проекты.Ссылка = Родители.Родитель4
		|				ИЛИ Проекты.Ссылка = Родители.Родитель5)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА Родители.Родитель5 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|				ИЛИ Родители.Родитель5 ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА Родители.Родитель4 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|							ИЛИ Родители.Родитель4 ЕСТЬ NULL
		|						ТОГДА ВЫБОР
		|								КОГДА Родители.Родитель3 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|										ИЛИ Родители.Родитель3 ЕСТЬ NULL
		|									ТОГДА ВЫБОР
		|											КОГДА Родители.Родитель2 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|													ИЛИ Родители.Родитель2 ЕСТЬ NULL
		|												ТОГДА ВЫБОР
		|														КОГДА Родители.Родитель1 = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|																ИЛИ Родители.Родитель1 ЕСТЬ NULL
		|															ТОГДА Родители.Родитель0
		|														ИНАЧЕ Родители.Родитель1
		|													КОНЕЦ
		|											ИНАЧЕ Родители.Родитель2
		|										КОНЕЦ
		|								ИНАЧЕ Родители.Родитель3
		|							КОНЕЦ
		|					ИНАЧЕ Родители.Родитель4
		|				КОНЕЦ
		|		ИНАЧЕ Родители.Родитель5
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Род.Родитель КАК Родитель,
		|	ЕСТЬNULL(сабХронометражСрезПоследних.ДатаНачалаРабот, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаРабот
		|ИЗ
		|	Род КАК Род
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сабХронометраж.СрезПоследних КАК сабХронометражСрезПоследних
		|		ПО Род.Родитель = сабХронометражСрезПоследних.Предмет
		|			И (сабХронометражСрезПоследних.ДатаОкончанияРабот = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	(Род.Родитель.ДатаОкончания > &ТекущаяДата
		|			ИЛИ Род.Родитель.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Родитель
		|АВТОУПОРЯДОЧИВАНИЕ";

	

КонецПроцедуры // ()
