
&НаКлиенте
Процедура Выбрать(Команда)
	ДобавитьСтрокуВРеестр();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивЗаявок = Новый Массив;
	Если Параметры.Свойство("МассивСтруктурЗаявок") Тогда
		Для каждого ТекЗаявка Из Параметры.МассивСтруктурЗаявок Цикл
			НоваяСтрока = ВыбранныеЗаявки.Добавить();
			НоваяСтрока.ЗаявкаНаФинансирование = ТекЗаявка.Заявка;
			НоваяСтрока.Сумма = ТекЗаявка.Сумма;
			МассивЗаявок.Добавить(ТекЗаявка.Заявка);
		КонецЦикла; 
	КонецЕсли;
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия); 
	Список.Параметры.УстановитьЗначениеПараметра("ЗаявкиВТекреестре", МассивЗаявок);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДобавитьСтрокуВРеестр();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВРеестр()
	
	//Для Каждого ТекЗаявка Из Элементы.Список.ВыделенныеСтроки Цикл
	//Оповестить("ПередатьСтрокуЗаявкиНаФинансирование", Новый Структура("ТекЗаявка", Элементы.Список.ТекущиеДанные.Ссылка));
	//Сообщить("Заявка №" + Элементы.Список.ТекущиеДанные.Номер + " добавлена в реестр.");
	Если НЕ ВыбранныеЗаявки.НайтиСтроки(Новый Структура("ЗаявкаНаФинансирование", Элементы.Список.ТекущиеДанные.Ссылка)).Количество()  Тогда
		НоваяСтрока = ВыбранныеЗаявки.Добавить();
		НоваяСтрока.ЗаявкаНаФинансирование = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяСтрока.Сумма = Элементы.Список.ТекущиеДанные.Сумма;
	КонецЕсли;
	
	МассивЗаявок = Новый Массив;
	Для каждого ТекСтрока Из ВыбранныеЗаявки Цикл
		МассивЗаявок.Добавить(ТекСтрока.ЗаявкаНаФинансирование);
	КонецЦикла; 
	
	Список.Параметры.УстановитьЗначениеПараметра("ЗаявкиВТекреестре", МассивЗаявок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВозвратСтрокиЗаявки" Тогда
		МассивЗаявок = Новый Массив;
		Для каждого ТекСтрока Из ВыбранныеЗаявки Цикл
			МассивЗаявок.Добавить(ТекСтрока.ЗаявкаНаФинансирование);		
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавленныеЗаявкиПослеУдаления(Элемент)
	МассивЗаявок = Новый Массив;
	Для каждого ТекСтрока Из ВыбранныеЗаявки Цикл
		МассивЗаявок.Добавить(ТекСтрока.ЗаявкаНаФинансирование);
	КонецЦикла; 
	
	Список.Параметры.УстановитьЗначениеПараметра("ЗаявкиВТекреестре", МассивЗаявок);
КонецПроцедуры
