&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Период.ДатаНачала = Объект.ДатаНачала + 24*60*60;
		Период.ДатаОкончания = Объект.ДатаКонца;
	Иначе
		Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОтразитьГалочкуВключатьВПлан()
	Возврат Объект.ВидБюджета = Перечисления.Д_ВидыБюджета.ВариантБюджета;
КонецФункции // ()
 
&НаКлиенте
Процедура ВидБюджетаПриИзменении(Элемент)
	Элементы.ВлкючатьВПлан.Видимость = ОтразитьГалочкуВключатьВПлан();
	Если Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.ГодовойБюджет") Тогда
		Период.ДатаНачала = НачалоГода(ТекущаяДата() + 365*24*60*60);
		Период.ДатаОкончания = КонецГода(ТекущаяДата() + 365*24*60*60);
	ИначеЕсли Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.КвартальныйБюджет") Тогда	
		Период.ДатаНачала = НачалоКвартала(ТекущаяДата() + 90*24*60*60);
		Период.ДатаОкончания = КонецКвартала(ТекущаяДата() + 90*24*60*60);
	Иначе
		Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	ПередЗаписью(Ложь, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ВлкючатьВПлан.Видимость = ОтразитьГалочкуВключатьВПлан();
	УтвержденПриИзменении(Неопределено);
	ПланированиеПоИсточникамДСПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Объект.АктуальнаяДата = КонецМесяца(Объект.ДатаНачала) + 1;
	
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ВидБюджета) Тогда
		Если Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.МесячныйБюджет") ИЛИ Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.КорректировочныйБюджет") Тогда
			Объект.ДатаКонца = ДобавитьМесяц(КонецМесяца(Объект.ДатаНачала), 1);
		ИначеЕсли Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.КвартальныйБюджет") Тогда
			Объект.ДатаКонца = ДобавитьМесяц(КонецМесяца(Объект.ДатаНачала), 3);
		ИначеЕсли Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.ГодовойБюджет") Тогда
			Объект.ДатаКонца = ДобавитьМесяц(КонецМесяца(Объект.ДатаНачала), 12);
		КонецЕсли;
	КонецЕсли;
	
	
	 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеСценария(Элемент)
	Элементы.Наименование.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Объект.ДатаКонца) И ЗначениеЗаполнено(Объект.ВидБюджета) Тогда
		Если Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.МесячныйБюджет") ИЛИ Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.КорректировочныйБюджет") Тогда
			Наименование = Формат(Объект.ДатаКонца, "ДФ='ММММ гггг'");
		ИначеЕсли Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.КвартальныйБюджет") Тогда
			Наименование = Формат(Объект.ДатаКонца, "ДФ='к ""квартал"" гггг'");
		ИначеЕсли Объект.ВидБюджета = ПредопределенноеЗначение("Перечисление.Д_ВидыБюджета.ГодовойБюджет") Тогда
			Наименование = Формат(Объект.ДатаКонца, "ДФ=гггг");
		КонецЕсли;
		Элементы.Наименование.СписокВыбора.Добавить("План " + Строка(Наименование));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УтвержденПриИзменении(Элемент)
	//Элементы.ПризнакРедактирования.Доступность = НЕ Объект.Утвержден;
	//Элементы.ПризнакРедактированияБО.Доступность = НЕ Объект.Утвержден;
	//Если НЕ Элемент = Неопределено Тогда
	//	Объект.ПризнакРедактирования = Истина;
	//	Объект.ПризнакРедактированияБО = Истина;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ДатаНачала = НачалоМесяца(Период.ДатаНачала) - 1;
	Объект.АктуальнаяДата = НачалоМесяца(Период.ДатаНачала);
	Объект.ДатаКонца = КонецМесяца(Период.ДатаОкончания);
	СформироватьНаименованиеСценария(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПередЗаписью(Ложь, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеПоИсточникамДСПриИзменении(Элемент)
	Элементы.СоздаватьГрафикОплат.Доступность = Объект.ПланированиеПоИсточникамДС;
	Если НЕ Объект.ПланированиеПоИсточникамДС Тогда
		Объект.СоздаватьГрафикОплат = Ложь;	
	КонецЕсли;
КонецПроцедуры


