
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента",,,);
	ФормаПечати.Автозаголовок = Ложь;
	ФормаПечати.Заголовок = "Форма печати: " + Строка(ПараметрКоманды[0]);
	ФормаПечати.Результат = ТабДок;
	ФормаПечати.Открыть();

	//}}
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Документы.УЧ_НачислениеЗП.ПечатьРасчетнаяВедомость(ТабДок, ПараметрКоманды);
КонецПроцедуры
