
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	Об = Запись.Организация.ПолучитьОбъект();
	Об.Предприятие = Запись.Предприятие;
	Об.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчетаТЗ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчетаТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Д_ИсточникПП КАК Д_ИсточникПП
	               |		ПО БанковскиеСчетаТЗ.Ссылка = Д_ИсточникПП.БанковскиеСчета
	               |ГДЕ
	               |	БанковскиеСчетаТЗ.Владелец = &Владелец
	               |	И Д_ИсточникПП.БанковскиеСчета ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Владелец", Запись.Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.Предприятие = Запись.Предприятие;
		Об.Записать();
		
		НоваяЗапись = РегистрыСведений.Д_ИсточникПП.СоздатьМенеджерЗаписи();
		НоваяЗапись.БанковскиеСчета = Выборка.Ссылка;
		НоваяЗапись.Период = НачалоМесяца(ТекущаяДата());
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
	//обрабатываем договоры, т.к. есть реквизит предприятия. а нужен ли?
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	               |	ДоговорыКонтрагентов.Организация КАК Организация,
	               |	сабСоответствияОрганизацийПредприятиям.Предприятие КАК Предприятие
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сабСоответствияОрганизацийПредприятиям КАК сабСоответствияОрганизацийПредприятиям
	               |		ПО ДоговорыКонтрагентов.Организация = сабСоответствияОрганизацийПредприятиям.Организация
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Предприятие = ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)";
	
	//Запрос.УстановитьПараметр("", );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.Предприятие = Выборка.Предприятие;
		Об.Записать();	
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
