
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(КонтрольМинимальнойЦены)
	ТабДок = КалькуляцияИМаржаЗаказа(ПараметрКоманды);
		
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.АвтоМасштаб = Истина;
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента");
	ФормаПечати.Результат = ТабДок;
	ФормаПечати.Открыть();
	//}}
КонецПроцедуры

&НаСервере
Функция КалькуляцияИМаржаЗаказа(ПараметрКоманды)
	Возврат Документы.ЗаказКлиента.КалькуляцияИМаржаЗаказа(ПараметрКоманды);
КонецФункции