
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//Группа = Элементы.Добавить(
	//"сабАкт_РеквизитыРаботыРасценки",
	//Тип("ГруппаФормы"),
	//ЭтаФорма);
	
	//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Поведение  = ПоведениеОбычнойГруппы.Обычное;
	//Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	//Группа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	//Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	//Группа.Заголовок = "Расценки и работы";
	
	ТаблицаРасценки = Элементы.Добавить("РаботыИРасценки", Тип("ТаблицаФормы"), ЭтаФорма);
	ТаблицаРасценки.ПутьКДанным = "Объект.РаботыИРасценки";
	//ТаблицаУслуги.Подвал = Истина;
	//ТаблицаУслуги.УстановитьДействие("ПриОкончанииРедактирования", "ПриОкончанииРедактированияГрафик");
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиНоменклатура", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Номенклатура";
		
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСодержание", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Содержание";
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиКоличество", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Количество";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииРасценки");
	ЭлементТаблицыФормы.Ширина = 10;
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиЦена", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Цена";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииРасценки");
	ЭлементТаблицыФормы.Ширина = 10;
	
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСумма", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.Сумма";
	ЭлементТаблицыФормы.УстановитьДействие("ПриИзменении", "ПриИзмененииРасценки1");
	ЭлементТаблицыФормы.Ширина = 12;
		
	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСчетЗатрат", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.СчетЗатрат";

	ЭлементТаблицыФормы = Элементы.Добавить("РаботыИРасценкиСтатьяЗатрат", Тип("ПолеФормы"),ТаблицаРасценки);
	ЭлементТаблицыФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РаботыИРасценки.СтатьяЗатрат";
	
	Элементы.ИсходныеКомплектующие.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
	Элементы.РаботыИРасценки.Заголовок = "Расценки и затраты";
	Элементы.РаботыИРасценки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРасценки(Элемент)
	ТекДанные = Элементы.РаботыИРасценки.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРасценки1(Элемент)
	ТекДанные = Элементы.РаботыИРасценки.ТекущиеДанные;
	ТекДанные.Цена = ?(ТекДанные.Количество, ТекДанные.Сумма / ТекДанные.Количество, 0);
КонецПроцедуры

&НаСервере
Процедура УУ_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(Объект.ИсходныеКомплектующие) ИЛИ ЗначениеЗаполнено(Объект.РаботыИРасценки) Тогда
		ИндексПоляОбъект = ПроверяемыеРеквизиты.Найти("Объект");
		Если ИндексПоляОбъект <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексПоляОбъект);
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры


