Функция ПолучитьСчетаВзаиморасчетов() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчетныйВидыСубконто.Ссылка КАК Ссылка,
	|	УчетныйВидыСубконто.Ссылка.Код КАК Код,
	|	УчетныйВидыСубконто.Ссылка.Наименование КАК Наименование
	|ПОМЕСТИТЬ Вр
	|ИЗ
	|	ПланСчетов.Учетный.ВидыСубконто КАК УчетныйВидыСубконто
	|ГДЕ
	|	УчетныйВидыСубконто.ВидСубконто = &ВидСубконто
	|	И УчетныйВидыСубконто.Ссылка.ЗапретитьИспользоватьВПроводках = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетныйВидыСубконто.Ссылка,
	|	УчетныйВидыСубконто.Ссылка.Код,
	|	УчетныйВидыСубконто.Ссылка.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вр.Ссылка КАК Ссылка,
	|	Вр.Код КАК Код,
	|	Вр.Наименование КАК Наименование,
	|	Учетный.ВидыСубконто.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ВидСубконто КАК ВидСубконто,
	|		Предопределенное КАК Предопределенное,
	|		ТолькоОбороты КАК ТолькоОбороты,
	|		Количественный КАК Количественный,
	|		Крахмал КАК Крахмал,
	|		Валютный КАК Валютный,
	|		ВидСубконто.ТипЗначения КАК ТипЗначения
	|	) КАК ВидыСубконто
	|ИЗ
	|	Вр КАК Вр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Учетный КАК Учетный
	|		ПО Вр.Ссылка = Учетный.Ссылка";
	
	
	Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Контрагенты", Истина));
	
	Результат = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат.Выбрать();

КонецФункции // ()
