
&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабСоответствияОрганизацийПредприятиям.Предприятие КАК Предприятие
	               |ИЗ
	               |	РегистрСведений.сабСоответствияОрганизацийПредприятиям КАК сабСоответствияОрганизацийПредприятиям
	               |ГДЕ
	               |	сабСоответствияОрганизацийПредприятиям.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Предприятие = Выборка.Предприятие; 	
	КонецЦикла;

	//Если Не ЗначениеЗаполнено(ПриоритетныйПорядокРасчетов) Тогда
	//	ПриоритетныйПорядокРасчетов = Перечисления.Д_ИсточникиСредств.БезНал;
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура УУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаСогласованиеДоговора") Тогда
		
		Отказ = сабОперОбщегоНазначения.ПроверкаСозданияНаОснованииНаСервере(ДанныеЗаполнения, Наименование, СтандартнаяОбработка, ТипЗнч(Ссылка));
		Если ЗначениеЗаполнено(Отказ.Ссылка) Тогда
			Возврат;		
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Владелец = ДанныеЗаполнения.Контрагент;
		Предприятие = ДанныеЗаполнения.Предприятие;
		Дата = ДанныеЗаполнения.ДатаДоговора;
		//Код = ДанныеЗаполнения.НомерДоговора;
		Номер = ДанныеЗаполнения.НомерДоговора;
		Наименование = ДанныеЗаполнения.НаименованиеДоговора + " №" + ДанныеЗаполнения.НомерДоговора + " от " + Формат(ДанныеЗаполнения.ДатаДоговора, "ДФ=dd.MM.yyyy");
		Организация = ДанныеЗаполнения.ЮрЛицоКомпании;
		//СозданКоммерсантом = Ложь;
		Подписан = Истина;
		Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ШаблонДоговора = ДанныеЗаполнения.ШаблонДоговора;
		//ВидДоговора = ДанныеЗаполнения.ВидДоговора;
		//СтатьяДДС = ДанныеЗаполнения.СтатьяДДС;
		 
		
	КонецЕсли;

КонецПроцедуры
