
&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабСоответствияОрганизацийПредприятиям.Предприятие КАК Предприятие
	               |ИЗ
	               |	РегистрСведений.сабСоответствияОрганизацийПредприятиям КАК сабСоответствияОрганизацийПредприятиям
	               |ГДЕ
	               |	сабСоответствияОрганизацийПредприятиям.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Предприятие = Выборка.Предприятие; 	
	КонецЦикла;

	Если Не ЗначениеЗаполнено(ПриоритетныйПорядокРасчетов) Тогда
		ПриоритетныйПорядокРасчетов = Перечисления.Д_ИсточникиСредств.БезНал;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
