
&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабСоответствияОрганизацийПредприятиям.Предприятие КАК Предприятие
	               |ИЗ
	               |	РегистрСведений.сабСоответствияОрганизацийПредприятиям КАК сабСоответствияОрганизацийПредприятиям
	               |ГДЕ
	               |	сабСоответствияОрганизацийПредприятиям.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Предприятие = Выборка.Предприятие; 	
	КонецЦикла;

	//Если Не ЗначениеЗаполнено(ПриоритетныйПорядокРасчетов) Тогда
	//	ПриоритетныйПорядокРасчетов = Перечисления.Д_ИсточникиСредств.БезНал;
	//КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура УУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Д_ЗаявкаНаСогласованиеДоговора") Тогда
		
		Отказ = сабОперОбщегоНазначения.ПроверкаСозданияНаОснованииНаСервере(ДанныеЗаполнения, Наименование, СтандартнаяОбработка, ТипЗнч(Ссылка));
		Если ЗначениеЗаполнено(Отказ.Ссылка) Тогда
			Возврат;		
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Владелец = ДанныеЗаполнения.Контрагент;
		Предприятие = ДанныеЗаполнения.Предприятие;
		Дата = ДанныеЗаполнения.ДатаДоговора;
		//Код = ДанныеЗаполнения.НомерДоговора;
		Номер = ДанныеЗаполнения.НомерДоговора;
		Наименование = ДанныеЗаполнения.НаименованиеДоговора + " №" + ДанныеЗаполнения.НомерДоговора + " от " + Формат(ДанныеЗаполнения.ДатаДоговора, "ДФ=dd.MM.yyyy");
		Организация = ДанныеЗаполнения.ЮрЛицоКомпании;
		//СозданКоммерсантом = Ложь;
		Подписан = Истина;
		Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ШаблонДоговора = ДанныеЗаполнения.ШаблонДоговора;
		//ВидДоговора = ДанныеЗаполнения.ВидДоговора;
		//СтатьяДДС = ДанныеЗаполнения.СтатьяДДС;
	КонецЕсли;

КонецПроцедуры

&После("ПриЗаписи")
Процедура УУ_ПриЗаписи(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Ссылка.ДокументОснование) И ТипЗнч(Ссылка.ДокументОснование) = Тип("ДокументСсылка.Д_ЗаявкаНаСогласованиеДоговора") Тогда
		
		ПрикрепленныеОбъектыДоговора = ПолучитьПрикрепленныеОбъектыЗаявкиНаСД(Ссылка);
		
		Для Каждого ТекПрикрепленныйОбъект Из ПрикрепленныеОбъектыДоговора Цикл
			ДвоичныеДанныеПО = Новый ДвоичныеДанные(ТекПрикрепленныйОбъект.Том.ПолныйПутьWindows + ТекПрикрепленныйОбъект.ПутьКФайлу);
			АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеПО);
			
			
			ПараметрыНовогоФайла = РаботаСФайлами.ПараметрыДобавленияФайла("Описание, Вложение");
			ПараметрыНовогоФайла.ИмяБезРасширения = 	ТекПрикрепленныйОбъект.Наименование;
			ПараметрыНовогоФайла.РасширениеБезТочки = 	ТекПрикрепленныйОбъект.Расширение;
			ПараметрыНовогоФайла.ВремяИзмененияУниверсальное = ТекущаяУниверсальнаяДата();
			ПараметрыНовогоФайла.Служебный = Истина;
			ПараметрыНовогоФайла.ВладелецФайлов = Ссылка;
			ПараметрыНовогоФайла.Вложение = Истина;
			
			Попытка
				ФайлПослеПереноса = РаботаСФайлами.ДобавитьФайл(ПараметрыНовогоФайла, АдресВХранилище);
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ВызватьИсключение;
			КонецПопытки; 
			
			//УдалитьФайлы(ПутьДоФайла);	
		КонецЦикла;
		
	КонецЕсли;
	
	//запись в регистр отсрочки
	НоваяЗапись = РегистрыСведений.ОтсрочкаПоДоговорам.СоздатьМенеджерЗаписи();
	НоваяЗапись.Договор = Ссылка;
	НоваяЗапись.Период = ?(ЭтотОбъект.Дата = Дата('00010101'), Дата('20000101'), ЭтотОбъект.Дата);
	НоваяЗапись.Отсрочка = ЭтотОбъект.СрокОплаты;
	НоваяЗапись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ПолучитьПрикрепленныеОбъектыЗаявкиНаСД(Договор)
		
	МассивПрикрепленныхОбъектов = Новый Массив;
			
	СтруктураНаличияФайловДоговора = РегистрыСведений.НаличиеФайлов.Получить(Новый Структура("ОбъектСФайлами", Договор));	
	
	Если Не СтруктураНаличияФайловДоговора.ЕстьФайлы Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПрикрепленныеОбъекты.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.ПрикрепленныеОбъекты КАК ПрикрепленныеОбъекты
		|ГДЕ
		|	ПрикрепленныеОбъекты.Владелец = &Заявка";
		Запрос.УстановитьПараметр("Заявка", Договор.ДокументОснование);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивПрикрепленныхОбъектов.Добавить(Выборка.Объект);
		КонецЦикла;
		
	КонецЕсли;

	Возврат МассивПрикрепленныхОбъектов;
		
КонецФункции
