
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив);
	
	Если Не БюджетныйНаСервере.ЕстьСвойствоОбъекта(ЭтотОбъект, "ИмяФайла") Тогда
		ИмяФайла = Новый РеквизитФормы("ИмяФайла", ОписаниеТиповС, ,);
		ДобавляемыеРеквизиты.Добавить(ИмяФайла);
		ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	ГруппаОписание = Элементы.Найти("ГруппаОписание");
	
	Если ГруппаОписание <> Неопределено тогда
		
		КомандаЗагрузки = Команды.Добавить("сабЗагрузкаИзCSVКоманда"); 
		КомандаЗагрузки.Действие = "сабЗагрузкаИзCSV";
		КомандаЗагрузки.Заголовок = "Загрузить из файла"; 
		
		ИмяФайлаПолеВвода = Элементы.Добавить("ИмяФайлаЭлемент", Тип("ПолеФормы"), ГруппаОписание);		
		ИмяФайлаПолеВвода.Заголовок = "Имя файла";
		ИмяФайлаПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ИмяФайлаПолеВвода.ПутьКДанным = "ИмяФайла";
		ИмяФайлаПолеВвода.КнопкаВыбора = Истина;
		ИмяФайлаПолеВвода.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		ИмяФайлаПолеВвода.УстановитьДействие("НачалоВыбора", "ИмяФайлаНачалоВыбора");
		
		КнопкаЗагрузки = Элементы.Добавить("сабЗагрузкаИзCSVКнопка", Тип("КнопкаФормы"), ГруппаОписание); 
		КнопкаЗагрузки.Заголовок = "Загрузить из файла"; 	
		КнопкаЗагрузки.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаЗагрузки.ИмяКоманды = "сабЗагрузкаИзCSVКоманда";
		КнопкаЗагрузки.Отображение = ОтображениеКнопки.Текст;
	
	КонецЕсли;
		
КонецПроцедуры  

&НаКлиенте
Процедура ДиалогСВопросомДобавления(ЗагружаемыйФайл,к,КолСтрок)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЗагружаемыйФайл",ЗагружаемыйФайл);
	ДопПараметры.Вставить("к",к);
	ДопПараметры.Вставить("КолСтрок",КолСтрок);
	
    Оповещение = Новый ОписаниеОповещения("ПослеВопроса", ЭтотОбъект, ДопПараметры);	
 
    ПоказатьВопрос(Оповещение,
        "Добавить к существующим данным? В случае отказа (нет) табличный документ будет предварительно очищен.", 
        РежимДиалогаВопрос.ДаНетОтмена,
        0,
        КодВозвратаДиалога.Да, 
        "Добавление данных" 
    );    
 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВопроса(Результат, Параметры) Экспорт
	
	ЗагружаемыйФайл = Параметры.ЗагружаемыйФайл;
	к = Параметры.к;
	КолСтрок = Параметры.КолСтрок;
	ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для НомерСтроки=1 по КолСтрок Цикл
			
			Состояние("Идет обработка файла...",Формат(?(КолСтрок=0,0,((100*НомерСтроки)/КолСтрок)),"ЧЦ=3; ЧДЦ=0"));
			ОбработкаПрерыванияПользователя();	                
			ТекстСтроки = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
			ТабличныйДокумент.Область(ВысотаТаблицы-к+НомерСтроки+1,1).Текст = ТекстСтроки;
			
		КонецЦикла; 
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет тогда
		
		Для к=1 По ВысотаТаблицы цикл
			ТабличныйДокумент.Область(к+1,1).Текст = "";		
		КонецЦикла;        
			
		Для НомерСтроки=1 по КолСтрок Цикл
		
		Состояние("Идет обработка файла...",Формат(?(КолСтрок=0,0,((100*НомерСтроки)/КолСтрок)),"ЧЦ=3; ЧДЦ=0"));
		ОбработкаПрерыванияПользователя();	
		ТекстСтроки = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		ТабличныйДокумент.Область(НомерСтроки+1,1).Текст = ТекстСтроки;
		
		КонецЦикла;
	
	КонецЕсли;	


КонецПроцедуры
		
&НаКлиенте
Процедура сабЗагрузкаИзCSV(Команда)
	
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(ЭтаФорма.ИмяФайла);
	
	КолСтрок = ЗагружаемыйФайл.КоличествоСтрок();
	
	Если ТабличныйДокумент.ВысотаТаблицы > 1 тогда
		
		Для к=1 по ТабличныйДокумент.ВысотаТаблицы цикл
			Если ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы-к+1,1).Текст <> "" ИЛИ
				ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы-к+1,2).Текст <> "" тогда
				ДиалогСВопросомДобавления(ЗагружаемыйФайл,к,КолСтрок);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	
	иначе 
		
	Для НомерСтроки=1 по КолСтрок Цикл
		
		Состояние("Идет обработка файла...",Формат(?(КолСтрок=0,0,((100*НомерСтроки)/КолСтрок)),"ЧЦ=3; ЧДЦ=0"));
		ОбработкаПрерыванияПользователя();	
		ТекстСтроки = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		ТабличныйДокумент.Область(НомерСтроки+1,1).Текст = ТекстСтроки;
		
	КонецЦикла;
	
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент) 

	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр = "CSV (*.csv)|*.csv"; 
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	ДиалогФыбораФайла.ПредварительныйПросмотр = Истина;
	ДиалогФыбораФайла.ИндексФильтра = 0;
	Если ДиалогФыбораФайла.Выбрать() Тогда
		ЭтаФорма.ИмяФайла = ДиалогФыбораФайла.ПолноеИмяФайла
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УУ_ПриОткрытииПосле(Отказ)
	
	Если Элементы.Найти("КартинкаИнформация") <> Неопределено тогда
		Элементы.КартинкаИнформация.Видимость = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти("ОписаниеДействия") <> Неопределено тогда
		Элементы.ОписаниеДействия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
