
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ВидПеремещения", "ПоступлениеСОбособленногоПодразделения");
	ТекФорма = ПолучитьФорму("Документ.УЧ_ПеремещениеТоваров.Форма.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "ps", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ТекФорма.АвтоЗаголовок = Ложь;
	ТекФорма.Заголовок = "Поступления с обособленных подразделений";
	ТекФорма.Открыть();
	
КонецПроцедуры
