
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если НЕ Элементы.Список.ТекущиеДанные = Неопределено Тогда
	
	ВсяВидимость = БюджетныйНаСервере.РольДоступнаСервер("БюджетныйОтдел") ИЛИ БюджетныйНаСервере.РольДоступнаСервер("Администратор");
	
	
	Список.Параметры.УстановитьЗначениеПараметра("Предприятие", БюджетныйНаСервере.ПолучитьПредприятия());
	Список.Параметры.УстановитьЗначениеПараметра("БюджетнаяРоль", БюджетныйНаСервере.ВернутьРеквизит(БюджетныйНаСервере.ПолучитьПользователя(), "БюджетнаяРоль"));
	Список.Параметры.УстановитьЗначениеПараметра("ВсяВидимость", ВсяВидимость);
	
КонецПроцедуры
