
&НаКлиенте
Процедура ВыполнитьПоискПоПараметрам(Команда)
	СтруктураВозврата = ЗаполнитьПараметрыВозврата(Ложь);
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПоиска(Команда)
	СтруктураВозврата = ЗаполнитьПараметрыВозврата(Истина);
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте 
Функция ЗаполнитьПараметрыВозврата(ОтменаПоиска)
	СтруктураВозврата = Новый Структура;
	Если Не ОтменаПоиска Тогда
		СтруктураВозврата.Вставить("Источник", Источник);
		СтруктураВозврата.Вставить("Контрагент", Контрагент);
		СтруктураВозврата.Вставить("Основание", Основание);
		СтруктураВозврата.Вставить("Примечание", Примечание);
		СтруктураВозврата.Вставить("ЦФО", ЦФО);
		СтруктураВозврата.Вставить("ОтменаПоиска", ОтменаПоиска)
	Иначе
		СтруктураВозврата.Вставить("ОтменаПоиска", ОтменаПоиска)
	КонецЕсли;
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОтменаПоиска.Доступность = Параметры.Включен;
КонецПроцедуры
