Функция ФормаВыполненияЗадачи(ЗадачаСсылка, ТочкаМаршрутаСсылка, Выборка) Экспорт
	
	Если ТочкаМаршрутаСсылка = БизнесПроцессы.Поручение.ТочкиМаршрута.Действие2 Тогда 
		ИмяФормы = "БизнесПроцесс.Поручение.Форма.ФормаИсполнения";
		
	ИначеЕсли ТочкаМаршрутаСсылка = БизнесПроцессы.Поручение.ТочкиМаршрута.Действие3 Тогда 
		ИмяФормы = "БизнесПроцесс.Поручение.Форма.ФормаКонтроля";
	КонецЕсли;	
		
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ, ТочкаМаршрута, Исполнитель, Должность",
			ЗадачаСсылка, ТочкаМаршрутаСсылка.Имя, Выборка.Исполнитель, Выборка.Должность));
	Результат.Вставить("ИмяФормы", ИмяФормы);
	Возврат Результат;
	
КонецФункции

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.БП_Оповещение.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БП_Оповещение.Ссылка,
	|	БП_Оповещение.Автор,
	|	БП_Оповещение.Дата,
	|	БП_Оповещение.ДатаНачала,
	|	БП_Оповещение.Номер,
	|	БП_Оповещение.Описание,
	|	БП_Оповещение.СписокИсполнителей.(
	|		НомерСтроки,
	|		Исполнитель,
	|		Исполнено,
	|		Комментарии,
	|		ДатаВыполнения
	|	)
	|ИЗ
	|	Документ.БП_Оповещение КАК БП_Оповещение
	|ГДЕ
	|	БП_Оповещение.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ЗапросПоФайлам = Новый Запрос;
	ЗапросПоФайлам.Текст = 
	"ВЫБРАТЬ
	|	ФайлыДокументыПоФайлу.ВладелецФайла КАК Владелец,
	|	ФайлыДокументыПоФайлу.Ссылка КАК Файл
	|ИЗ
	|	Справочник.Файлы.ДокументыПоФайлу КАК ФайлыДокументыПоФайлу
	|ГДЕ
	|	ФайлыДокументыПоФайлу.ВладелецФайла В(&ВладелецФайла)
	|	И ВЫРАЗИТЬ(ФайлыДокументыПоФайлу.ВладелецФайла КАК Документ.БП_Оповещение).Автор = ФайлыДокументыПоФайлу.Ссылка.Автор";
	ЗапросПоФайлам.УстановитьПараметр("ВладелецФайла", Ссылка);
	ВыборкаПоФайлам = ЗапросПоФайлам.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПрикрепление = Макет.ПолучитьОбласть("Прикрепление");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокИсполнителейШапка = Макет.ПолучитьОбласть("СписокИсполнителейШапка");
	ОбластьСписокИсполнителей = Макет.ПолучитьОбласть("СписокИсполнителей");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Пока ВыборкаПоФайлам.Следующий() Цикл
			если Выборка.Ссылка = ВыборкаПоФайлам.Владелец тогда
				ОбластьПрикрепление.Параметры.Вложение = "Прикрепленный файл: " + Строка(ВыборкаПоФайлам.Файл);
				ОбластьПрикрепление.Параметры.РасшифровкаВложение = ВыборкаПоФайлам.Файл;// Новый Структура("Файл", ВыборкаПоФайлам.Файл);
				ТабДок.Вывести(ОбластьПрикрепление);
			КонецЕсли;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьСписокИсполнителейШапка);
		ВыборкаСписокИсполнителей = Выборка.СписокИсполнителей.Выбрать();
		Пока ВыборкаСписокИсполнителей.Следующий() Цикл
			ОбластьСписокИсполнителей.Параметры.Заполнить(ВыборкаСписокИсполнителей);
			ТабДок.Вывести(ОбластьСписокИсполнителей, ВыборкаСписокИсполнителей.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
