
&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Группа = Элементы.Добавить(
	ЭтаФорма,
	Тип("ГруппаФормы"),
	ЭтаФорма.Элементы.ГруппаШапкаЛевая);
	
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Группа.Заголовок = "Параметры для учета (Упр.):";
	
	ПолеВвода = Элементы.Добавить("Контрагент", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Контрагент";
	
	ПолеВвода = Элементы.Добавить("Договор", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Договор";
	
	ПолеВвода = Элементы.Добавить("Касса", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Касса";
	
КонецПроцедуры

&НаСервере
Процедура УУ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если сабОбщегоНазначенияПовтИсп.ПолучитьСерийныйУчет() Тогда
	//	ТекущийОбъект.ДополнительныеСвойства.Вставить("СинхронизироватьТЧСерииДокументаУУ",Истина); 
	//КонецЕсли;
КонецПроцедуры

