
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыПечати = Новый Структура();
	ПередаваемыйПараметрКоманды = Новый Массив;
	ПередаваемыйПараметрКоманды.Добавить(ПараметрКоманды);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ИмяМенеджераПечати = "Обработка.ПечатьОбщихФорм";
	ПараметрыОткрытия.ИменаМакетов		 = "СчетФактура";
	ПараметрыОткрытия.ПараметрКоманды	 = ПередаваемыйПараметрКоманды;
	ПараметрыОткрытия.ПараметрыПечати	 = ПараметрыПечати;
	
	// Откроем форму печати документов.
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, , КлючУникальности);
		
КонецПроцедуры
