
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	
	РеквыЗаказа = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрКоманды, "Организация, ВидОперации");

	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
	Если РеквыЗаказа.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацииВыпускаПродукции.Производство") Тогда
		ОткрытьФорму("Документ.ОтчетПроизводстваЗаСмену.Форма.ФормаВыпускПродукции", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе	
		ОткрытьФорму("Документ.ОтчетПроизводстваЗаСмену.Форма.ФормаДокументаОтчетПроизводстваЗаСмену", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
