
&НаКлиенте
Процедура СерииНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.СерииНоменклатуры.ТекущиеДанные.Номенклатура = Номенклатура;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИЗакрыть(Команда)
	СтруктураПараметров = ПолучитьМассивСтруктур();
	Закрыть(Новый Структура("НомерСтрокиРеализации, СерииНоменклатуры, СрокГодности2, ГоденДо", НомерСтрокиРеализации, СтруктураПараметров));
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтруктур()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(СерииНоменклатуры.Выгрузить());	
КонецФункции // ()


&НаКлиенте
Процедура СерииНоменклатурыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	КоличествоНовое = СерииНоменклатуры.Итог("Количество");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоНовое = СерииНоменклатуры.Итог("Количество");
КонецПроцедуры

&НаКлиенте
Процедура СерииНоменклатурыГоденДоПриИзменении(Элемент)
	Элементы.СерииНоменклатуры.ТекущиеДанные.СрокГодности2 = (Элементы.СерииНоменклатуры.ТекущиеДанные.ГоденДо - Элементы.СерииНоменклатуры.ТекущиеДанные.СерияНоменклатуры) / (24*60*60);
КонецПроцедуры

&НаКлиенте
Процедура СерииНоменклатурыСрокГодности2ПриИзменении(Элемент)
	Элементы.СерииНоменклатуры.ТекущиеДанные.ГоденДо = Элементы.СерииНоменклатуры.ТекущиеДанные.СерияНоменклатуры + 24*60*60*Элементы.СерииНоменклатуры.ТекущиеДанные.СрокГодности2;
КонецПроцедуры

&НаКлиенте
Процедура СерииНоменклатурыСерияНоменклатурыПриИзменении(Элемент)
	Элементы.СерииНоменклатуры.ТекущиеДанные.ГоденДо = Элементы.СерииНоменклатуры.ТекущиеДанные.СерияНоменклатуры + 24*60*60*Элементы.СерииНоменклатуры.ТекущиеДанные.СрокГодности2;
КонецПроцедуры
