
&НаКлиенте
Процедура УУ_сабЗагрузитьИзExcelПосле(Команда)
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.УУ_ФормаЗагрузки",,ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура УУ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УУ_ПериодДействияЦен.ДатаНачала = Объект.НачалоДействияЦен;
	УУ_ПериодДействияЦен.ДатаОкончания = Объект.ОкончаниеДействияЦен; 
	
	ПолеВвода = Элементы.Вставить("ДействуетБессрочно", Тип("ПолеФормы"), Элементы.ГруппаТипЦен, Элементы.ТипЦен);
	ПолеВвода.Заголовок = "Действует бессрочно";
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.ДействуетБессрочно"; 
	ПолеВвода.УстановитьДействие("ПриИзменении","ДействуетБессрочноПриИзменении");

	
	ПолеВвода = Элементы.Вставить("ПериодДействияТипаЦен", Тип("ПолеФормы"), Элементы.ГруппаТипЦен, Элементы.ДействуетБессрочно);
	ПолеВвода.Заголовок = "Период действия цен";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "УУ_ПериодДействияЦен"; 
	ПолеВвода.УстановитьДействие("ПриИзменении","УУ_ПериодДействияЦенПриИзменении"); 
	
	Элементы.ПериодДействияТипаЦен.Доступность = Не Объект.ДействуетБессрочно;
	
КонецПроцедуры

&НаКлиенте
Процедура УУ_ПериодДействияЦенПриИзменении(Элемент)

	Объект.НачалоДействияЦен = УУ_ПериодДействияЦен.ДатаНачала;
	Объект.ОкончаниеДействияЦен = УУ_ПериодДействияЦен.ДатаОкончания;  
	
	Если ЗначениеЗаполнено(УУ_ПериодДействияЦен.ДатаНачала) Или ЗначениеЗаполнено(УУ_ПериодДействияЦен.ДатаОкончания) Тогда
		Объект.ДействуетБессрочно = Ложь;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетБессрочноПриИзменении(Элемент)

	Объект.НачалоДействияЦен = "";
	Объект.ОкончаниеДействияЦен = ""; 
	УУ_ПериодДействияЦен = "";
	Элементы.ПериодДействияТипаЦен.Доступность = Не Объект.ДействуетБессрочно;
	Модифицированность = Истина;
	
КонецПроцедуры
