
&Вместо("ВидОбъектаПоТипу")
Функция УУ_ВидОбъектаПоТипу(Тип
	)
	XMLИмяТипа = XMLТип(Тип).ИмяТипа;
    ИмяКлассаМетаданных = СтрРазделить(XMLИмяТипа, ".")[0];
    
    Если ИмяКлассаМетаданных = "CatalogRef" Тогда
        Возврат "Справочник";    
    ИначеЕсли ИмяКлассаМетаданных = "ChartOfAccountsRef" Тогда
        Возврат "ПланСчетов"
    ИначеЕсли ИмяКлассаМетаданных = "ChartOfCharacteristicTypesRef" Тогда
        Возврат "ПланВидовХарактеристик"
    ИначеЕсли ИмяКлассаМетаданных = "BusinessProcessRef" Тогда
        Возврат "БизнесПроцесс"
    ИначеЕсли ИмяКлассаМетаданных = "TaskRef" Тогда
        Возврат "Задача"    
    ИначеЕсли ИмяКлассаМетаданных = "ChartOfCalculationTypesRef" Тогда
        Возврат "ПланВидовРасчета"
    ИначеЕсли ИмяКлассаМетаданных = "DocumentRef" Тогда
        Возврат "Документ"
    ИначеЕсли ИмяКлассаМетаданных = "EnumRef" Тогда
        Возврат "Перечисление"
    ИначеЕсли ИмяКлассаМетаданных = "ExchangePlanRef" Тогда
        Возврат "ПланОбмена"
    Иначе
        ВызватьИсключение ПодставитьПараметрыВСтроку(НСтр("ru = 'Неверный тип значения параметра (%1)'"), Строка(Тип));
	КонецЕсли;
	
КонецФункции
