
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Расширение = Метаданные.Справочники.сабМониторВнедрения.РасширениеКонфигурации();
	ТекущаяВерсия = Расширение.Версия;
КонецПроцедуры

&НаКлиенте
Процедура Декорация4Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://sab2up.ru");
КонецПроцедуры

 &НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://t.me/sabhelpdesk_bot");
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("support@sab2up.ru");
КонецПроцедуры

&НаКлиенте
Процедура Декорация11Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://portal.sab2up.ru");
КонецПроцедуры

&НаКлиенте
Процедура Декорация13Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://sab2up.ru");
КонецПроцедуры

&НаКлиенте
Процедура Декорация21Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://portal.sab2up.ru/~TqgWz");
КонецПроцедуры

&НаКлиенте
Процедура Декорация19Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://www.youtube.com/@user-lu1ct3re1n/videos");
КонецПроцедуры

&НаКлиенте
Процедура Декорация17Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://t.me/modmcount");
КонецПроцедуры

&НаКлиенте
Процедура Декорация15Нажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://wiki.sab2up.ru");
КонецПроцедуры


