
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийДокумент", Параметры.Документ);		
КонецПроцедуры

&НаСервере
Функция ОпределитьНужнуюФорму(ЗадачаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.БизнесПроцесс,
		|	Таблица.ТочкаМаршрута,
		|	Таблица.Исполнитель,
		|	Таблица.Должность
		|ИЗ
		|	Справочник.Задача КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗадачаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("БизнесПроцесс, ТочкаМаршрута");
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	Если Реквизиты.БизнесПроцесс = Неопределено ИЛИ Реквизиты.БизнесПроцесс.Пустая() Тогда
		Возврат Новый Структура();
	КонецЕсли;
	
	ТипБизнесПроцесса = Метаданные.НайтиПоТипу(ТипЗнч(Реквизиты.БизнесПроцесс));
		
	ПараметрыФормы = Справочники[ТипБизнесПроцесса.Имя].ФормаВыполненияСправочники(ЗадачаСсылка,
		Реквизиты.ТочкаМаршрута, Выборка);
	Возврат ПараметрыФормы;
	
КонецФункции


&НаСервере
Функция УзнатьФорму(Поручение)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	ИмяФормы = "Документ.БП_Поручение.Форма.ФормаКонтроля";
	Для каждого ТекИсполнитель Из Поручение.СписокИсполнителей Цикл
		Если ТекПользователь = ТекИсполнитель.Исполнитель Тогда
			ИмяФормы = "Документ.БП_Поручение.Форма.ФормаИсполнения";		
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
	Возврат ИмяФормы;
	
КонецФункции // ()
 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Элементы.Список.ТекущиеДанные.Заявка) = Тип("ДокументСсылка.Поручение") Тогда //если открываем поручение (документ)
		ИмяФормы = УзнатьФорму(Элементы.Список.ТекущиеДанные.Заявка);
		ОткрытьФорму(ИмяФормы, Новый Структура("Ключ", Элементы.Список.ТекущиеДанные.Заявка));
	Иначе //если открыываем БП
		ПараметрыФормы = ОпределитьНужнуюФорму(Элементы.Список.ТекущиеДанные.Ссылка);
		
		ИмяФормыВыполненияСправочники = "";
		Результат = ПараметрыФормы.Свойство("ИмяФормы", ИмяФормыВыполненияСправочники);
		Если Результат Тогда
			ОткрытьФорму(ИмяФормыВыполненияСправочники, ПараметрыФормы.ПараметрыФормы);
		КонецЕсли; 
	КонецЕсли;
	

	
КонецПроцедуры
