
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОткрытьФорму("РегистрСведений.ПараметрыРегламентныхЗаданийРасширения.Форма.ФормаСписка",ПолучитьПараметрыВыбора());
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыВыбора()

	ЗначениеОтбора = Новый Структура("РегламентноеЗадание", Перечисления.РегламентныеЗаданияРасширения.РассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
  Возврат ПараметрыВыбора;

КонецФункции

	
	

