
&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Модифицированность() Тогда
		сабОбщегоНазначенияБУХ.УстановитьМодифицированностьБУДокумента(ЭтотОбъект, Ссылка, РежимЗаписи);	
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура УУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		
		Отказ = сабОперОбщегоНазначения.ПроверкаСозданияНаОснованииНаСервере(ДанныеЗаполнения, ЭтотОбъект.Комментарий, СтандартнаяОбработка, ТипЗнч(Ссылка));
		Если Отказ.Признак = "##УжеСоздан" Тогда
			ВызватьИсключение "На основании Заказ на производство уже введен документ " + Отказ.Ссылка;
		ИначеЕсли Отказ.Признак = "##НеПроведен" Тогда
			ВызватьИсключение "Документ Заказ на производство не проведен. Ввод на основании не возможен.";
		КонецЕсли;
		
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийОтчетПроизводстваЗаСмену.ОтчетПроизводстваЗаСмену;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Проведен, Номер");
		ДокОснование = ДанныеЗаполнения;
		
		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.ТабличнаяЧасть Цикл
			НоваяСтрока = ЭтотОбъект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.КлючСтроки = СтрокаТЧ.УИД;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;
			Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
				ЭтотОбъект.Склад = СтрокаТЧ.Склад;				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаМатериалов Из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = ЭтотОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериалов);
			НоваяСтрока.Номенклатура = СтрокаМатериалов.Материал;
			НоваяСтрока.КлючСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.ИдентификаторСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.Распределяется;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаМатериалов.Материал.НоменклатурнаяГруппа;
		КонецЦикла;
		
		НовОбъект = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовОбъект, ЭтотОбъект);

		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.ТабличнаяЧасть Цикл
			НоваяСтрока = НовОбъект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.КлючСтроки = СтрокаТЧ.УИД;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;;
		КонецЦикла;
		
		Для Каждого СтрокаМатериалов Из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = НовОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериалов);
			НоваяСтрока.Номенклатура = СтрокаМатериалов.Материал;
			НоваяСтрока.КлючСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.ИдентификаторСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.Распределяется;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаМатериалов.Материал.НоменклатурнаяГруппа;
		КонецЦикла;
		
		ЗаполнениеДокументов.Заполнить(НовОбъект, ДанныеЗаполнения, Истина);
		
		ЭтотОбъект.Продукция.Очистить();
		ЭтотОбъект.Материалы.Очистить();
		
		Для каждого ТекСтрока Из НовОбъект.Продукция Цикл
			НоваяСтрока = ЭтотОбъект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		Для каждого ТекСтрока Из НовОбъект.Материалы Цикл
			НоваяСтрока = ЭтотОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УЧ_ВыпускПродукции") Тогда
		
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийОтчетПроизводстваЗаСмену.ОтчетПроизводстваЗаСмену;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Дата, Проведен, Номер");
		ДокОснование = ДанныеЗаполнения;
		
		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.ТабличнаяЧасть Цикл
			НоваяСтрока = ЭтотОбъект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.КлючСтроки = СтрокаТЧ.УИД;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;
			Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
				ЭтотОбъект.Склад = СтрокаТЧ.Склад;				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаМатериалов Из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = ЭтотОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериалов);
			НоваяСтрока.Номенклатура = СтрокаМатериалов.Материал;
			НоваяСтрока.КлючСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.ИдентификаторСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.Распределяется;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаМатериалов.Материал.НоменклатурнаяГруппа;
		КонецЦикла;
		
		НовОбъект = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовОбъект, ЭтотОбъект);

		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.ТабличнаяЧасть Цикл
			НоваяСтрока = НовОбъект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.КлючСтроки = СтрокаТЧ.УИД;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа;;
		КонецЦикла;
		
		Для Каждого СтрокаМатериалов Из ДанныеЗаполнения.Материалы Цикл
			НоваяСтрока = НовОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериалов);
			НоваяСтрока.Номенклатура = СтрокаМатериалов.Материал;
			НоваяСтрока.КлючСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.ИдентификаторСтроки = СтрокаМатериалов.УИДТЧ;
			НоваяСтрока.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.Распределяется;
			НоваяСтрока.НоменклатурнаяГруппа = СтрокаМатериалов.Материал.НоменклатурнаяГруппа;
		КонецЦикла;
		
		ЗаполнениеДокументов.Заполнить(НовОбъект, ДанныеЗаполнения, Истина);
		
		ЭтотОбъект.Продукция.Очистить();
		ЭтотОбъект.Материалы.Очистить();
		
		Для каждого ТекСтрока Из НовОбъект.Продукция Цикл
			НоваяСтрока = ЭтотОбъект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		Для каждого ТекСтрока Из НовОбъект.Материалы Цикл
			НоваяСтрока = ЭтотОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
