
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Не Параметры.Свойство("СтруктураПараметров") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("МножественныйВыбор") Тогда
		МножественныйВыбор = Истина;
	КонецЕсли;	
	
	СтруктураПараметров = Параметры.СтруктураПараметров;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Параметры.ТекстЗапроса;
	Для Каждого ПараметрЗапроса Из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение); 
	КонецЦикла;	
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаРезультатаЗапроса.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
    //Создание реквизитов формы
	МассивДобавляемыхРеквизитов = Новый Массив; 
	
	//МассивТиповТЗ = Новый Массив;
	//МассивТиповТЗ.Добавить(Тип("ТаблицаЗначений"));
	//
	//МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаВыбора", Новый ОписаниеТипов(МассивТиповТЗ), "", ""));
	//
	//ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 
	
	МассивДобавляемыхРеквизитов.Очистить();

	Для Каждого Колонка Из ТаблицаРезультатаЗапроса.Колонки Цикл
		Если МножественныйВыбор И Колонка.Имя = "ЗначениеВыбрано" Тогда
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов("Булево"), "ТаблицаВыбора", Колонка.Заголовок));    
		Иначе
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ТаблицаВыбора", Колонка.Заголовок));    
		КонецЕсли;	
	КонецЦикла; 
		
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 

	//Создание элементов формы
	//ТаблицаФормы = Элементы.Добавить("ТаблицаВыбора", Тип("ТаблицаФормы"));
	//ТаблицаФормы.ПутьКДанным      			= "ТаблицаВыбора";
	ТаблицаФормы = Элементы["ТаблицаВыбора"];
	//ТаблицаФормы.ТолькоПросмотр 			= Истина;
	
	ТаблицаФормы.УстановитьДействие("Выбор", "ТаблицаВыбораВыбор");

	Для Каждого Колонка Из ТаблицаРезультатаЗапроса.Колонки Цикл
		ПолеФормы = Элементы.Добавить(ТаблицаФормы.Имя + Колонка.Имя, Тип("ПолеФормы"), ТаблицаФормы);
		ПолеФормы.ПутьКДанным = "ТаблицаВыбора" + "." + Колонка.Имя;
		ПолеФормы.Заголовок   = Колонка.Имя;
		Если МножественныйВыбор И Колонка.Имя = "ЗначениеВыбрано" Тогда
			ПолеФормы.Вид         = ВидПоляФормы.ПолеФлажка;
		Иначе	
			ПолеФормы.Вид         = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(ТаблицаРезультатаЗапроса, "ТаблицаВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработкаВыбора();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора()
	
	ТекДанные = Элементы["ТаблицаВыбора"].ТекущиеДанные;
		
	Если МножественныйВыбор Тогда
		МассивСтрок = ТаблицаВыбора.НайтиСтроки(Новый Структура("ЗначениеВыбрано", Истина));
		Закрыть(МассивСтрок);
	Иначе	
		Структура = Новый Структура;
		Для Каждого Колонка Из Элементы.ТаблицаВыбора.ПодчиненныеЭлементы Цикл
			Структура.Вставить(Колонка.Заголовок, ТекДанные[Колонка.Заголовок]);
		КонецЦикла;
		Закрыть(Структура);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТаблицаВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбора();	
	
КонецПроцедуры


	