
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	РеквизитыДокумента = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрКоманды, "Предприятие, Контрагент, Договор, СуммаДокумента");
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("СпособЗаполнения","ТиповаяОперация");
	ЗначенияЗаполнения.Вставить("ТиповаяОперация", ПолучитьТиповуюОперациюОплатаКартой());
	ЗначенияЗаполнения.Вставить("Содержание", "Оплата банковской картой");
	ЗначенияЗаполнения.Вставить("Предприятие", РеквизитыДокумента.Предприятие);
	
	ПараметрыФормы = Новый Структура("Основание, ЗначенияЗаполнения", ПараметрКоманды, ЗначенияЗаполнения);
	Форма = ПолучитьФорму("Документ.УЧ_Операция.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ДанныеФормы = Форма.Объект;
	ЗаполнитьНаСервере(ДанныеФормы, ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	
	Попытка
		
		Форма["ПараметрТиповойОперацииКонтрагент"] = РеквизитыДокумента.Контрагент; 	
		
	Исключение
		
	КонецПопытки;
	
	Попытка
		
		Форма["ПараметрТиповойОперацииДоговор"] = РеквизитыДокумента.Договор;
		
	Исключение
		
	КонецПопытки;
	
	Попытка
		
		Форма["ПараметрТиповойОперацииСумма"] = РеквизитыДокумента.СуммаДокумента;
		
	Исключение
		
	КонецПопытки;

	
	Форма.Открыть();
КонецПроцедуры

Процедура ЗаполнитьНаСервере(ТекОбъект, ТекОснование)
	
	
	//Для каждого ТекСтрока Из ТекОбъект.Проводки Цикл
	//	ТекСтрока.Субконто1Кредит = ТекОснование.Контрагент;	
	//	ТекСтрока.Субконто2Кредит = ТекОснование.Договор;
	//	ТекСтрока.Сумма = ТекОснование.СуммаДокумента;
	//КонецЦикла;	
КонецПроцедуры

Функция ПолучитьТиповуюОперациюОплатаКартой()
	Возврат Справочники.ТиповыеОперации.НайтиПоНаименованию("Оплата банковской картой", Истина);
КонецФункции // ()


