
&НаКлиенте
Процедура Выбрать(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ИндексСтроки = 0;
	Для каждого ТекЗнач Из Счета Цикл
		Если Не ЗначениеЗаполнено(ТекЗнач.Значение) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен счет.";
			Сообщение.Поле = "Счета[" + Строка(ИндексСтроки) + "].Значение";
			//Сообщение.УстановитьДанные();
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Закрыть();
	
	Если Счета.Количество() Тогда
		Оповестить("ЗагрузкаСчетов", Новый Структура("Счета, СчетСверткиБалансовый, СчетСверткиЗабалансовый, Субконто1, Субконто2, Субконто3, Субконто25, Подразделение, ТипНоменклатуры, ГруппаНоменклатуры", Счета, СчетСверткиБалансовый, СчетСверткиЗабалансовый, Субконто1, Субконто2, Субконто3, Субконто25Счета.ВыгрузитьЗначения(), Подразделение, ТипНоменклатуры.ВыгрузитьЗначения(), ГруппаНоменклатуры.ВыгрузитьЗначения()));
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
	
		СчетСверткиБалансовый = ПланыСчетов.Учетный.Счет00();
	
	Исключение
	
	КонецПопытки;
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ЗапретитьИспользоватьВПроводках", Ложь);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ДенежныйСчет", Ложь);
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.СчетаЗначение.ПараметрыВыбора = НовыеПараметры;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеСчета(Команда)
	ВыбратьВсеСчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьВсеСчетаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Учетный.Ссылка КАК Ссылка,
	               |	Учетный.Код КАК Код
	               |ИЗ
	               |	ПланСчетов.Учетный КАК Учетный
	               |ГДЕ
	               |	Учетный.Забалансовый = ЛОЖЬ
	               |	И Учетный.ДенежныйСчет = ЛОЖЬ
	               |	И Учетный.ЗапретитьИспользоватьВПроводках = ЛОЖЬ
	               |	И НЕ Учетный.Ссылка = &СчетСвертки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
	
	Запрос.УстановитьПараметр("СчетСвертки", СчетСверткиБалансовый);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Счета.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Счета.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
КонецПроцедуры
