
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
//	
//	ТекПериод = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.Элементы[0].Значение;
//	
//	// передача отборов из скд
//	МассивОтборов = Новый Массив;
//	
//	Для Каждого Эл Из НастройкиДляКомпоновкиМакета.Отбор.Элементы Цикл
//		Если (Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Предприятие") И Эл.Использование) ИЛИ (Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") И Эл.Использование) Тогда 
//			МассивОтборов.Добавить(Эл);
//		КонецЕсли;	
//	КонецЦикла;
//	
//	ПараметрыОтчета = Новый Структура("Период, МассивОтборов", ТекПериод, МассивОтборов);
//	
//	ТЗ = ЗаполнитьТаблицуДанных(ПараметрыОтчета);
//	ВнешНабор = Новый Структура("ТЗ", ТЗ);
//			
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета, ДанныеРасшифровки, Неопределено);
//	
//	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешНабор, ДанныеРасшифровки, Истина);
//	
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
//	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);	
//	
//	СтандартнаяОбработка = Ложь;
//	
//КонецПроцедуры
