
&После("ЗарегистрироватьВПоследовательностиПередУдалением")
Процедура УУ_ЗарегистрироватьВПоследовательностиПередУдалением(Источник, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабОбработкаДокументов.ДокументУУ КАК ДокументУУ
	               |ИЗ
	               |	РегистрСведений.сабОбработкаДокументов КАК сабОбработкаДокументов
	               |ГДЕ
	               |	сабОбработкаДокументов.ДокументБУ = &ДокументБУ
	               |	И сабОбработкаДокументов.АвтообновленияЗаблокированы = ЛОЖЬ
	               |	И сабОбработкаДокументов.ПервичныйДокументУУ = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументБУ", Источник.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ДокументУУ) Тогда
			Продолжить;
		КонецЕсли;
		ТекОб = Выборка.ДокументУУ.ПолучитьОбъект();
		ТекОб.УстановитьПометкуУдаления(Истина);
		ТекОб.ПометкаУдаления = Истина;
		ТекОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
