
&НаСервере
Процедура ВыполнитьАвтозаполение()
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	сабСоответствиеСчетовИСубконто.СчетБУ КАК СчетБУ,
	|	сабСоответствиеСчетовИСубконто.СубконтоБУ1 КАК СубконтоБУ1,
	|	сабСоответствиеСчетовИСубконто.СубконтоБУ2 КАК СубконтоБУ2,
	|	сабСоответствиеСчетовИСубконто.СубконтоБУ3 КАК СубконтоБУ3,
	|	сабСоответствиеСчетовИСубконто.СчетУУ КАК СчетУУ,
	|	сабСоответствиеСчетовИСубконто.СубконтоУУ1 КАК СубконтоУУ1,
	|	сабСоответствиеСчетовИСубконто.СубконтоУУ2 КАК СубконтоУУ2,
	|	сабСоответствиеСчетовИСубконто.СубконтоУУ3 КАК СубконтоУУ3,
	|	сабСоответствиеСчетовИСубконто.Комментарии КАК Комментарии
	|ИЗ
	|	РегистрСведений.сабСоответствиеСчетовИСубконто КАК сабСоответствиеСчетовИСубконто";
		
	Результат = Запрос.Выполнить();
	ВыборкаСоотв = Результат.Выгрузить();
	
	ТекСтрока = Справочники.сабМониторВнедрения.НайтиПоНаименованию("Дата остатков", Истина);
	Если ЗначениеЗаполнено(ТекСтрока) Тогда
		Об = ТекСтрока.ПолучитьОбъект();
	Иначе
		Об = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	Об.Наименование = "Дата остатков";
	Об.Значение = ДатаВводаОстатков;
	Об.Записать();
	
	//Константы.УЧ_ДатаВводаОстатков.Установить(ДатаВводаОстатков);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабСоответствияОрганизацийПредприятиям.Организация КАК Организация
	               |ПОМЕСТИТЬ Организации
	               |ИЗ
	               |	РегистрСведений.сабСоответствияОрганизацийПредприятиям КАК сабСоответствияОрганизацийПредприятиям
				   |ГДЕ
				   |	НЕ сабСоответствияОрганизацийПредприятиям.Предприятие = Значение(Справочник.Предприятия.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.Счет КАК Счет,
	               |	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	               |	ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
	               |	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
	               |	ХозрасчетныйОстатки.Организация КАК Организация,
	               |	ХозрасчетныйОстатки.Валюта КАК Валюта,
	               |	ХозрасчетныйОстатки.Подразделение КАК Подразделение,
	               |	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма,
	               |	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
	               |	ХозрасчетныйОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
	               |	ХозрасчетныйОстатки.КоличествоОстаток КАК Количество,
	               |	ХозрасчетныйОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт,
	               |	ХозрасчетныйОстатки.КоличествоОстатокКт КАК КоличествоОстатокКт,
	               |	ХозрасчетныйОстатки.Счет.Код КАК СчетКод,
	               |	ХозрасчетныйОстатки.Организация.Предприятие КАК Предприятие
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&НаДату,
	               |			,
	               |			,
	               |			Организация В
	               |				(ВЫБРАТЬ
	               |					Организации.Организация КАК Организация
	               |				ИЗ
	               |					Организации КАК Организации)) КАК ХозрасчетныйОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СчетКод";
	
	Запрос.УстановитьПараметр("НаДату", ДатаВводаОстатков);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выгрузить();
	
	СписокОрганизаций = Выборка.Скопировать();
	СписокОрганизаций.Свернуть("Организация, Предприятие");
	
	Для каждого ТекОрганизация Из СписокОрганизаций Цикл
		НовыйДокумент = Документы.УЧ_ВводОстатков.СоздатьДокумент();
		НовыйДокумент.Предприятие = ТекОрганизация.Предприятие;
		НовыйДокумент.Дата = ДатаВводаОстатков;
		НайденныеСтроки = Выборка.НайтиСтроки(Новый Структура("Организация", ТекОрганизация.Организация)); 
		Для каждого ТекСтрока Из НайденныеСтроки Цикл
			
			Соотв = ВыборкаСоотв.НайтиСтроки(Новый Структура("СчетБУ", ТекСтрока.Счет));
			Для каждого ТекСчет Из Соотв Цикл
				НоваяСтрока = НовыйДокумент.ВводОстатковПрочее.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.Задолженность = Перечисления.Д_ДтКт.Дебет;
				НоваяСтрока.Счет = ТекСчет.СчетУУ;
				ИндексСубконто = 0;
				Для каждого ТекСубконто Из ТекСчет.СчетУУ.ВидыСубконто Цикл
					ИндексСубконто = ИндексСубконто + 1;
					Если ТекСубконто.ВидСубконто = ТекСчет.СубконтоУУ1 Тогда
						НоваяСтрока.Субконто1 = ТекСтрока["Субконто" + Строка(ИндексСубконто)];
					ИначеЕсли ТекСубконто.ВидСубконто = ТекСчет.СубконтоУУ2 Тогда
						НоваяСтрока.Субконто2 = ТекСтрока["Субконто" + Строка(ИндексСубконто)];
					ИначеЕсли ТекСубконто.ВидСубконто = ТекСчет.СубконтоУУ3 Тогда
						НоваяСтрока.Субконто3 = ТекСтрока["Субконто" + Строка(ИндексСубконто)];
					КонецЕсли;
				КонецЦикла; 
				
				Прервать;
			КонецЦикла; 
		КонецЦикла;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Автонастройка(Команда)
	ВыполнитьАвтозаполение();
	Объект.Выполнено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАвтомаршруты(Команда)
	ОткрытьФорму("Документ.УЧ_ВводОстатков.ФормаСписка",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекСтрока = Справочники.сабМониторВнедрения.НайтиПоНаименованию("Дата остатков", Истина);
	Если ЗначениеЗаполнено(ТекСтрока) Тогда
		ДатаВводаОстатков = ТекСтрока.Значение;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекСтрока = Справочники.сабМониторВнедрения.НайтиПоНаименованию("Дата остатков", Истина);
	Если ЗначениеЗаполнено(ТекСтрока) Тогда
		Об = ТекСтрока.ПолучитьОбъект();
	Иначе
		Об = Справочники.сабМониторВнедрения.СоздатьЭлемент();
	КонецЕсли;
	Об.Наименование = "Дата остатков";
	Об.Значение = ДатаВводаОстатков;
	Об.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСтатусыНастроек", Новый Структура("Ссылка, Наименование, Выполнено", Объект.Ссылка, Объект.Наименование, Объект.Выполнено));
КонецПроцедуры

