
&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Отчет.Предприятие.ЗаполнитьПометки(1);
КонецПроцедуры


&НаКлиенте
Процедура СнятьФлажки(Команда)
	Отчет.Предприятие.ЗаполнитьПометки(0);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьСпискаПредприятий = ?(БюджетныйНаСервере.ПолучитьПредприятия().Количество() > 1, 1, 0);
	Элементы.Группа6.Видимость = ВидимостьСпискаПредприятий;
	
	Группы = Новый Массив;
	Группы.Добавить(1);
	Группы.Добавить(7);
	Элементы.ОткрытьНастройки.Видимость = 0;
	
	БюджетныйНаСервере.ЗаполнитьСписокПредприятия(Отчет.Предприятие, Группы);
КонецПроцедуры

 &НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	БюджетныйНаКлиенте.РасшифроватьСумму(Элемент, Расшифровка);		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Сценарий1") Тогда //вызван отчет извне с параметрами
		Отчет.Сценарий1 = Параметры.Сценарий1;
		Отчет.Сценарий2 = Параметры.Сценарий2;
		Отчет.Период = Параметры.Период;
		Элементы.Группа.Видимость = Параметры.НастройкиВидимость;
		БюджетныйНаСервере.ЗаполнитьСписокПредприятия(Отчет.Предприятие, 0);
		Если ТипЗнч(Параметры.Предприятия) = Тип("Массив") ИЛИ ТипЗнч(Параметры.Предприятия) = Тип("СписокЗначений") Тогда
			Отчет.Предприятие.ЗаполнитьПометки(Истина);
		Иначе
			Отчет.Предприятие.НайтиПоЗначению(Параметры.Предприятие).Пометка = 1;		
		КонецЕсли;
		
		//Отчет.Предприятие = Параметры.Предприятие;
		Отчеты.Д_Себестоимость.ЗаполнитьТаблицу();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	Элементы.Группа.Видимость = 1 - Элементы.Группа.Видимость;
КонецПроцедуры

&НаСервере
Процедура ЗадатьПериод(Команда)
	Элементы.Период.Видимость = 1 - Элементы.Период.Видимость;	
КонецПроцедуры

&НаСервере
Функция ПолучитьСценарийФакта()

	Возврат Справочники.СценарииПланирования.Факт;

КонецФункции // ПолучитьСценарийФакта()
 
&НаКлиенте
Процедура КомпоновщикНастроекПользовательскиеНастройкиПриИзменении(Элемент)
	Сценарий1 = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение;
	Сценарий2 = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение;
	Период = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Значение;
	//Если Элемент.ТекущиеДанные.Настройка = "Сценарий 1" ИЛИ Элемент.ТекущиеДанные.Настройка = "Сценарий 2" Тогда
	//	Если НЕ Сценарий2 = ПолучитьСценарийФакта() И НЕ ПустаяСтрока(Сценарий2) Тогда
	//		Период.ДатаНачала = НачалоМесяца(БюджетныйНаСервере.ПолучитьПериодСценария(Сценарий2).Дата1 + 60 * 60 * 24);
	//		Период.ДатаОкончания = КонецМесяца(БюджетныйНаСервере.ПолучитьПериодСценария(Сценарий2).Дата2);
	//		Сообщить("Сц2");
	//	Иначе
	//		Период.ДатаНачала = НачалоМесяца(БюджетныйНаСервере.ПолучитьПериодСценария(Сценарий1).Дата1 + 60 * 60 * 24);
	//		Период.ДатаОкончания = КонецМесяца(БюджетныйНаСервере.ПолучитьПериодСценария(Сценарий1).Дата2);
	//		Сообщить("Сц1");
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	Элементы.Группа1.Видимость = 0;
	Элементы.ЗакрытьНастройки.Видимость = 0;
	Элементы.ОткрытьНастройки.Видимость = 1;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	Элементы.Группа1.Видимость = 1;
	Элементы.ЗакрытьНастройки.Видимость = 1;
	Элементы.ОткрытьНастройки.Видимость = 0;
КонецПроцедуры

&НаСервере
Функция ОпределитьДоступнуюНоменклатуру()
	МассивПП = Новый Массив;
	Для каждого ТекЗначение Из Отчет.Предприятие Цикл
		Если ТекЗначение.Пометка Тогда
			МассивПП.Добавить(ТекЗначение.Значение);	
		КонецЕсли;
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Предприятие В ИЕРАРХИИ(&Предприятие)";
	
	Запрос.УстановитьПараметр("Предприятие", МассивПП);
	
	Результат2 = Запрос.Выполнить();
	Выборка = Результат2.Выбрать();
	
	МассивНоменклатуры = Новый Массив;
	
	
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	Возврат МассивНоменклатуры;	

КонецФункции // ()
 

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МассивНоменклатуры = ОпределитьДоступнуюНоменклатуру();
	ОткрытьФорму("Справочник.Номенклатура.Форма.Д_ФормаВыбора", Новый Структура("СписокНоменклатур", МассивНоменклатуры), Элемент); 
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	ИтогоСумма = Формат(БюджетныйНаКлиенте.Просуммировать(Результат), "ЧДЦ=2");
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сумма(Команда)
    БюджетныйНаКлиенте.КопироватьВБуфер(ИтогоСумма);
КонецПроцедуры

&НаКлиенте
Процедура ГоризонтальныйВидОтчета(Команда)
	
	ПолучитьФорму("Отчет.Д_СебестоимостьСКД.Форма.ФормаОтчета").Открыть();	
	ЭтаФорма.Закрыть();
		
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("ПользовательскиеНастройки");
    ПараметрыОткрытия.ПользовательскиеНастройки = Элементы.КомпоновщикНастроекПользовательскиеНастройки.ТекущиеДанные;
	
	// только для горизонтального вида
	
	ОткрытьФорму("Отчет.Д_Себестоимость.Форма.ФормаПечати", ПараметрыОткрытия, ЭтаФорма, КлючУникальности); 
		
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
