
&НаСервере
Процедура ЗагрузитьНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьКоманду("сабЗагрузкаВыписокИзКлиентБанка", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Настройка = Новый Структура("УчетнаяЗапись, Отправитель, КоличествоДней", 
		УчетнаяЗапись, Отправитель, КоличествоДней);
	РеквизитФормыВЗначение("Объект").ПоместитьНастройкуВХранилище(Настройка);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройка = РеквизитФормыВЗначение("Объект").ИзвлечьНастройкуИзХранилища();
	
	Если ЗначениеЗаполнено(Настройка) тогда
		УчетнаяЗапись = Настройка.УчетнаяЗапись;
		Отправитель = Настройка.Отправитель;			   
		КоличествоДней = Настройка.КоличествоДней;			   
	КонецЕсли;
	
КонецПроцедуры
