
&НаКлиенте
Процедура Перенаправить(Команда)
	Если ЗначениеЗаполнено(НовыйИсполнитель) Тогда
		Закрыть(Новый Структура("НовыйИсполнитель, Комментарий", НовыйИсполнитель, Комментарий)); 
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите нового исполнителя";
		Сообщение.Поле = "НовыйИсполнитель";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Если Элементы.СписокВыбора_НовыйПользователь.СписокВыбора.Количество() Тогда
	//	СтандартнаяОбработка = Ложь;
	//	ТекЗначение = Неопределено;
	//	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПользовательНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("СтандартнаяОбработка", СтандартнаяОбработка)), Элементы.СписокВыбора_НовыйПользователь.СписокВыбора, Элемент, Элементы.СписокВыбора_НовыйПользователь.СписокВыбора.НайтиПоЗначению(НовыйИсполнитель));
	//Иначе
	//	СтандартнаяОбработка = Ложь;
	//	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", Новый Структура("ТекущаяСтрока, РежимВыбора", НовыйИсполнитель, Истина) ,Элемент); 
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	//СтандартнаяОбработка = ДополнительныеПараметры.СтандартнаяОбработка;
	//
	//
	//ТекЗначение = ВыбранныйЭлемент;
	//Если Не ТекЗначение = Неопределено Тогда
	//	
	//	Если ТекЗначение.Значение = "Выбрать из списка..." Тогда
	//		БюджетныйНаКлиенте.ПриНачалеВыбораРеквизитаВСписке(ЭтаФорма, "СписокВыбора_НовыйПользователь", ТекЗначение, "Пользователи", НовыйИсполнитель, СтандартнаяОбработка, Ложь);
	//	Иначе
	//		НовыйИсполнитель = ТекЗначение.Значение; 	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Подчиненные = БПСервер.ПолучитьМассивПрямыхПодчиненных();
	БюджетныйНаКлиенте.ЗаполнитьСписокРеквизита(ЭтаФорма, "СписокВыбора_НовыйПользователь", Подчиненные);
	
КонецПроцедуры

