&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если НЕ Параметры.Свойство("Сформировать") Тогда
	//	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Использование = Истина;
	//	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение = БюджетныйНаСервере.ПолучитьПоследнийВариантКвоты(;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеТекущегоВариантаПриИзменении(Элемент)
	ПользНастройкиСтарые = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	УстановитьТекущийВариант(НаименованиеТекущегоВарианта);
	НаименованиеТекущегоВарианта = КлючТекущегоВарианта;
	Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользНастройкиСтарые);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.НаименованиеТекущегоВарианта.СписокВыбора.Добавить("Основной", "Основной");
	Элементы.НаименованиеТекущегоВарианта.СписокВыбора.Добавить("Расширенный", "Расширенный");		
	//Элементы.НаименованиеТекущегоВарианта.СписокВыбора.Добавить("СравнениеКвотыИГрафиков", "Сравнение квоты и графиков");
	//Элементы.НаименованиеТекущегоВарианта.СписокВыбора.Добавить("СравнениеГрафиков", "Сравнение графиков");
	НаименованиеТекущегоВарианта = КлючТекущегоВарианта;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеТекущегоВариантаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Процедура ОбъединитьЯчейки()
	//сравнение с оригиналом
	//Для ТекСтолбец = 2 По 9 Цикл
	//	ЗначЯчейки = Неопределено;
	//	Адрес1 = Неопределено;
	//	Для НомСтроки = 8 По 200 Цикл
	//		ЗначЯчейки2 = Результат.Область("R" + НомСтроки + "C1").Текст;
	//		Если Не ЗначениеЗаполнено(ЗначЯчейки2) Тогда
	//			Продолжить;			
	//		КонецЕсли;
	//		Если ЗначЯчейки = ЗначЯчейки2 Тогда
	//			Результат.Область(Адрес1 + ":" + "R" + НомСтроки + "C" + ТекСтолбец).Объединить();
	//		Иначе	
	//			ЗначЯчейки = ЗначЯчейки2;
	//			Адрес1 = "R" + НомСтроки + "C" + ТекСтолбец;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
	
	МассиввСтолбцов = Новый Массив;
	МассиввСтолбцов.Добавить(4);
	МассиввСтолбцов.Добавить(6);
	
	
	
	Для Каждого ТекСтолбец из МассиввСтолбцов Цикл
		ЗначЯчейки = Неопределено;
		Адрес1 = Неопределено;
		Для НомСтроки = 8 По 200 Цикл
			ЗначЯчейки2 = Результат.Область("R" + НомСтроки + "C1").Текст;
			Если Не ЗначениеЗаполнено(ЗначЯчейки2) Тогда
				Прервать;			
			КонецЕсли;
			Если ЗначЯчейки = ЗначЯчейки2 Тогда
				Результат.Область(Адрес1 + ":" + "R" + НомСтроки + "C" + ТекСтолбец).Объединить();
			Иначе	
				ЗначЯчейки = ЗначЯчейки2;
				Адрес1 = "R" + НомСтроки + "C" + ТекСтолбец;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для ТекСтолбец = 1 По 1 Цикл
		ЗначЯчейки = Неопределено;
		Адрес1 = Неопределено;
		Для НомСтроки = 8 По 200 Цикл
			ЗначЯчейки2 = Результат.Область("R" + НомСтроки + "C1").Текст;
			Если Не ЗначениеЗаполнено(ЗначЯчейки2) Тогда
				Прервать;			
			КонецЕсли;
			Если ЗначЯчейки = ЗначЯчейки2 Тогда
				Результат.Область(Адрес1 + ":" + "R" + НомСтроки + "C" + ТекСтолбец).Объединить();
			Иначе	
				ЗначЯчейки = ЗначЯчейки2;
				Адрес1 = "R" + НомСтроки + "C" + ТекСтолбец;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	

КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	УстановитьИспользованиеПолейКоличество(Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы, ЗначениеЗаполнено(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Значение));
	
	ЭтаФорма.СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
	ОбъединитьЯчейки();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИспользованиеПолейКоличество(Элементы, ЕстьКоличество)
    
    Для Каждого Элемент Из Элементы Цикл 
        Если ТипЗнч(Элемент) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
            УстановитьИспользованиеПолейКоличество(Элемент.Элементы, ЕстьКоличество);
        КонецЕсли;
        
        Если Найти(Строка(Элемент.Поле),"Факт") = 1 Тогда
			Элемент.Использование = ЕстьКоличество;    
		КонецЕсли;
		Если Найти(Строка(Элемент.Поле),"Отклонение") = 1 Тогда
			Элемент.Использование = ЕстьКоличество;    
		КонецЕсли;
		Если Найти(Строка(Элемент.Поле),"ПользовательскиеПоля.Поле2") = 1 Тогда
			Элемент.Использование = ЕстьКоличество;    
		КонецЕсли;
		Если Найти(Строка(Элемент.Поле),"ПользовательскиеПоля.Поле3") = 1 Тогда
			Элемент.Использование = ЕстьКоличество;    
		КонецЕсли;

    КонецЦикла;
    
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбъединитьЯчейки" Тогда
		ОбъединитьЯчейки();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	//а=1;
КонецПроцедуры

