
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.УЧ_Операция.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УЧ_Операция.Дата,
	|	УЧ_Операция.Комментарий,
	|	УЧ_Операция.Номер,
	|	УЧ_Операция.Предприятие,
	|	УЧ_Операция.Проводки.(
	|		НомерСтроки,
	|		СчетДебет,
	|		ПодразделениеДт,
	|		Субконто1Дебет,
	|		Субконто2Дебет,
	|		Субконто3Дебет,
	|		СчетКредит,
	|		ПодразделениеКт,
	|		Субконто1Кредит,
	|		Субконто2Кредит,
	|		Субконто3Кредит,
	|		Количество,
	|		Крахмал,
	|		ВалютаКт,
	|		ВалютаДт,
	|		КурсКт,
	|		ВалСуммаКт,
	|		Сумма,
	|		Содержание,
	|		КурсДт,
	|		ВалСуммаДт
	|	)
	|ИЗ
	|	Документ.УЧ_Операция КАК УЧ_Операция
	|ГДЕ
	|	УЧ_Операция.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПроводкиШапка = Макет.ПолучитьОбласть("ПроводкиШапка");
	ОбластьПроводки = Макет.ПолучитьОбласть("Проводки");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
        ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПроводкиШапка);
		ВыборкаПроводки = Выборка.Проводки.Выбрать();
		Пока ВыборкаПроводки.Следующий() Цикл
			ОбластьПроводки.Параметры.Заполнить(ВыборкаПроводки);
			ТабДок.Вывести(ОбластьПроводки, ВыборкаПроводки.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
