Функция ЕстьЭлемент(КоллекцияЭлементов, НаименованиеПункта)
	Для каждого ТекЭлемент Из КоллекцияЭлементов Цикл
		Если ТекЭлемент.Пункт = НаименованиеПункта Тогда
			Возврат ТекЭлемент;	
		КонецЕсли;	
	КонецЦикла; 
	Возврат Неопределено;	

КонецФункции // ()

Процедура ЗаполнитьДеревоНавигации(Навигация, ТекЗадачи, ТекЗадачиУр1, ТекЗадачиУр2, ТекЗадачиУр3, ТекЗаданияУр2, КоличествоСтрок) Экспорт
	
	
	
	//Навигация.ПолучитьЭлементы().Очистить();
	ТекЭлемент = ЕстьЭлемент(Навигация.ПолучитьЭлементы(), "Текущие задачи");
	Если ТекЭлемент = Неопределено Тогда
		Раздел1 = Навигация.ПолучитьЭлементы().Добавить();
	Иначе
		Раздел1 = ТекЭлемент;
	КонецЕсли;
	Раздел1.Пункт = "Текущие задачи";
	Раздел1.ПунктПредставление = "Текущие задачи";
	Раздел1.Иерархия = 1;
	
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "Входящие");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "Входящие";
	НоваяСтрока.ПунктПредставление = "Входящие";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "В работе");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "В работе";
	НоваяСтрока.ПунктПредставление = "В работе";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "Делегированные мне");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "Делегированные мне";
	НоваяСтрока.ПунктПредставление = "Делегированные мне";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "Исходящие");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "Исходящие";
	НоваяСтрока.ПунктПредставление = "Исходящие";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "Инициированные");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "Инициированные";
	НоваяСтрока.ПунктПредставление = "Инициированные";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "На контроле");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "На контроле";
	НоваяСтрока.ПунктПредставление = "На контроле";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "Выполненные");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "Выполненные";
	НоваяСтрока.ПунктПредставление = "Выполненные";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	
	ТЗ = ТекЗадачиУр1;
	ТЗ2 = ТекЗадачиУр2;
	
	Для каждого ТекСтрокаРодителя Из ТЗ2 Цикл
		ТекРодитель = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), ТекСтрокаРодителя.Пункт);
		ТекРодитель.ПунктПредставление = ТекРодитель.Пункт + ?(ТекСтрокаРодителя.Колич, " (" + Строка(ТекСтрокаРодителя.Колич) + ")", "");
		Если ТекРодитель.Пункт = "Входящие" Тогда
			//ТекРодитель.ПунктПредставление = ТекРодитель.Пункт + ?(ТекСтрокаРодителя.Колич, " (" + Строка(ТекСтрокаРодителя.КоличНовая) + "/" + Строка(ТекСтрокаРодителя.Колич) + ")", "")
			ТекРодитель.НовоеПлюс = ?(ТекСтрокаРодителя.КоличНовая, "+" + Строка(ТекСтрокаРодителя.КоличНовая), "");
		//Иначе
			
		КонецЕсли;
		ТекРодитель.Колич = ТекСтрокаРодителя.Колич;
		ТекРодитель.КоличНовая = ТекСтрокаРодителя.КоличНовая;
		Если НЕ ТекРодитель = Неопределено Тогда
			ОтобранныеСтроки = ТЗ.НайтиСтроки(Новый Структура("Пункт", ТекРодитель.Пункт));
			Для каждого ТекСтрока Из ОтобранныеСтроки Цикл
				ТекЭл = ЕстьЭлемент(ТекРодитель.ПолучитьЭлементы(), ТекСтрока.ТипДокумента);
				Если ТекЭл = Неопределено  Тогда
					НоваяСтрока = ТекРодитель.ПолучитьЭлементы().Добавить();
				Иначе	
					НоваяСтрока = ТекЭл;
				КонецЕсли;
				НоваяСтрока.Пункт = ТекСтрока.ТипДокумента;
				
				НоваяСтрока.ПунктПредставление = ТекСтрока.ТипДокумента + ?(ТекСтрока.Колич, " (" + Строка(ТекСтрока.Колич) + ")", "");
				
				Если ТекРодитель.Пункт = "Входящие" Тогда
					//НоваяСтрока.ПунктПредставление = ТекСтрока.ТипДокумента + ?(ТекСтрока.Колич, " (" + Строка(ТекСтрока.КоличНовая) + "/" + Строка(ТекСтрока.Колич) + ")", "");
					НоваяСтрока.НовоеПлюс = ?(ТекСтрока.КоличНовая, "+" + Строка(ТекСтрока.КоличНовая), "");
				//Иначе	
					
				КонецЕсли;
				НоваяСтрока.Иерархия = 3;
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
	
	//убираем "+1" если нет входящих задач
	Если НЕ ТЗ2.НайтиСтроки(Новый Структура("Пункт", "Входящие")).Количество() Тогда
		Для каждого ТекРодитель Из Раздел1.ПолучитьЭлементы() Цикл
			Если ТекРодитель.Пункт = "Входящие" Тогда
				ТекРодитель.НовоеПлюс = "";
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	//алгоритм удаления лишних строк дерева
	ПервыйУровень = Навигация.ПолучитьЭлементы();
	Для каждого ТекЭл1Ур Из ПервыйУровень Цикл
		ВторойУровень = ТекЭл1Ур.ПолучитьЭлементы();
		Для каждого ТекЭл2Ур Из ВторойУровень Цикл
			ТретийУровень = ТекЭл2Ур.ПолучитьЭлементы();
			МассивУдаленных = новый Массив;
			Для каждого ТекЭл3Ур Из ТретийУровень Цикл
				ОтобранныеСтроки = ТекЗадачи.НайтиСтроки(Новый Структура("Пункт, ТипДокумента", ТекЭл2Ур.Пункт, ТекЭл3Ур.Пункт));
				Если НЕ ОтобранныеСтроки.Количество() Тогда
					МассивУдаленных.Добавить(ТекЭл3Ур);			
				КонецЕсли;
			КонецЦикла; 
			//удаляем лишние
			Для каждого ТекУд Из МассивУдаленных Цикл
				ТретийУровень.Удалить(ТекУд);
			КонецЦикла; 
			
		КонецЦикла; 
	КонецЦикла; 
	
	
	
	
	ТекЭлемент = ЕстьЭлемент(Навигация.ПолучитьЭлементы(), "Изменения в 1С");
	Если ТекЭлемент = Неопределено Тогда
		Раздел1 = Навигация.ПолучитьЭлементы().Добавить();
	Иначе
		Раздел1 = ТекЭлемент;
	КонецЕсли;
	КоличествоНовыхИзменений = БюджетныйНаСервере.ПроверкаНаНовыеНовости(Ложь);
	//Если КоличествоНовыхИзменений Тогда
	//	ЗаголовокИзменений = "Изменения в 1С (" + Строка(КоличествоНовыхИзменений) + ")";
	//Иначе
		ЗаголовокИзменений = "Изменения в 1С";
	//КонецЕсли;
	Раздел1.Пункт = "Изменения в 1С";
	Раздел1.ПунктПредставление = ЗаголовокИзменений;
	Раздел1.НовоеПлюс = ?(КоличествоНовыхИзменений, "+" + Строка(КоличествоНовыхИзменений), "");		
	Раздел1.Иерархия = 1;
	
	ТекЭлемент = ЕстьЭлемент(Навигация.ПолучитьЭлементы(), "Мои подчиненные");
	Если ТекЭлемент = Неопределено Тогда
		Раздел1 = Навигация.ПолучитьЭлементы().Добавить();
	Иначе
		Раздел1 = ТекЭлемент;
	КонецЕсли;
	Раздел1.Пункт = "Мои подчиненные";
	Раздел1.ПунктПредставление = "Мои подчиненные";
	Раздел1.Иерархия = 1;
	
	ТекЭлемент = ЕстьЭлемент(Навигация.ПолучитьЭлементы(), "Мои задания");
	Если ТекЭлемент = Неопределено Тогда
		Раздел1 = Навигация.ПолучитьЭлементы().Добавить();
	Иначе
		Раздел1 = ТекЭлемент;
	КонецЕсли;
	Раздел1.Пункт = "Мои задания";
	Раздел1.ПунктПредставление = "Мои задания";
	Раздел1.Иерархия = 1;
	ИдентификаторЗаданий = Раздел1.ПолучитьИдентификатор();
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "От меня");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "От меня";
	НоваяСтрока.ПунктПредставление = "От меня";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	
	
	ТекЭлемент = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), "Мне");
	Если ТекЭлемент = Неопределено Тогда
		НоваяСтрока = Раздел1.ПолучитьЭлементы().Добавить();
	Иначе
		НоваяСтрока = ТекЭлемент;
	КонецЕсли;
	НоваяСтрока.Пункт = "Мне";
	НоваяСтрока.ПунктПредставление = "Мне";
	НоваяСтрока.Иерархия = 2;
	КоличествоСтрок = КоличествоСтрок + 1;
	
	
	Для каждого ТекСтрокаРодителя Из ТекЗаданияУр2 Цикл
		ТекРодитель = ЕстьЭлемент(Раздел1.ПолучитьЭлементы(), ТекСтрокаРодителя.Пункт);
		//Если ТекРодитель.Пункт = "Входящие" Тогда
		//	ТекРодитель.ПунктПредставление = ТекРодитель.Пункт + ?(ТекСтрокаРодителя.Колич, " (" + Строка(ТекСтрокаРодителя.КоличНовая) + "/" + Строка(ТекСтрокаРодителя.Колич) + ")", "")
		//Иначе
		ТекРодитель.ПунктПредставление = ТекРодитель.Пункт + ?(ТекСтрокаРодителя.Колич, " (" + Строка(ТекСтрокаРодителя.Колич) + ")", "");
		//КонецЕсли;
		ТекРодитель.Колич = ТекСтрокаРодителя.Колич;
		ТекРодитель.КоличНовая = ТекСтрокаРодителя.КоличНовая;
	КонецЦикла;
	
	 КоличествоНовыхНовостей = БюджетныйНаСервере.ПроверкаНаНовыеНовости();
	//Если КоличествоНовыхНовостей Тогда
	//	ЗаголовокНовостей = "Новости (" + Строка(КоличествоНовыхНовостей) + ")";
	//Иначе
		ЗаголовокНовостей = "Новости";
	//КонецЕсли;
	ТекЭлемент = ЕстьЭлемент(Навигация.ПолучитьЭлементы(), "Новости");
	Если ТекЭлемент = Неопределено Тогда
		Раздел1 = Навигация.ПолучитьЭлементы().Добавить();
	Иначе
		Раздел1 = ТекЭлемент;
	КонецЕсли;
	Раздел1.Пункт = "Новости";
	Раздел1.ПунктПредставление = ЗаголовокНовостей;
	Раздел1.НовоеПлюс = ?(КоличествоНовыхНовостей, "+" + Строка(КоличествоНовыхНовостей), "");		
	Раздел1.Иерархия = 1;
	
КонецПроцедуры

Процедура НавигацияПриАктивизацииСтрокиЧастный(Элемент, Элементы, ТекРодитель) Экспорт
	
	Если Элементы.Навигация.ТекущиеДанные.Иерархия = 3 Тогда
		ТекРодитель = Элементы.Навигация.ТекущиеДанные.ПолучитьРодителя().Пункт;
		Элементы.ТекЗадачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Пункт, ТипДокумента", ТекРодитель, Элементы.Навигация.ТекущиеДанные.Пункт));
	ИначеЕсли Элементы.Навигация.ТекущиеДанные.Иерархия = 2 Тогда
		ТекРодитель = Элементы.Навигация.ТекущиеДанные.Пункт;
		Элементы.ТекЗадачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Пункт", Элементы.Навигация.ТекущиеДанные.Пункт));
	Иначе
		//ТекРодитель = Элементы.Навигация.ТекущиеДанные.Пункт2;
		Элементы.ТекЗадачи.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Пункт2", "Входящие"));	
	КонецЕсли;
	
	
КонецПроцедуры
