
&НаКлиенте
Процедура ЗаполнитьПоОтбору(Команда)

	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("РуководительСтруктурногоПодразделения", РуководительСтруктурногоПодразделения);
	СтруктураОтбора.Вставить("СтруктурноеПодразделение", СтруктурноеПодразделение);
	СтруктураОтбора.Вставить("Сотрудники", Сотрудники.ВыгрузитьЗначения());
	СтруктураОтбора.Вставить("ДатаНач", Период.ДатаНачала);
	СтруктураОтбора.Вставить("ДатаКон", Период.ДатаОкончания);
	
	Закрыть(СтруктураОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Предприятие") Тогда
		Предприятие = Параметры.Предприятие;
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда
		Период.ДатаНачала = НачалоМесяца(Параметры.Дата);
		Период.ДатаОкончания = КонецМесяца(Параметры.Дата);
	КонецЕсли;	
	
	Если Параметры.Свойство("Кому") Тогда
		РуководительСтруктурногоПодразделения = НайтиСотрудникаПоПользователю(Параметры.Кому);
	КонецЕсли;	
	
КонецПроцедуры

Функция НайтиСотрудникаПоПользователю(ТекПользователь) 
	
	Возврат Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь", ТекПользователь);
	
КонецФункции	