
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ВидПеремещения", "ПеремещениеНаОбособленноеПодразделение");
	ТекФорма = ПолучитьФорму("Документ.УЧ_ПеремещениеТоваров.Форма.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "pn", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ТекФорма.АвтоЗаголовок = Ложь;
	ТекФорма.Заголовок = "Перемещения на обособленные подразделения";
	ТекФорма.Открыть();
	
КонецПроцедуры
