
&После("ПриЗаписи")
Процедура УУ_ПриЗаписи(Отказ)
	
	//удаляем связаные записи графика платежей
	УстановитьПривилегированныйРежим(Истина);
	Если Проведен Тогда
		
		МассивОснований = Новый Массив;
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			МассивОснований.Добавить(ДокументОснование);
			Для Каждого Стр Из РасшифровкаПлатежа Цикл
				МассивОснований.Добавить(Стр.ПлатежноеПоручение);								
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Основание Из МассивОснований Цикл
			
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручение") И ЗначениеЗаполнено(Основание.Заявка) И ТипЗнч(Основание.Заявка) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
				НаборЗаписей = РегистрыСведений.сабГрафикПлатежей.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ.Установить(Основание.Заявка);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
			ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручение") И ЗначениеЗаполнено(Основание.Заявка) И (ТипЗнч(Основание.Заявка) = Тип("ДокументСсылка.Д_ЗаявкаНаОплату") ИЛИ ТипЗнч(Основание.Заявка) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование"))
				ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование") Тогда	
				
				Если (ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручение") И ТипЗнч(Основание.Заявка) = Тип("ДокументСсылка.Д_ЗаявкаНаОплату") И Основание.Заявка.ЗаявкаБезнал.Количество() = 1) 
					ИЛИ (ТипЗнч(Основание) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование")) Тогда
					НаборЗаписей = РегистрыСведений.сабГрафикПлатежей.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(?(ТипЗнч(Основание) = Тип("ДокументСсылка.ПлатежноеПоручение"), Основание.Заявка, Основание));
					НаборЗаписей.Прочитать();
					НаборЗаписей.Очистить();
					НаборЗаписей.Записать();
				КонецЕсли;
				
				СтруктураУИД = Новый Структура;
				МассивУИД = Новый Массив;
				
				Если (ТипЗнч(Основание) = Тип("ДокументСсылка.Д_ЗаявкаНаФинансирование")) Тогда
					Если ЗначениеЗаполнено(Основание.УИН) Тогда
						МассивПП = ПолучитьПлатежныеПорученияПоУид(Основание.УИН);						
						Для каждого Стр Из МассивПП Цикл
							СтруктураУИД.Вставить("Док", Стр.Ссылка);
							СтруктураУИД.Вставить("УИД", Основание.УИН);
							МассивУИД.Добавить(СтруктураУИД);							
						КонецЦикла;
					КонецЕсли;
				Иначе
					СтруктураУИД.Вставить("Док", Основание.Заявка);
					СтруктураУИД.Вставить("УИД", Основание.УИДСтроки);
					МассивУИД.Добавить(СтруктураУИД);
				КонецЕсли;
				
				Для Каждого Стр Из МассивУИД Цикл
					
					НаборЗаписей = РегистрыСведений.сабГрафикПлатежей.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Стр.Док);
					НаборЗаписей.Прочитать();
					НомерСтрокиЗаявки = СтруктураУИД.УИД;
					МассивКУдалению = Новый Массив;
					Для каждого ТекСтрока Из НаборЗаписей Цикл
						Если ТекСтрока.УИДСтрокиДокумента = НомерСтрокиЗаявки Тогда
							МассивКУдалению.Добавить(ТекСтрока);	
						КонецЕсли;
					КонецЦикла;
					Для каждого ТекСтрокаУд Из МассивКУдалению Цикл
						НаборЗаписей.Удалить(ТекСтрокаУд);		
					КонецЦикла; 
					НаборЗаписей.Записать();
					
					Если ЗначениеЗаполнено(СтруктураУИД.УИД) Тогда
						НаборЗаписей = РегистрыСведений.сабГрафикПлатежей.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.УИДСтрокиДокумента.Установить(СтруктураУИД.УИД);
						НаборЗаписей.Прочитать();
						МассивКУдалению = Новый Массив;
						Для каждого ТекСтрока Из НаборЗаписей Цикл
							МассивКУдалению.Добавить(ТекСтрока);	
						КонецЦикла;
						Для каждого ТекСтрокаУд Из МассивКУдалению Цикл
							НаборЗаписей.Удалить(ТекСтрокаУд);		
						КонецЦикла; 
						//НаборЗаписей.Очистить();
						НаборЗаписей.Записать();
					КонецЕсли;
					
				КонецЦикла;
			Иначе //странное создание платежки на основании выписки
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПлатежноеПоручение.Ссылка КАК Ссылка,
				|	ПлатежноеПоручение.Заявка КАК Заявка
				|ИЗ
				|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
				|ГДЕ
				|	ПлатежноеПоручение.ДокументОснование = &Ссылка
				|	И ПлатежноеПоручение.СуммаДокумента = &СуммаДокумента";
				
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("СуммаДокумента", ЭтотОбъект.СуммаДокумента);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					НаборЗаписей = РегистрыСведений.сабГрафикПлатежей.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Документ.Установить(Выборка.Заявка);
					НаборЗаписей.Прочитать();
					НаборЗаписей.Очистить();
					НаборЗаписей.Записать();
				КонецЦикла;
				
			КонецЕсли;
			
			//оплачено в заявку на оплату
			БПСервер.АкцептоватьЗаявкиНаОплату(Основание, Ссылка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПлатежныеПорученияПоУид(УИН)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлатежноеПоручение.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.УИН = &УИН";
	
	Запрос.УстановитьПараметр("УИН", УИН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПлатежныхПоручений = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПлатежныхПоручений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;                                                        
	Возврат МассивПлатежныхПоручений;
	
КонецФункции 

&Перед("ПередЗаписью")
Процедура УУ_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения) 

	Если Модифицированность() Тогда
		Если ДополнительныеСвойства.Свойство("НеДобавлятьЗаписьВРегистрИзмененных") Тогда
			Если Не ДополнительныеСвойства.НеДобавлятьЗаписьВРегистрИзмененных Тогда
				сабОбщегоНазначенияБУХ.УстановитьМодифицированностьБУДокумента(ЭтотОбъект, Ссылка, РежимЗаписи);
			КонецЕсли;
		Иначе
			сабОбщегоНазначенияБУХ.УстановитьМодифицированностьБУДокумента(ЭтотОбъект, Ссылка, РежимЗаписи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура УУ_ОбработкаПроведения(Отказ, Режим)
	Если НЕ Отказ Тогда
		МассивОснований = Новый Массив;
		Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
			МассивОснований.Добавить(ДокументОснование);
			Для Каждого Стр Из РасшифровкаПлатежа Цикл
				МассивОснований.Добавить(Стр.ПлатежноеПоручение);								
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Стр Из МассивОснований Цикл
			
			Если ТипЗнч(Стр) = Тип("ДокументСсылка.ПлатежноеПоручение") И ЗначениеЗаполнено(Стр) Тогда
				
				НоваяЗапись = РегистрыСведений.СостоянияБанковскихДокументов.СоздатьМенеджерЗаписи();
				НоваяЗапись.СсылкаНаОбъект = Стр;
				НоваяЗапись.Организация = Стр.Организация;
				НоваяЗапись.Состояние = Перечисления.СостоянияБанковскихДокументов.Оплачено;
				НоваяЗапись.Записать(Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
