
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Д_ПараметрыНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаНормативы Из Нормативы Цикл
		Движение = Движения.Д_ПараметрыНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаНормативы.Номенклатура;
		Движение.СценарийПлана = Сценарий;
		Движение.Предприятие = Предприятие;
		Движение.Норматив = ТекСтрокаНормативы.Норматив;
		Движение.Значение = ТекСтрокаНормативы.Значение;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	сабОбщегоНазначенияБУХ.сабОбработкиЗаполненияУчпетныхДокументовОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
