
&После("ДобавитьКомандыПечати")
Процедура сабПечатьКД_ДобавитьКомандыПечати(КомандыПечати)
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПечатьНакладная";
	КомандаПечати.МенеджерПечати = "Документ.УЧ_Реализация";
	КомандаПечати.Представление  = НСтр("ru = 'Товарная накладная (упр)'");
	КомандаПечати.СписокФорм     = "ФормаСписка,ФормаВыбора";
	КомандаПечати.ДополнительныеПараметры.Вставить("ИдентификаторВКомплекте","ПФ_MXL_Накладная");
	КомандаПечати.ДополнительныеПараметры.Вставить("СокращенноеСообщениеОбОшибке", Ложь);
	КомандаПечати.Порядок        = 170; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПечатьТоварныйЧек";
	КомандаПечати.МенеджерПечати = "Документ.РозничнаяПродажа";
	КомандаПечати.Представление  = НСтр("ru = 'Товарный чек'");
	КомандаПечати.СписокФорм     = "ФормаСписка,ФормаВыбора";
	КомандаПечати.ДополнительныеПараметры.Вставить("ИдентификаторВКомплекте","ТоварныйЧек");
	КомандаПечати.ДополнительныеПараметры.Вставить("СокращенноеСообщениеОбОшибке", Ложь);
	КомандаПечати.Порядок        = 180;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПечатьНакладнаяНаВозврат";
	КомандаПечати.МенеджерПечати = "Документ.ВозвратТоваровОтПокупателя";
	КомандаПечати.Представление  = НСтр("ru = 'Товарная накладная на возврат'");
	КомандаПечати.СписокФорм     = "ФормаСписка,ФормаВыбора";
	КомандаПечати.ДополнительныеПараметры.Вставить("ИдентификаторВКомплекте","Накладная");
	КомандаПечати.ДополнительныеПараметры.Вставить("СокращенноеСообщениеОбОшибке", Ложь);
	КомандаПечати.Порядок        = 170; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "ПечатьНакладнаяНаВозвратУпр";
	КомандаПечати.МенеджерПечати = "Документ.УЧ_Возврат";
	КомандаПечати.Представление  = НСтр("ru = 'Товарная накладная на возврат (упр)'");
	КомандаПечати.СписокФорм     = "ФормаСписка,ФормаВыбора";
	КомандаПечати.ДополнительныеПараметры.Вставить("ИдентификаторВКомплекте","ПФ_MXL_Накладная");
	КомандаПечати.ДополнительныеПараметры.Вставить("СокращенноеСообщениеОбОшибке", Ложь);
	КомандаПечати.Порядок        = 170; 

КонецПроцедуры
