
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоДаннымБУ = Ложь;
	ПоДаннымБУПриИзмененииНаСервере(ПоДаннымБУ);
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "РегистрБухгалтерии.Хозрасчетный.Остатки", "РегистрБухгалтерии.Учетный.Остатки"); 
	СписокПоступлений.ТекстЗапроса = СтрЗаменить(СписокПоступлений.ТекстЗапроса, "РегистрБухгалтерии.Хозрасчетный.Остатки", "РегистрБухгалтерии.Учетный.Остатки");
	
	Дата = ТекущаяДата();
	Элементы.КОплатеСегодня.Заголовок = "К оплате " + ?(НачалоДня(Дата) = НачалоДня(ТекущаяДата()), "сегодня", Формат(Дата, "ДФ=dd.MM.yyyy"));
	Элементы.СписокПоступленийКОплатеСегодня.Заголовок = Элементы.КОплатеСегодня.Заголовок;
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ПоступлениеТоваровУслуг.Товары", "Д_ЗаявкаНаФинансирование.ТабличнаяЧасть"); 
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ПоступлениеТоваровУслугТовары.Номенклатура", "ПоступлениеТоваровУслугТовары.Документ");
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "УЧ_ПоступлениеТоваров.ТабличнаяЧасть", "Д_ЗаявкаНаФинансирование.ТабличнаяЧасть"); 
	
	СписокПоступлений.ТекстЗапроса = СтрЗаменить(СписокПоступлений.ТекстЗапроса, "ПоступлениеТоваровУслуг.Товары", "Д_ЗаявкаНаФинансирование.ТабличнаяЧасть"); 
	СписокПоступлений.ТекстЗапроса = СтрЗаменить(СписокПоступлений.ТекстЗапроса, "ПоступлениеТоваровУслугТовары.Номенклатура", "ПоступлениеТоваровУслугТовары.Документ");
	СписокПоступлений.ТекстЗапроса = СтрЗаменить(СписокПоступлений.ТекстЗапроса, "УЧ_ПоступлениеТоваров.ТабличнаяЧасть", "Д_ЗаявкаНаФинансирование.ТабличнаяЧасть"); 
	
	//Список.Параметры.УстановитьЗначениеПараметра("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01"));
	Счета.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05"));
	Счета.Добавить(ПланыСчетов.Учетный.НайтиПоКоду("60.01"));
	Список.Параметры.УстановитьЗначениеПараметра("Счета60", Счета);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(Дата));
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоДоговорыСоСрокамиОплаты", ТолькоДоговорыСоСрокамиОплаты);
	
	СписокПоступлений.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
	//СписокПоступлений.Параметры.УстановитьЗначениеПараметра("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокПоступлений.Параметры.УстановитьЗначениеПараметра("Счета60", Счета);
	СписокПоступлений.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(Дата));
	СписокПоступлений.Параметры.УстановитьЗначениеПараметра("ТолькоДоговорыСоСрокамиОплаты", ТолькоДоговорыСоСрокамиОплаты);
	
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		СписокПоступлений.Параметры.УстановитьЗначениеПараметра("Ссылка", Элементы.Список.ТекущаяСтрока);
	Иначе	
		СписокПоступлений.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаОплату(Команда)
	ТекФормаБП = ПолучитьФорму("Документ.Д_ЗаявкаНаФинансирование.ФормаОбъекта");
	ДанныеФормы = ТекФормаБП.Объект;
	ЗаполнитьНаСервере(ДанныеФормы, Элементы.Список.ТекущаяСтрока);
	КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
	ТекФормаБП.ПриСозданииНаСервере(Ложь, Истина);
	ЗаполнитьНаСервере(ДанныеФормы, Элементы.Список.ТекущаяСтрока);
	КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
	ТекФормаБП.СформироватьНазначениеПлатежа(Истина);
	ТекФормаБП.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ДанныеФормы, Договор)
	
	Запрос = Новый Запрос;
	Если ПоДаннымБУ Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Владелец,
		|	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
		|	ДоговорыКонтрагентов.СрокОплаты КАК СрокОплаты,
		|	-ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Просрочено,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ  + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Нормально,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КОплатеСегодня,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) КАК Заявлено,
		|	ХозрасчетныйОстатки.Субконто3 КАК Документ,
		|	ХозрасчетныйОстатки.Организация КАК Организация,
		|	ХозрасчетныйОстатки.Организация.Предприятие КАК Предприятие,
		|	ХозрасчетныйОстатки.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет В ИЕРАРХИИ (&Счета60), , ) КАК ХозрасчетныйОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|			ПО ХозрасчетныйОстатки.Субконто3 = ПоступлениеТоваровУслугТовары.Номенклатура
		|				И (НЕ ПоступлениеТоваровУслугТовары.Номенклатура.ПометкаУдаления)
		|		ПО ДоговорыКонтрагентов.Ссылка = ХозрасчетныйОстатки.Субконто2
		|ГДЕ
		|	(НЕ &ТолькоДоговорыСоСрокамиОплаты
		|			ИЛИ ДоговорыКонтрагентов.УстановленСрокОплаты = &ТолькоДоговорыСоСрокамиОплаты)
		|	И ДоговорыКонтрагентов.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ  + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ - ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) > 0";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
		               |	ДоговорыКонтрагентов.Владелец КАК Владелец,
		               |	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
		               |	ДоговорыКонтрагентов.СрокОплаты КАК СрокОплаты,
		               |	-ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
		               |	ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Просрочено,
		               |	ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Нормально,
		               |	ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		               |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК КОплатеСегодня,
		               |	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) КАК Заявлено,
		               |	ХозрасчетныйОстатки.Субконто3 КАК Документ,
		               |	ХозрасчетныйОстатки.Предприятия КАК Предприятие,
		               |	ХозрасчетныйОстатки.Подразделение КАК Подразделение
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Учетный.Остатки(, Счет В ИЕРАРХИИ (&Счета60), , ) КАК ХозрасчетныйОстатки
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УЧ_ПоступлениеТоваров.ТабличнаяЧасть КАК ПоступлениеТоваровУслугТовары
		               |			ПО ХозрасчетныйОстатки.Субконто3 = ПоступлениеТоваровУслугТовары.Номенклатура
		               |				И (НЕ ПоступлениеТоваровУслугТовары.Номенклатура.ПометкаУдаления)
		               |		ПО ДоговорыКонтрагентов.Ссылка = ХозрасчетныйОстатки.Субконто2
		               |ГДЕ
		               |	(НЕ &ТолькоДоговорыСоСрокамиОплаты
		               |			ИЛИ ДоговорыКонтрагентов.УстановленСрокОплаты = &ТолькоДоговорыСоСрокамиОплаты)
		               |	И ДоговорыКонтрагентов.Ссылка = &Ссылка
		               |	И ВЫБОР
		               |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		               |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |			ИНАЧЕ 0
		               |		КОНЕЦ + ВЫБОР
		               |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		               |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |			ИНАЧЕ 0
		               |		КОНЕЦ + ВЫБОР
		               |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		               |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		               |			ИНАЧЕ 0
		               |		КОНЕЦ - ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) > 0";
		
	КонецЕсли;
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПоступлениеТоваровУслуг.Товары", "Д_ЗаявкаНаФинансирование.ТабличнаяЧасть"); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "УЧ_ПоступлениеТоваров.ТабличнаяЧасть", "Д_ЗаявкаНаФинансирование.ТабличнаяЧасть"); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПоступлениеТоваровУслугТовары.Номенклатура", "ПоступлениеТоваровУслугТовары.Документ");
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	//Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("60.01"));
	Счета.Добавить(ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.05"));
	Счета.Добавить(ПланыСчетов.Учетный.НайтиПоКоду("60.01"));
	
	Запрос.УстановитьПараметр("Счета60", Счета);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ТолькоДоговорыСоСрокамиОплаты", ТолькоДоговорыСоСрокамиОплаты);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	ДанныеФормы.СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Оплата поставщикам (подрядчикам)", Истина);
	
	ДанныеФормы.ТабличнаяЧасть.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеФормы, Выборка);
		ДанныеФормы.БанковскийСчет = ДанныеФормы.Организация.ОсновнойБанковскийСчет;
		НоваяСтрока = ДанныеФормы.ТабличнаяЧасть.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.СтатьяДДС = ДанныеФормы.СтатьяДДС;
		НоваяСтрока.УИДСтроки = Новый УникальныйИдентификатор;
		//НоваяСтрока.Сумма = Выборка.СуммаОстаток;
		ДанныеФормы.Контрагент = Выборка.Договор.Владелец;
		ДанныеФормы.Договор = Выборка.Договор;
		ДанныеФормы.СчетКонтрагента = Выборка.Договор.Владелец.ОсновнойБанковскийСчет;
		
		Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			Для каждого ТекСтрока Из Выборка.Документ.Товары Цикл
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ТекСтрока.СуммаНДС;
				НоваяСтрока.СтавкаНДС = ?(НоваяСтрока.СуммаНДС, сабОбщегоНазначенияБУХПовтИсп.СоотвСтавокНДСБУХУУ().Получить(ТекСтрока.СтавкаНДС), Справочники.СтавкиНДС.НАйтиПоНаименованию("Без НДС", Истина));
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + ?(Выборка.Документ.СуммаВключаетНДС, ТекСтрока.Сумма, ТекСтрока.Сумма + ТекСтрока.СуммаНДС);
			КонецЦикла;
		ИначеЕсли ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") Тогда
			НоваяСтрока.Сумма = Выборка.КОплатеСегодня;
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НАйтиПоНаименованию("Без НДС", Истина);
		ИначеЕсли ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.ПоступлениеИзПереработки") Тогда
			Для каждого ТекСтрока Из Выборка.Документ.Услуги Цикл
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ТекСтрока.СуммаНДС;
				НоваяСтрока.СтавкаНДС = ?(НоваяСтрока.СуммаНДС, сабОбщегоНазначенияБУХПовтИсп.СоотвСтавокНДСБУХУУ().Получить(ТекСтрока.СтавкаНДС), Справочники.СтавкиНДС.НАйтиПоНаименованию("Без НДС", Истина));
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + ?(Выборка.Документ.СуммаВключаетНДС, ТекСтрока.Сумма, ТекСтрока.Сумма + ТекСтрока.СуммаНДС);
			КонецЦикла;
		ИначеЕсли ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.УЧ_ПоступлениеТоваров") Тогда
			Для каждого ТекСтрока Из Выборка.Документ.ТабличнаяЧасть Цикл
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ТекСтрока.СуммаНДС;
				НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + ?(Выборка.Документ.СуммаВключаетНДС, ТекСтрока.Сумма, ТекСтрока.Сумма + ТекСтрока.СуммаНДС);
			КонецЦикла;
			Для каждого ТекСтрока Из Выборка.Документ.Услуги Цикл
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ТекСтрока.СуммаНДС;
				НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + ?(Выборка.Документ.СуммаВключаетНДС, ТекСтрока.Сумма, ТекСтрока.Сумма + ТекСтрока.СуммаНДС);
			КонецЦикла;
		ИначеЕсли ТипЗнч(Выборка.Документ) = Тип("СправочникСсылка.сабСтрокиГрафиковДоговоров") Тогда
			//Для каждого ТекСтрока Из Выборка.Документ.ТабличнаяЧасть Цикл
				//НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ТекСтрока.СуммаНДС;
				//НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
				//НоваяСтрока.Сумма = НоваяСтрока.Сумма + ?(Выборка.Документ.СуммаВключаетНДС, ТекСтрока.Сумма, ТекСтрока.Сумма + ТекСтрока.СуммаНДС);
				НоваяСтрока.Сумма = Выборка.КОплатеСегодня ;
			//КонецЦикла;
			//Для каждого ТекСтрока Из Выборка.Документ.Услуги Цикл
			//	НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ТекСтрока.СуммаНДС;
			//	НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			//	НоваяСтрока.Сумма = НоваяСтрока.Сумма + ?(Выборка.Документ.СуммаВключаетНДС, ТекСтрока.Сумма, ТекСтрока.Сумма + ТекСтрока.СуммаНДС);
			//КонецЦикла;
		ИначеЕсли ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.УЧ_ВыпускПродукции") Тогда
			Для каждого ТекСтрока Из Выборка.Документ.Услуги Цикл
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ТекСтрока.СуммаНДС;
				НоваяСтрока.СтавкаНДС = ?(НоваяСтрока.СуммаНДС, сабОбщегоНазначенияБУХПовтИсп.СоотвСтавокНДСБУХУУ().Получить(ТекСтрока.СтавкаНДС), Справочники.СтавкиНДС.НАйтиПоНаименованию("Без НДС", Истина));
				НоваяСтрока.Сумма = НоваяСтрока.Сумма + ?(Выборка.Документ.СуммаВключаетНДС, ТекСтрока.Сумма, ТекСтрока.Сумма + ТекСтрока.СуммаНДС);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	//ДанныеФормы.Предприятие = ДанныеФормы.Организация.Предприятие;
	ДанныеФормы.ЦФО = ДанныеФормы.Предприятие;
	ДанныеФормы.Сумма = ДанныеФормы.ТабличнаяЧасть.Итог("Сумма");
	ДанныеФормы.СуммаНДС = ДанныеФормы.ТабличнаяЧасть.Итог("СуммаНДС");
	Если ДанныеФормы.ТабличнаяЧасть.Количество() Тогда
		ДанныеФормы.СтавкаНДС = ?(НоваяСтрока.СуммаНДС, НоваяСтрока.СтавкаНДС, Справочники.СтавкиНДС.НАйтиПоНаименованию("Без НДС", Истина));
	Иначе	
		ДанныеФормы.СтавкаНДС = Справочники.СтавкиНДС.НАйтиПоНаименованию("Без НДС", Истина);
	КонецЕсли;
	ДанныеФормы.РасшифровкаПлатежа = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоги()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ИтогоОстаток = Результат.Итог("СуммаОстаток");
	ИтогоПросрочено = Результат.Итог("Просрочено");
	ИтогоНормально = Результат.Итог("Нормально");
	ИтогоКОплате = Результат.Итог("КОплатеСегодня");
	ИтогоКОплатеЗавтра = Результат.Итог("КОплатеЗавтра");
	ИтогоКОплатеПослезавтра = Результат.Итог("КОплатеПослезавтра");
	ИтогоЗаявлено = Результат.Итог("Заявлено");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "сабОбноватьПлатежныйКалендарь" Тогда
		Элементы.Список.Обновить();
		Элементы.СписокПоступлений.Обновить();
		ОбновитьИтоги();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Список.Отбор.Элементы.Очистить();
	Если ЗначениеЗаполнено(Контрагент) Тогда
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйОтбор.ПравоеЗначение = Контрагент;
	Иначе
		
		//Для каждого ТекОтбор Из Список.Отбор.Элементы Цикл
		//	Если ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		//		Если Строка(ТекОтбор.ЛевоеЗначение) = "Владелец" Тогда
		//			ТекОтбор.Использование = Ложь;				
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;		
	КонецЕсли;
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Элементы.КОплатеСегодня.Заголовок = "К оплате " + ?(НачалоДня(Дата) = НачалоДня(ТекущаяДата()), "сегодня", Формат(Дата, "ДФ=dd.MM.yyyy"));
	Элементы.СписокПоступленийКОплатеСегодня.Заголовок = Элементы.КОплатеСегодня.Заголовок;
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(Дата));
	СписокПоступлений.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", НачалоДня(Дата));
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
	Элементы.СписокПоступлений.Обновить();
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДоговорыСоСрокамиОплатыПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоДоговорыСоСрокамиОплаты", ТолькоДоговорыСоСрокамиОплаты);
	СписокПоступлений.Параметры.УстановитьЗначениеПараметра("ТолькоДоговорыСоСрокамиОплаты", ТолькоДоговорыСоСрокамиОплаты);
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура СписокПоступленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.СписокПоступлений.ДанныеСтроки(Элементы.СписокПоступлений.ТекущаяСтрока);
	ПоказатьЗначение(, ТекДанные.Документ);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПоДаннымБУПриИзменении(Элемент)
	ПоДаннымБУПриИзмененииНаСервере(ПоДаннымБУ);
КонецПроцедуры

&НаСервере
Процедура ПоДаннымБУПриИзмененииНаСервере(ПоДаннымБУ)
	
	Если ПоДаннымБУ Тогда
		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Владелец,
		|	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
		|	ДоговорыКонтрагентов.СрокОплаты КАК СрокОплаты,
		|	СУММА(-ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Просрочено,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Нормально,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КОплатеСегодня,
		|	СУММА(ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0)) КАК Заявлено,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КОплатеЗавтра,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КОплатеПослезавтра
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет В ИЕРАРХИИ (&Счета60), , ) КАК ХозрасчетныйОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|			ПО ХозрасчетныйОстатки.Субконто3 = ПоступлениеТоваровУслугТовары.Номенклатура
		|				И (НЕ ПоступлениеТоваровУслугТовары.Номенклатура.ПометкаУдаления)
		|		ПО ДоговорыКонтрагентов.Ссылка = ХозрасчетныйОстатки.Субконто2
		|ГДЕ
		|	(НЕ &ТолькоДоговорыСоСрокамиОплаты
		|			ИЛИ ДоговорыКонтрагентов.УстановленСрокОплаты = &ТолькоДоговорыСоСрокамиОплаты)
		|	И -ХозрасчетныйОстатки.СуммаОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.Ссылка,
		|	ДоговорыКонтрагентов.Владелец,
		|	ДоговорыКонтрагентов.СрокДействия,
		|	ДоговорыКонтрагентов.СрокОплаты"; 
		СписокПоступлений.ТекстЗапроса = "ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Владелец,
		|	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
		|	ДоговорыКонтрагентов.СрокОплаты КАК СрокОплаты,
		|	-ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Просрочено,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Нормально,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КОплатеСегодня,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) КАК Заявлено,
		|	ХозрасчетныйОстатки.Субконто3 КАК Документ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КОплатеЗавтра,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		|			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КОплатеПослезавтра,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.ПоступлениеТоваровУслуг)
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Дата
		|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.ПоступлениеИзПереработки)
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Дата
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК Дата,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.ПоступлениеТоваровУслуг)
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеТоваровУслуг).Комментарий
		|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ДокументРасчетовСКонтрагентом).Комментарий
		|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.ПоступлениеИзПереработки)
		|			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.ПоступлениеИзПереработки).Комментарий
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Комментарий
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет В ИЕРАРХИИ (&Счета60), , ) КАК ХозрасчетныйОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|			ПО ХозрасчетныйОстатки.Субконто3 = ПоступлениеТоваровУслугТовары.Номенклатура
		|				И (НЕ ПоступлениеТоваровУслугТовары.Номенклатура.ПометкаУдаления)
		|		ПО ДоговорыКонтрагентов.Ссылка = ХозрасчетныйОстатки.Субконто2
		|ГДЕ
		|	(НЕ &ТолькоДоговорыСоСрокамиОплаты
		|			ИЛИ ДоговорыКонтрагентов.УстановленСрокОплаты = &ТолькоДоговорыСоСрокамиОплаты)
		|	И ДоговорыКонтрагентов.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	Иначе
		Список.ТекстЗапроса = "ВЫБРАТЬ
		                      |	ДоговорыКонтрагентов.Ссылка КАК Договор,
		                      |	ДоговорыКонтрагентов.Владелец КАК Владелец,
		                      |	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
		                      |	ДоговорыКонтрагентов.СрокОплаты КАК СрокОплаты,
		                      |	СУММА(-ХозрасчетныйОстатки.СуммаОстаток) КАК СуммаОстаток,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ) КАК Просрочено,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ) КАК Нормально,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ) КАК КОплатеСегодня,
		                      |	СУММА(ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0)) КАК Заявлено,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ) КАК КОплатеЗавтра,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ + ВЫБОР
		                      |			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		                      |				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                      |			ИНАЧЕ 0
		                      |		КОНЕЦ) КАК КОплатеПослезавтра
		                      |ИЗ
		                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Учетный.Остатки(, Счет В ИЕРАРХИИ (&Счета60), , ) КАК ХозрасчетныйОстатки
		                      |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УЧ_ПоступлениеТоваров.ТабличнаяЧасть КАК ПоступлениеТоваровУслугТовары
		                      |			ПО ХозрасчетныйОстатки.Субконто3 = ПоступлениеТоваровУслугТовары.Номенклатура
		                      |				И (НЕ ПоступлениеТоваровУслугТовары.Номенклатура.ПометкаУдаления)
		                      |		ПО ДоговорыКонтрагентов.Ссылка = ХозрасчетныйОстатки.Субконто2
		                      |ГДЕ
		                      |	(НЕ &ТолькоДоговорыСоСрокамиОплаты
		                      |			ИЛИ ДоговорыКонтрагентов.УстановленСрокОплаты = &ТолькоДоговорыСоСрокамиОплаты)
		                      |	И -ХозрасчетныйОстатки.СуммаОстаток > 0
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ДоговорыКонтрагентов.Ссылка,
		                      |	ДоговорыКонтрагентов.Владелец,
		                      |	ДоговорыКонтрагентов.СрокДействия,
		                      |	ДоговорыКонтрагентов.СрокОплаты"; 
		СписокПоступлений.ТекстЗапроса = "ВЫБРАТЬ
		                                 |	ДоговорыКонтрагентов.Ссылка КАК Договор,
		                                 |	ДоговорыКонтрагентов.Владелец КАК Владелец,
		                                 |	ДоговорыКонтрагентов.СрокДействия КАК СрокДействия,
		                                 |	ДоговорыКонтрагентов.СрокОплаты КАК СрокОплаты,
		                                 |	-ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
		                                 |	ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) < &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ КАК Просрочено,
		                                 |	ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) >= &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ КАК Нормально,
		                                 |	ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) <= &ТекущаяДата
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ КАК КОплатеСегодня,
		                                 |	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Сумма, 0) КАК Заявлено,
		                                 |	ХозрасчетныйОстатки.Субконто3 КАК Документ,
		                                 |	ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 1)
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ КАК КОплатеЗавтра,
		                                 |	ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ + ВЫБОР
		                                 |		КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата, ДЕНЬ, ДоговорыКонтрагентов.СрокОплаты), ДЕНЬ) = ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, 2)
		                                 |			ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
		                                 |		ИНАЧЕ 0
		                                 |	КОНЕЦ КАК КОплатеПослезавтра,
		                                 |	ВЫБОР
		                                 |		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.УЧ_ПоступлениеТоваров)
		                                 |			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Дата
		                                 |		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.УЧ_ВыпускПродукции)
		                                 |			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Дата
		                                 |		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Справочник.сабСтрокиГрафиковДоговоров)
		                                 |			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.сабСтрокиГрафиковДоговоров).Дата
		                                 |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		                                 |	КОНЕЦ КАК Дата,
		                                 |	ВЫБОР
		                                 |		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.УЧ_ПоступлениеТоваров)
		                                 |			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ПоступлениеТоваров).Комментарий
		                                 |		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстатки.Субконто3) = ТИП(Документ.УЧ_ВыпускПродукции)
		                                 |			ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Документ.УЧ_ВыпускПродукции).Комментарий
		                                 |		ИНАЧЕ """"
		                                 |	КОНЕЦ КАК Комментарий
		                                 |ИЗ
		                                 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		                                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Учетный.Остатки(, Счет В ИЕРАРХИИ (&Счета60), , ) КАК ХозрасчетныйОстатки
		                                 |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.УЧ_ПоступлениеТоваров.ТабличнаяЧасть КАК ПоступлениеТоваровУслугТовары
		                                 |			ПО ХозрасчетныйОстатки.Субконто3 = ПоступлениеТоваровУслугТовары.Номенклатура
		                                 |				И (НЕ ПоступлениеТоваровУслугТовары.Номенклатура.ПометкаУдаления)
		                                 |		ПО ДоговорыКонтрагентов.Ссылка = ХозрасчетныйОстатки.Субконто2
		                                 |ГДЕ
		                                 |	(НЕ &ТолькоДоговорыСоСрокамиОплаты
		                                 |			ИЛИ ДоговорыКонтрагентов.УстановленСрокОплаты = &ТолькоДоговорыСоСрокамиОплаты)
		                                 |	И ДоговорыКонтрагентов.Ссылка = &Ссылка
		                                 |
		                                 |УПОРЯДОЧИТЬ ПО
		                                 |	Дата";
	КонецЕсли;
	
КонецПроцедуры

