
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
	Форма = ПолучитьФорму("Документ.УЧ_ДвижениеДС.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийДвиженияДС.БанковскаяВыписка");
	Форма.Объект.Субконто2 = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ПустаяСсылка");	
	Форма.Открыть();
КонецПроцедуры
