
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПП = БюджетныйНаСервере.ПолучитьПредприятия();
	
	РеквизитыПользователя = БюджетныйНаСервере.ВернутьРеквизиты(ПараметрыСеанса.ТекущийПользователь, "ДоступныПредприятияИзСписка, ОграничениеПодразделений, ВидимостьПоСогласованию");  
	
	//Добавим Пользователю БОБ возможность видеть заявки пользователя КСА
	МассивПользователей = БПСервер.ПолучитьМассивПользователей();
	//Если МассивПользователей.Найти(Справочники.Пользователи.НайтиПоНаименованию("БОБ")) <> неопределено Тогда 
	//	МассивПользователей.Добавить(Справочники.Пользователи.НайтиПоНаименованию("КСА"));
	//КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", МассивПользователей);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеПредприятия", НЕ РеквизитыПользователя.ДоступныПредприятияИзСписка);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПредприятия", ТекПП);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеЗаявки", Ложь);
	
	//Список.Параметры.УстановитьЗначениеПараметра("ВсеПодразделения", НЕ РеквизитыПользователя.ОграничениеПодразделений);
	//Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПодразделения", БюджетныйНаСервере.ПолучитьПодразделения(ТекПП));
	//Список.Параметры.УстановитьЗначениеПараметра("ДопСтатьи", ?(ПараметрыСеанса.ТекущийПользователь.ДоступныеСтатьи.Количество(), Истина, Ложь));
	//Список.Параметры.УстановитьЗначениеПараметра("ДоступныеСтатьиСырья", ПараметрыСеанса.ТекущийПользователь.ДоступныеСтатьи.ВыгрузитьКолонку("СтатьяДДС"));
	
	//Если РеквизитыПользователя.ВидимостьПоСогласованию И НЕ Параметры.Свойство("ТекПлатежка") Тогда
		//Элементы.Группа2.Видимость = Ложь;
		ФильтроватьСерверСогласованиеАвтор();
	//Иначе
	//	Если Параметры.Свойство("ТекПлатежка") Тогда
	//		ТекПлатежка = Параметры.ТекПлатежка;
	//		//Элементы.Группа2.Видимость = Ложь;
	//	Иначе
	//		ТекПлатежка = Неопределено ;
	//	КонецЕсли;
	//	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Истина);
	//	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Истина);
	//	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Истина);
	//	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Истина);
	//	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Истина);
	//	Фильтр = "Нет фильтра";
	//КонецЕсли;                       
КонецПроцедуры

&НаСервере
Процедура ФильтроватьСерверСогласованиеАвтор()
	
	Список.Параметры.УстановитьЗначениеПараметра("Согласовано", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("ПринадлежностьПредприятию", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Оплачено", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Авторство", Истина);
	Список.Параметры.УстановитьЗначениеПараметра("Исполнено", Истина);
КонецПроцедуры

