
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныеПредприятия", ПараметрыСеанса.ДоступныеПредприятия);
	БюджетныйНаСервере.ДействияПриСозданииФормыДокумента(ЭтаФорма);
	
	ВидимостьПредприятия = БюджетныйНаСервере.ПолучитьПредприятия().Количество() > 1;
	//ОформитьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВШедекс(Команда)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("Обработка.ВыгрузкаВШедекс.Форма.Форма", ПараметрыФормы, , , , );
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ОформитьСтроки()

	СписокМЛ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабМаршрутныйЛист.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.сабМаршрутныйЛист КАК сабМаршрутныйЛист
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.сабМаршрутныйЛист.ТабличнаяЧасть КАК сабМаршрутныйЛистТабличнаяЧасть
	               |		ПО сабМаршрутныйЛистТабличнаяЧасть.ЗаказКлиента = сабМаршрутныйЛист.Ссылка
	               |ГДЕ
	               |	сабМаршрутныйЛист.ПометкаУдаления = ЛОЖЬ
	               |	И сабМаршрутныйЛист.КроссДокинг = ИСТИНА
	               |	И сабМаршрутныйЛистТабличнаяЧасть.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать(); //Запрос.Выполнить().Выгрузить()
	
	Пока Выборка.Следующий() цикл
		СписокМЛ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();

	ЭлементУсловия = ЭлементУО.Отбор.Элементы. Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ЭлементУсловия.ПравоеЗначение = СписокМЛ;
    
	//ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВсеПоля");
	//Оформляемоеполе.Использование = ИСТИНА;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(152, 255, 174));
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусСогласовано(Команда)
	ВыдСтроки = Элементы.Список.ВыделенныеСтроки;
	СтатусСогласованоНаСервере(ВыдСтроки, Команда.Имя);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СтатусСогласованоНаСервере(Заявки, ИмяКоманды)
	
	Если ИмяКоманды = "СтатусВРаботе" Тогда
		Точка = Перечисления.СтатусыМаршрутныхЛистов.ВРаботе;
	ИначеЕсли ИмяКоманды = "СтатусВыполнен" Тогда
		Точка = Перечисления.СтатусыМаршрутныхЛистов.Выполнен;
	Иначе
		Точка = Перечисления.СтатусыМаршрутныхЛистов.Новый;
	КонецЕсли;
	
	Для каждого ТекЗаявка Из Заявки Цикл
		Об = ТекЗаявка.ПолучитьОбъект();
		Об.Статус = Точка;
		Если Об.Проведен Тогда
			Об.Записать(РежимЗаписиДокумента.Проведение);
		Иначе	
			Об.Записать();
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не Элементы.Список.РежимВыбора Тогда
		Если Поле.Имя = "Выполнен" Тогда
			СтандартнаяОбработка = Ложь;
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.ЗагрузитьЗначения(ПолучитьСписокСтатусовЗаказа());
			ТекЗнач = Неопределено;
			
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СписокВыборЗавершение", ЭтаФорма), СписокЗначений, , СписокЗначений.НайтиПоЗначению(Элементы.Список.ТекущиеДанные.Статус));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	ТекЗнач = ВыбранныйЭлемент;
	Если Не ТекЗнач = Неопределено Тогда
		ЗаписатьНовыйСтатусЗаказа(Элементы.Список.ТекущаяСтрока, ТекЗнач.Значение);
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНовыйСтатусЗаказа(Документ, НовыйСтатусЗаказа)
	ТекБанкОб = Документ.ПолучитьОбъект();
	ТекБанкОб.Статус = НовыйСтатусЗаказа;
	Если ТекБанкОб.Проведен Тогда
		ТекБанкОб.Записать(РежимЗаписиДокумента.Проведение);
	Иначе	
		ТекБанкОб.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСтатусовЗаказа()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыМаршрутныхЛистов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Перечисление.СтатусыМаршрутныхЛистов КАК СтатусыМаршрутныхЛистов";
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции // ()


