
&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении(Элемент)
	Если РазрешитьРедактирование Тогда
		Предупреждение("Внимание! Все согласования по документу будут аннулированы!");	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстВопроса = Параметры.ТекстВопроса;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("Результат, РазрешитьРедактирование", Истина, РазрешитьРедактирование));
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
