
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Фильтр", Параметры.Свойство("ДокОснование"));
	Список.Параметры.УстановитьЗначениеПараметра("ДокОснование", ?(Параметры.Свойство("ДокОснование"), Параметры.ДокОснование, Неопределено));
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("ДокументСсылка.Д_КорректировкаДокумента") Тогда
		Печать(Элементы.Список.ТекущаяСтрока);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура Печать(ТеКорр)
	Документы.Д_КорректировкаДокумента.Печать(ТабДок, ТеКорр);
КонецПроцедуры

