
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если НЕ БюджетныйНаСервере.РольДоступнаСервер("Администратор") И НЕ БюджетныйНаСервере.РольДоступнаСервер("БюджетныйОтдел") Тогда
		Если Вопрос("Бюджет находится в процессе утверждения или уже утвержден. Отмена утверждения для доработки возможна только по согласованию с отделом бюджетирования.
			|Отправить запрос о доработке бюджета?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да   Тогда
			ПричинаОтмены = "";
			Если ВвестиСтроку(ПричинаОтмены, "Причина отправки на доработку:") Тогда
				ОтправитьПросьбу(ПараметрКоманды, ПричинаОтмены);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если НЕ БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "ПометкаУдаления") Тогда
			
			ТекСтруктура = ОткрытьФормуМодально("Справочник.УтверждениеБюджета.Форма.ФормаВозвратаНаДоработку");
			Если НЕ ТекСтруктура = Неопределено Тогда
				ИзменитьЗадачу(ПараметрКоманды, ТекСтруктура);
				РазослатьОповещения(ПараметрКоманды, ТекСтруктура.ПричинаОтмены);
				ОповеститьОбИзменении(ПараметрКоманды);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗадачу(ТекБп, ТекСтруктура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Задача.Ссылка,
	               |	Задача.Исполнитель
	               |ИЗ
	               |	Справочник.Задача КАК Задача
	               |ГДЕ
	               |	Задача.БизнесПроцесс = &БизнесПроцесс
	               |	И Задача.Выполнена = ЛОЖЬ
	               |	И Задача.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ТекБп);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Комментарий = "Пользователь " + Строка(ПараметрыСеанса.ТекущийПользователь) + " вернул объект на доработку. По причине: " + ТекСтруктура.ПричинаОтмены;
	//меняем маршрут
	ТекБПОбъект = ТекБп.ПолучитьОбъект();
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура("СубъектСогласования", Выборка.Исполнитель);
		ОтобранныеСтроки = ТекБПОбъект.ДопСогласование.НайтиСтроки(СтруктураОтбора);
		Для Каждого ТекСтрока Из ОтобранныеСтроки Цикл
			ТекСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			ТекСтрока.Согласовано = Ложь;
			ТекСтрока.Пройден = Истина;
		КонецЦикла;
	КонецЦикла;
	
	//выполняем задачу 
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗадачаОбъект.Выполнена = Истина;
		ЗадачаОбъект.РезультатВыполнения = "";
		ЗадачаОбъект.Комментарии = Комментарий;
		ЗадачаОбъект.Записать();
	КонецЦикла;
	
	
	ТекБПОбъект.Завершен = Ложь;
	Задача = Справочники.Задача.СоздатьЭлемент();		
	Задача.Заявка = ТекБПОбъект.Заявка;
	Задача.Дата = ТекущаяДата();
	Задача.Предприятие = ТекБПОбъект.Предприятие;
	Задача.Наименование = "Доработать бюджет " + Строка(ТекБПОбъект.ТипБюджета);
	Задача.БизнесПроцесс  = ТекБПОбъект.Ссылка;
	Задача.ТочкаМаршрута  = Перечисления.УтверждениеБюджетаТочкиМаршрута.Действие1;
	Задача.Автор = ПараметрыСеанса.ТекущийПользователь;
	Задача.Описание = Комментарий;
	Исполнитель = Неопределено;
	Если ТекСтруктура.АдресВозврата = "Автору" Тогда
		Исполнитель = ТекБПОбъект.Автор;
	ИначеЕсли ТекСтруктура.АдресВозврата = "Себе" Тогда
		Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Исполнитель = ТекСтруктура.Пользователь;
	КонецЕсли;
	Задача.Исполнитель = Исполнитель;
	Задача.Записать();
	
	Если ТекСтруктура.ОснованиеЗаблокирован Тогда
		ТекБПОбъект.ОснованиеЗаблокирован = Ложь;
		Для каждого ТекСТрокаСогл Из ТекБПОбъект.ДопСогласование Цикл
			ТекСТрокаСогл.Согласовано = Ложь;
			ТекСТрокаСогл.Пройден = Ложь;
		КонецЦикла; 
	КонецЕсли;
	ТекБПОбъект.Записать();
	
		
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеЗаявку(БП)
	БП.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
	
	Заявка = БП.Заявка.ПолучитьОбъект();
	ИменаСтроки = Новый Массив;
	Если БП.ТипБюджета = Перечисления.Д_ТипыБюджетов.БюджетЗатратСтарый Тогда
		ИменаСтроки.Добавить("ОбъемПроизводства");
		ИменаСтроки.Добавить("БюджетСебестоимости");
		ИменаСтроки.Добавить("ЗатратыНаПРостой2");
		ИменаСтроки.Добавить("Затраты");
		ИменаСтроки.Добавить("ПР");
	КонецЕсли;
	
	Если БП.ТипБюджета = Перечисления.Д_ТипыБюджетов.БюджетЗакупок Тогда
		ИменаСтроки.Добавить("ДвижениеСырья");
	КонецЕсли;
	
	Если БП.ТипБюджета = Перечисления.Д_ТипыБюджетов.БюджетИнвестиций Тогда
		ИменаСтроки.Добавить("Инвестиции");
	КонецЕсли;
	
	Если БП.ТипБюджета = Перечисления.Д_ТипыБюджетов.БюджетПродаж Тогда
		ИменаСтроки.Добавить("БюджетПродаж");
	КонецЕсли;
	
	Если БП.ТипБюджета = Перечисления.Д_ТипыБюджетов.КорректировкиБюджета Тогда
		ИменаСтроки.Добавить("ЗатратыКП");
	КонецЕсли;
	
	Если БП.ТипБюджета = Перечисления.Д_ТипыБюджетов.БюджетПроизводства Тогда
		ИменаСтроки.Добавить("ОбъемПроизводства");
	КонецЕсли;
	
	
	Если БП.ТипБюджета = Перечисления.Д_ТипыБюджетов.БюджетЗатрат Тогда
		ИменаСтроки.Добавить("БюджетСебестоимости");
		ИменаСтроки.Добавить("ЗатратыНаПРостой2");
		ИменаСтроки.Добавить("Затраты");
		ИменаСтроки.Добавить("ПР");
	КонецЕсли;
	
	
	Для каждого ТекИмя Из ИменаСтроки Цикл
		ВыбранныеСтроки = Заявка.ДоступностьТЧ.НайтиСтроки(Новый Структура("ИмяТЧ", ТекИмя));
		Для каждого ТекСтрока Из ВыбранныеСтроки Цикл
			Заявка.ДоступностьТЧ.Удалить(ТекСтрока);					
		КонецЦикла; 
	КонецЦикла; 
	
	Заявка.Записать();
	
КонецПроцедуры

&НаСервере
Процедура РазослатьОповещения(ПараметрКоманды, ПричинаОтмены)
	
	МассивОповещаний = Новый Массив;
	
	
	Для каждого ТекСтрокаДоп Из ПараметрКоманды.ДопСогласование Цикл
		Если НЕ ПустаяСтрока(ТекСтрокаДоп.СубъектСогласования) И МассивОповещаний.Найти(ТекСтрокаДоп.СубъектСогласования) = Неопределено И ТекСтрокаДоп.Согласовано = Истина Тогда
			МассивОповещаний.Добавить(ТекСтрокаДоп.СубъектСогласования);		
		КонецЕсли;	
	КонецЦикла;
	МассивОповещаний.Добавить(ПараметрКоманды.Автор);
	
	НачатьТранзакцию();
	Для каждого Пользователь Из МассивОповещаний Цикл
		
		БПСервер.СоздатьОповещение(Пользователь, "Пользователь " + Строка(ПараметрыСеанса.ТекущийПользователь) 
		+ " отменил утверждение " + Строка(ПараметрКоманды.ТипБюджета) + " (" + Строка(ПараметрКоманды.Заявка.Предприятие)  + "). 
		|Причина: " + ПричинаОтмены + ".", "Оповещение: отменено утверждение " + Строка(ПараметрКоманды.ТипБюджета) + " (" + Строка(ПараметрКоманды.Заявка.Предприятие) + ")", ПараметрКоманды.Заявка, Истина);	
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПросьбу(ПараметрКоманды, ПричинаОтмены)
	
	МассивОповещаний = Новый Массив;
	
	
	//Если НЕ ПустаяСтрока(СотрудникБО()) Тогда //нужно исправить!!!
	//	МассивОповещаний.Добавить(СотрудникБО());
	//КонецЕсли;
	
	НачатьТранзакцию();
	Для каждого Пользователь Из МассивОповещаний Цикл
		
		БПСервер.СоздатьОповещение(Пользователь, "Пользователь " + Строка(ПараметрыСеанса.ТекущийПользователь) 
		+ " просит отменить утверждение " + Строка(ПараметрКоманды.ТипБюджета) + " (" + Строка(ПараметрКоманды.Заявка.Предприятие)  + "). 
		|Причина: " + ПричинаОтмены + ".", "Оповещение: запрос на отмену утверждения " + Строка(ПараметрКоманды.ТипБюджета) + " (" + Строка(ПараметрКоманды.Заявка.Предприятие) + ")", ПараметрКоманды.Заявка, Истина);	
		
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
