
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Типы.Очистить();
	ВсеПометка = Ложь;
	Для каждого ТекТип Из Параметры.СписокТиповДокументов Цикл
		НоваяСтрока = Типы.Добавить();
		НоваяСтрока.ТипДокумента = ТекТип.Значение;
		Если ТипЗнч(ТекТип.Значение) = Тип("СправочникСсылка.Д_ВидыВнутреннихДокументов") Тогда
			НоваяСтрока.ИмяДокумента = ТекТип.Значение.ИмяДокумента;	
		КонецЕсли;
		ТекЗнач = Параметры.Фильтр2.НайтиПоЗначению(ТекТип.Значение);
		НоваяСтрока.Блокирован = ВсеПометка;
		Если НЕ ТекЗнач = Неопределено Тогда
			НоваяСтрока.Пометка = Истина;
			Если ТекТип.Значение = "Все" Тогда
				ВсеПометка = Истина;			
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИЗакрыть(Команда)
	
	ОтобранныеСтроки = Типы.НайтиСтроки(Новый Структура("Пометка", Истина));
	МассивСтрок = Новый Массив;
	МассивИмен = Новый Массив;
	Для каждого ТекСтрока Из ОтобранныеСтроки Цикл
		МассивСтрок.Добавить(ТекСтрока.ТипДокумента);
		МассивИмен.Добавить(ТекСтрока.ИмяДокумента);
	КонецЦикла; 
	
	Оповестить("ПередатьФильтр2", Новый Структура("Фильтр2, ФильтрИмена", МассивСтрок, МассивИмен));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТипыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элементы.Типы.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Если ТекДанные.ТипДокумента = "Все" Тогда
			Если ТекДанные.Пометка Тогда
				СкопироватьТЧ();
			Иначе
				Если ТипыИстория.Количество() Тогда
					ВосстановитьТЧ();
				КонецЕсли;
			КонецЕсли;
			Для каждого ТекСтрока Из Типы Цикл
				Если ТекСтрока.ТипДокумента = "Все" Тогда
					Продолжить;				
				КонецЕсли;
				ТекСтрока.Блокирован = ТекДанные.Пометка;
				Если ТекДанные.Пометка Тогда
					ТекСтрока.Пометка = Ложь;				
				КонецЕсли;
			КонецЦикла;		
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СкопироватьТЧ()
	ТипыИстория.Загрузить(Типы.Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ВосстановитьТЧ()
	Типы.Загрузить(ТипыИстория.Выгрузить());
	Типы[0].Пометка = Ложь;
КонецПроцедуры

