
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);

	ТекФормаБП = ПолучитьФорму("Документ.СчетНаОплатуПокупателю.ФормаОбъекта");
	
	ДанныеФормы = ТекФормаБП.Объект;
	ЗаполнитьНаСервере(ДанныеФормы, ПараметрКоманды);
	КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
	
	СтруктураНадписи = Новый Структура(
		"ВалютаДокумента, Курс, Кратность, СуммаВключаетНДС, ДокументБезНДС, ВалютаРегламентированногоУчета",
		ДанныеФормы.ВалютаДокумента,
		ДанныеФормы.КурсВзаиморасчетов,
		ДанныеФормы.КратностьВзаиморасчетов,
		ДанныеФормы.СуммаВключаетНДС,
		ДанныеФормы.ДокументБезНДС,
		ТекФормаБП.ВалютаРегламентированногоУчета);
	Если ТекФормаБП.ИспользоватьТипыЦенНоменклатуры Тогда
		СтруктураНадписи.Вставить("ТипЦен", ДанныеФормы.ТипЦен);
	КонецЕсли;
	ТекФормаБП.ЦеныИВалюта = ОбщегоНазначенияБПКлиентСервер.СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	ТекФормаБП.ОбновитьОтображениеДанных();
	ТекФормаБП.Открыть();
	
КонецПроцедуры

Процедура ЗаполнитьНаСервере(ТекОбъект, ТекОснование)

	Если ТипЗнч(ТекОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ЗаполнитьЗначенияСвойств(ТекОбъект, ТекОснование,,"Дата, Номер, ВозвратнаяТара");
		//ТекОбъект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Товары;
		ТекОбъект.Заказ = ТекОснование;
		ТекОбъект.СуммаВключаетНДС = Истина;
		ТекОбъект.ДокументБезНДС = Ложь;
		ТекОбъект.ДоговорКонтрагента = ТекОснование.Договор;
		ТекОбъект.ТипЦен = ТекОбъект.ДоговорКонтрагента.ТипЦен;
		ТекОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;//Заполнение ответственного текущим пользователем
		Для каждого ТекСтрока Из ТекОснование.ТабличнаяЧасть Цикл
			НоваяСтрока = ТекОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.СтавкаНДС = сабОбщегоНазначенияБУХПовтИсп.СоотвСтавокНДСУУБУХ().Получить(ТекСтрока.СтавкаНДС);
		КонецЦикла;
		
		//НовОбъект = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
		//ЗаполнитьЗначенияСвойств(НовОбъект, ТекОснование,,"Дата, Номер, ВозвратнаяТара");
		////НовОбъект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Товары;
		//НовОбъект.Заказ = ТекОснование;
		//НовОбъект.СуммаВключаетНДС = Истина;
		//НовОбъект.ДокументБезНДС = Ложь;
		//Для каждого ТекСтрока Из ТекОснование.ТабличнаяЧасть Цикл
		//	НоваяСтрока = НовОбъект.Товары.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		//	НоваяСтрока.СтавкаНДС = сабОбщегоНазначенияБУХПовтИсп.СоотвСтавокНДСУУБУХ().Получить(ТекСтрока.СтавкаНДС);
		//КонецЦикла;
		//
		//ЗаполнениеДокументов.Заполнить(НовОбъект, ТекОснование, Истина);
		//
		//ТекОбъект.Товары.Очистить();
		//Для каждого ТекСтрока Из НовОбъект.Товары Цикл
		//	НоваяСтрока = ТекОбъект.Товары.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		//КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
