
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);

	ТекФормаБП = ПолучитьФорму("Документ.СчетНаОплатуПокупателю.ФормаОбъекта", ПараметрыФормы);
	
	ДанныеФормы = ТекФормаБП.Объект;
	//ЗаполнитьНаСервере(ДанныеФормы, ПараметрКоманды); Белых убал, т.к. в модуле объекта логика заполнения
	КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
	
	СтруктураНадписи = Новый Структура(
		"ВалютаДокумента, Курс, Кратность, СуммаВключаетНДС, ДокументБезНДС, ВалютаРегламентированногоУчета",
		ДанныеФормы.ВалютаДокумента,
		ДанныеФормы.КурсВзаиморасчетов,
		ДанныеФормы.КратностьВзаиморасчетов,
		ДанныеФормы.СуммаВключаетНДС,
		ДанныеФормы.ДокументБезНДС,
		ТекФормаБП.ВалютаРегламентированногоУчета);
	Если ТекФормаБП.ИспользоватьТипыЦенНоменклатуры Тогда
		СтруктураНадписи.Вставить("ТипЦен", ДанныеФормы.ТипЦен);
	КонецЕсли;
	ТекФормаБП.ЦеныИВалюта = ОбщегоНазначенияБПКлиентСервер.СформироватьНадписьЦеныИВалюта(СтруктураНадписи);
	ТекФормаБП.ОбновитьОтображениеДанных();
	ТекФормаБП.Открыть();
	
КонецПроцедуры
