
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель КАК ТипПредприятия,
	               |	БюджетныйОборотыДтКт1.Предприятия КАК Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период) КАК Период,
	               |	СУММА(-ЕСТЬNULL(БюджетныйОборотыДтКт1.СуммаОборот, 0)) КАК СуммаНачало,
	               |	0 КАК Сумма_90_91,
	               |	0 КАК СуммаФонд,
	               |	0 КАК Сумма_7510_7502,
	               |	0 КАК СуммаПереводФР,
	               |	0 КАК Сумма_7502_7510
	               |ПОМЕСТИТЬ ВТ_Данные
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В (&Счет75_2Сц1), , СчетКт В ИЕРАРХИИ (&Счет99Сц1), , СценарийПлана = &Сценарий1) КАК БюджетныйОборотыДтКт1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОбороты1.Предприятия.Родитель,
	               |	БюджетныйОбороты1.Предприятия,
	               |	Квартал(БюджетныйОбороты1.Период),
	               |	0,
	               |	СУММА(ВЫБОР
	               |			КОГДА БюджетныйОбороты1.Счет = &Счет91Сц1
	               |					И БюджетныйОбороты1.Субконто1 = &ПереводФР
	               |				ТОГДА 0
	               |			ИНАЧЕ -ЕСТЬNULL(БюджетныйОбороты1.СуммаОборот, 0)
	               |		КОНЕЦ),
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.Обороты(&Дата1, &Дата2, Квартал, Счет В ИЕРАРХИИ (&Счета_90_91Сц1), , СценарийПлана = &Сценарий1, НЕ КорСчет В ИЕРАРХИИ (&Счет99Сц1), ) КАК БюджетныйОбороты1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОбороты1.Предприятия.Родитель,
	               |	БюджетныйОбороты1.Предприятия,
	               |	Квартал(БюджетныйОбороты1.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период),
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт1.СуммаОборот, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В ИЕРАРХИИ (&Счет99Сц1), , СчетКт В (&Счет75_2Сц1), , СценарийПлана = &Сценарий1) КАК БюджетныйОборотыДтКт1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период),
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт1.СуммаОборот, 0)),
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В ИЕРАРХИИ (&Счета99_75_2Сц1), , СчетКт В (&Счет75_10Сц1), , СценарийПлана = &Сценарий1) КАК БюджетныйОборотыДтКт1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	Квартал(БюджетныйОборотыДтКт1.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт1.СуммаОборот, 0)),
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В (&Счет75_10Сц1), , СчетКт В (&Счет75_2Сц1), , СценарийПлана = &Сценарий1) КАК БюджетныйОборотыДтКт1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(-ЕСТЬNULL(БюджетныйОборотыДтКт1.СуммаОборот, 0)),
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(
	               |			&Дата1,
	               |			&Дата2,
	               |			Квартал,
	               |			СчетДт В (&Счет91Сц1),
	               |			,
	               |			СчетКт В ИЕРАРХИИ (&Счета79_76_6Сц1),
	               |			,
	               |			СценарийПлана = &Сценарий1
	               |				И СубконтоДт1 = &ПереводФР) КАК БюджетныйОборотыДтКт1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт1.СуммаОборот, 0)),
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(
	               |			&Дата1,
	               |			&Дата2,
	               |			Квартал,
	               |			СчетДт В ИЕРАРХИИ (&Счета79_76_6Сц1),
	               |			,
	               |			СчетКт В (&Счет91Сц1),
	               |			,
	               |			СценарийПлана = &Сценарий1
	               |				И СубконтоКт1 = &ПереводФР) КАК БюджетныйОборотыДтКт1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт1.СуммаОборот, 0))
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В ИЕРАРХИИ (&Счет75_2Сц1), , СчетКт В (&Счет75_10Сц1), , СценарийПлана = &Сценарий1) КАК БюджетныйОборотыДтКт1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт1.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт1.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт1.Период)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель КАК ТипПредприятия,
	               |	БюджетныйОборотыДтКт2.Предприятия КАК Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период) КАК Период,
	               |	СУММА(-ЕСТЬNULL(БюджетныйОборотыДтКт2.СуммаОборот, 0)) КАК СуммаНачало1,
	               |	0 КАК Сумма_90_911,
	               |	0 КАК СуммаФонд1,
	               |	0 КАК Сумма_7510_75021,
	               |	0 КАК СуммаПереводФР1,
	               |	0 КАК Сумма_7502_75101
	               |ПОМЕСТИТЬ ВТ_Данные1
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В (&Счет75_2Сц2), , СчетКт В ИЕРАРХИИ (&Счет99Сц2), , СценарийПлана = &Сценарий2) КАК БюджетныйОборотыДтКт2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОбороты2.Предприятия.Родитель,
	               |	БюджетныйОбороты2.Предприятия,
	               |	Квартал(БюджетныйОбороты2.Период),
	               |	0,
	               |	СУММА(ВЫБОР
	               |			КОГДА БюджетныйОбороты2.Счет = &Счет91Сц2
	               |					И БюджетныйОбороты2.Субконто1 = &ПереводФР
	               |				ТОГДА 0
	               |			ИНАЧЕ -ЕСТЬNULL(БюджетныйОбороты2.СуммаОборот, 0)
	               |		КОНЕЦ),
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.Обороты(&Дата1, &Дата2, Квартал, Счет В ИЕРАРХИИ (&Счета_90_91Сц2), , СценарийПлана = &Сценарий2, НЕ КорСчет В ИЕРАРХИИ (&Счет99Сц2), ) КАК БюджетныйОбороты2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОбороты2.Предприятия.Родитель,
	               |	БюджетныйОбороты2.Предприятия,
	               |	Квартал(БюджетныйОбороты2.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период),
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт2.СуммаОборот, 0)),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В ИЕРАРХИИ (&Счет99Сц2), , СчетКт В (&Счет75_2Сц2), , СценарийПлана = &Сценарий2) КАК БюджетныйОборотыДтКт2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период),
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт2.СуммаОборот, 0)),
	               |	0,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В ИЕРАРХИИ (&Счета99_75_2Сц2), , СчетКт В (&Счет75_10Сц2), , СценарийПлана = &Сценарий2) КАК БюджетныйОборотыДтКт2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт2.СуммаОборот, 0)),
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В (&Счет75_10Сц2), , СчетКт В (&Счет75_2Сц2), , СценарийПлана = &Сценарий2) КАК БюджетныйОборотыДтКт2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(-ЕСТЬNULL(БюджетныйОборотыДтКт2.СуммаОборот, 0)),
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(
	               |			&Дата1,
	               |			&Дата2,
	               |			Квартал,
	               |			СчетДт В (&Счет91Сц2),
	               |			,
	               |			СчетКт В ИЕРАРХИИ (&Счета79_76_6Сц2),
	               |			,
	               |			СценарийПлана = &Сценарий2
	               |				И СубконтоДт1 = &ПереводФР) КАК БюджетныйОборотыДтКт2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт2.СуммаОборот, 0)),
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(
	               |			&Дата1,
	               |			&Дата2,
	               |			Квартал,
	               |			СчетДт В ИЕРАРХИИ (&Счета79_76_6Сц2),
	               |			,
	               |			СчетКт В (&Счет91Сц2),
	               |			,
	               |			СценарийПлана = &Сценарий2
	               |				И СубконтоКт1 = &ПереводФР) КАК БюджетныйОборотыДтКт2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	СУММА(ЕСТЬNULL(БюджетныйОборотыДтКт2.СуммаОборот, 0))
	               |ИЗ
	               |	РегистрБухгалтерии.Бюджетный.ОборотыДтКт(&Дата1, &Дата2, Квартал, СчетДт В ИЕРАРХИИ (&Счет75_2Сц2), , СчетКт В (&Счет75_10Сц2), , СценарийПлана = &Сценарий2) КАК БюджетныйОборотыДтКт2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	БюджетныйОборотыДтКт2.Предприятия.Родитель,
	               |	БюджетныйОборотыДтКт2.Предприятия,
	               |	Квартал(БюджетныйОборотыДтКт2.Период)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Данные.СуммаНачало,
	               |	ВТ_Данные.Сумма_90_91,
	               |	ВТ_Данные.СуммаФонд,
	               |	ВТ_Данные.Сумма_7510_7502,
	               |	ВТ_Данные.СуммаПереводФР,
	               |	ВТ_Данные.Сумма_7502_7510,
	               |	ВТ_Данные.ТипПредприятия КАК ТипПредприятия,
	               |	ВТ_Данные.Предприятия КАК Предприятия,
	               |	ВТ_Данные.Период КАК Период,
	               |	0 КАК СуммаНачало1,
	               |	0 КАК Сумма_90_911,
	               |	0 КАК СуммаФонд1,
	               |	0 КАК Сумма_7510_75021,
	               |	0 КАК СуммаПереводФР1,
	               |	0 КАК Сумма_7502_75101
	               |ПОМЕСТИТЬ ВТ_ДанныеОбщ
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВТ_Данные1.ТипПредприятия,
	               |	ВТ_Данные1.Предприятия,
	               |	ВТ_Данные1.Период,
	               |	ВТ_Данные1.СуммаНачало1,
	               |	ВТ_Данные1.Сумма_90_911,
	               |	ВТ_Данные1.СуммаФонд1,
	               |	ВТ_Данные1.Сумма_7510_75021,
	               |	ВТ_Данные1.СуммаПереводФР1,
	               |	ВТ_Данные1.Сумма_7502_75101
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Данные1 КАК ВТ_Данные1
	               |		ПО ВТ_Данные.ТипПредприятия = ВТ_Данные1.ТипПредприятия
	               |			И ВТ_Данные.Предприятия = ВТ_Данные1.Предприятия
	               |			И ВТ_Данные.Период = ВТ_Данные1.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеОбщ.Предприятия,
				   |    ВТ_ДанныеОбщ.Предприятия.ОсновнаяВалютаУчета КАК ПредприятияОсновнаяВалютаУчета,
	               |	ВТ_ДанныеОбщ.ТипПредприятия,
	               |	ВТ_ДанныеОбщ.Период,
	               |	ВТ_ДанныеОбщ.Сумма_7502_7510 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК Сумма_7502_7510,
	               |	ВТ_ДанныеОбщ.СуммаПереводФР * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК СуммаПереводФР,
	               |	ВТ_ДанныеОбщ.Сумма_7510_7502 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК Сумма_7510_7502,
	               |	ВТ_ДанныеОбщ.СуммаФонд * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК СуммаФонд,
	               |	ВТ_ДанныеОбщ.Сумма_90_91 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК Сумма_90_91,
	               |	ВТ_ДанныеОбщ.СуммаНачало * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК СуммаНачало,
	               |	ВТ_ДанныеОбщ.Сумма_7502_75101 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК Сумма_7502_75101,
	               |	ВТ_ДанныеОбщ.СуммаПереводФР1 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК СуммаПереводФР1,
	               |	ВТ_ДанныеОбщ.Сумма_7510_75021 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК Сумма_7510_75021,
	               |	ВТ_ДанныеОбщ.СуммаФонд1 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК СуммаФонд1,
	               |	ВТ_ДанныеОбщ.Сумма_90_911 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК Сумма_90_911,
	               |	ВТ_ДанныеОбщ.СуммаНачало1 * ЕСТЬNULL(КроссКурсыВалютСрезПоследних.Курс, 1) КАК СуммаНачало1
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, Валюта = &ЭквивалентнаяВалюта) КАК КурсЭквивалентнойВалюты,
	               |	ВТ_ДанныеОбщ КАК ВТ_ДанныеОбщ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСрезПоследних
	               |		ПО ВТ_ДанныеОбщ.Предприятия.ОсновнаяВалютаУчета = КурсыВалютСрезПоследних.Валюта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КроссКурсыВалют.СрезПоследних(&ДатаКурса, Валюта2 = &ЭквивалентнаяВалюта) КАК КроссКурсыВалютСрезПоследних
	               |		ПО ВТ_ДанныеОбщ.Предприятия.ОсновнаяВалютаУчета = КроссКурсыВалютСрезПоследних.Валюта1
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ДанныеОбщ.ТипПредприятия
	               |АВТОУПОРЯДОЧИВАНИЕ";

КонецПроцедуры
