
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	БП = БПСервер.ПоискБП("СогласованиеОбщее", ПараметрКоманды);
	Если НЕ БП = Неопределено Тогда
		Если БюджетныйНаСервере.ВернутьРеквизит(БП, "Стартован") Тогда
			Предупреждение("Бизнес-процесс согласования уже запущен.");
			Возврат;	
		Иначе
			ОткрытьФорму(БПСервер.ПолучитьПолноеИмяФормы(БП), Новый Структура("Ключ", БП));
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
	
	
	////если докоснование - заявка на отгрузку не далее стадии согласования
	//ТекОснование = БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "ДокОснование");
	//БПОснования = БПСервер.ПоискБП("СогласованиеОбщее", ТекОснование);
	//Если ТипЗнч(ТекОснование) = Тип("ДокументСсылка.Д_ЗаявкаНаОтгрузку") Тогда
	//	Если НЕ (БПСервер.СравнитьСтадию("Действие3", ТекОснование) ИЛИ БПСервер.СравнитьСтадию("Действие5", ТекОснование) ИЛИ БюджетныйНаСервере.ВернутьРеквизит(БПОснования, "Завершен")) Тогда
	//		Если Вопрос("Корректировка вносится до согласования заявки всеми рецезентами. Все согласования по заявке будут аннулированы. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	//			СоздатьИЗавершитьБизнесПРоцесс(ПараметрКоманды, БПОснования);
	//			Оповестить("Пересчитать", , ПараметрыВыполненияКоманды.Источник);
	//			ОповеститьОбИзменении(ПараметрКоманды);
	//		КонецЕсли;
	//		Возврат;
	//	КонецЕсли
	//КонецЕсли;
	
	
	Если Вопрос("После старта процесса согласования изменения в документе станут невозможны. Уверены что хотите стартовать бизнес процесс?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ТекФормаБП = ПолучитьФорму("БизнесПроцесс.СогласованиеОбщее.Форма.ФормаНовый");
		ТекФормаБП.Объект.Автор = БюджетныйНаСервере.ПолучитьПользователя();
		ТекФормаБП.Объект.Описание = БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "Комментарий");
		ТекФормаБП.Объект.Заявка = ПараметрКоманды;
		ТекФормаБП.Объект.ОснованиеЗаблокирован = Истина;
		ТекФормаБП.ВладелецФормы = ПараметрыВыполненияКоманды.Источник;
		//частные случаи, автозаполнение маршрута
		
		//заполняем маршрут корректировки заявки на закупку
		Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Д_КорректировкаДокумента") Тогда
			ДанныеФормы = ТекФормаБП.Объект;
			ЗаполнитьНаСервере(ДанныеФормы, ПараметрКоманды);
			КопироватьДанныеФормы(ДанныеФормы, ТекФормаБП.Объект);
		КонецЕсли;
		
		ТекФормаБП.Открыть();
		
		
		//ПоказатьОповещениеПользователя("Запущен бизнес процесс согласования:",
		//,
		//ПараметрКоманды,
		//БиблиотекаКартинок.БизнесПроцесс);
		//ОповеститьОбИзменении(ПараметрКоманды);
	КонецЕсли;

КонецПроцедуры


Процедура СоздатьИЗавершитьБизнесПРоцесс(ПараметрКоманды, БПОснования)
	НовыйБП = БизнесПроцессы.СогласованиеОбщее.СоздатьБизнесПроцесс();
	НовыйБП.Автор = БюджетныйНаСервере.ПолучитьПользователя();
	НовыйБП.Описание = БюджетныйНаСервере.ВернутьРеквизит(ПараметрКоманды, "Комментарий") + " (не требует согласований)";
	НовыйБП.Заявка = ПараметрКоманды;
	НовыйБП.ОснованиеЗаблокирован = Истина;
	НовыйБП.Стартован = Истина;	
	НовыйБП.Завершен = Истина;
	НовыйБП.ДатаНачала = ТекущаяДата();
	НовыйБП.ДатаЗавершения = ТекущаяДата();
	НовыйБП.ОснованиеЗаблокирован = Истина;
	НовыйБП.Дата = ТекущаяДата();
	НовыйБП.Записать();
	
	ЗаявкаОб = ПараметрКоманды.ПолучитьОбъект();
	ЗаявкаОб.Записать(РежимЗаписиДокумента.Проведение);
	
	ОбнулитьСогласованияДокОснования(БПОснования);
	
КонецПроцедуры

Процедура ОбнулитьСогласованияДокОснования(БПОснования)
	БПОснованияОб = БПОснования.ПолучитьОбъект();
	Для каждого ТекСтрока Из БПОснованияОб.ДопСогласование Цикл
		ТекСтрока.Пройден = Ложь;
		ТекСтрока.Согласовано = Ложь;
	КонецЦикла; 
    БПОснованияОб.Записать();
КонецПроцедуры

Процедура ЗаполнитьНаСервере(ТекОбъект, ТекОснование)
	//Если ТипЗнч(ТекОснование.ДокОснование) = Тип("ДокументСсылка.Д_ЗаявкаНаЗакупкуСырья") Тогда
	//	
	//	ТекЗаявкаНаЗакупку = ТекОснование.ДокОснование;
	//	ТекОбъект.ДопСогласование.Загрузить(ТекЗаявкаНаЗакупку.ДопСогласование.Выгрузить());
	//	Если ЗначениеЗаполнено(ТекЗаявкаНаЗакупку.РуководительСлужбы) Тогда
	//		НоваяСтрока = ТекОбъект.ДопСогласование.Добавить();
	//		НоваяСтрока.СубъектСогласования = ТекЗаявкаНаЗакупку.РуководительСлужбы;
	//	КонецЕсли;
	//	ТекОбъект.ДопОповещение.Загрузить(ТекЗаявкаНаЗакупку.Адресаты.Выгрузить());
	//	ТекОбъект.ДопРассылка.Загрузить(ТекЗаявкаНаЗакупку.ДопСписокРеспондентов.Выгрузить());
	//	
	//Иначе
		
		Если ТипЗнч(ТекОснование.ДокОснование) = Тип("ДокументСсылка.Д_ЗаявкаНаОтгрузку") Тогда
			ТекБП_Осн = БПСервер.НайтиТекущийБПСервер(ТекОснование.ДокОснование);
		Иначе
			ТекБП_Осн = БПСервер.НайтиТекущийБПСервер(ТекОснование.ДокОснование.ДокОснование);	
		КонецЕсли;	
		ТекБП = БПСервер.НайтиТекущийБПСервер(ТекОснование.ДокОснование);
		Если НЕ ТекБП_Осн = Неопределено Тогда
			
			Для каждого ТекСтрока Из ТекБП_Осн.ДопСогласование Цикл
				НоваяСтрока = ТекОбъект.ДопСогласование.Добавить();
				НоваяСтрока.СубъектСогласования = ТекСтрока.СубъектСогласования;		
				НоваяСтрока.РольПользователя = ТекСтрока.РольПользователя;
			КонецЦикла;
			Если НЕ ТекБП = Неопределено Тогда
				//Для каждого ТекСтрока Из ТекБП.ДопИсполнение Цикл
				//	НоваяСтрока = ТекОбъект.ДопИсполнение.Добавить();
				//	НоваяСтрока.Исполнитель = ТекСтрока.Исполнитель;		
				//	НоваяСтрока.РольПользователя = ТекСтрока.РольПользователя;
				//КонецЦикла;
				ТекОбъект.ДопОповещение.Загрузить(ТекБП.ДопОповещение.Выгрузить());
				ТекОбъект.ДопРассылка.Загрузить(ТекБП.ДопРассылка.Выгрузить());
			КонецЕсли;
			
			
		КонецЕсли;
	//КонецЕсли;
КонецПроцедуры


