&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//БюджетныйНаКлиенте.УниверсальноеВыполнениеКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды);
	Если Не типЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		МассивСсылка = Новый Массив;
		МассивСсылка.Добавить(ПараметрКоманды);
	Иначе
		МассивСсылка = ПараметрКоманды;	
	КонецЕсли;  
	Если ТипЗнч(ПараметрыВыполненияКоманды) = Тип("Строка") Тогда
		ИмяКоманды = ПараметрыВыполненияКоманды;
	Иначе
		ИмяКоманды = Прав(ПараметрыВыполненияКоманды.НавигационнаяСсылка,СтрДлина(ПараметрыВыполненияКоманды.НавигационнаяСсылка) - 14); 
	КонецЕсли;
	
	КлючУникальности = "" + МассивСсылка[0].УникальныйИдентификатор() + "___" + ИмяКоманды;
	ТабДок = Новый ТабличныйДокумент; 
	ЗаполнитьТабДок(ТабДок,ПараметрКоманды);
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.АвтоМасштаб = Истина;
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечатиДокумента",,,КлючУникальности);
	ФормаПечати.Результат = ТабДок;
	ФормаПечати.Заголовок = Строка(?(МассивСсылка.Количество() > 1, ТипЗнч(МассивСсылка[0]), МассивСсылка[0]));
	ФормаПечати.Открыть();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТабДок(ТабДок,ПараметрКоманды)
	
	Документы.УЧ_Инвентаризация.Печать(ТабДок, ПараметрКоманды, Истина);
	
КонецПроцедуры