
&После("ПриСозданииНаСервереДокумент")
Процедура УУ_ПриСозданииНаСервереДокумент(Форма, Параметры)
	Если Параметры.Свойство("ДокументУУ") Тогда
		ДобавляемыеРеквизиты	= Новый Массив;
		
		Массив = Новый Массив;
		Массив.Добавить(ТипЗнч(Параметры.ДокументУУ));
		ОписаниеТиповС = Новый ОписаниеТипов(Массив);
		
		Реквизит_ДокументУУ = Новый РеквизитФормы("ДокументУУ",	ОписаниеТиповС,	, "Документ УУ");
		ДобавляемыеРеквизиты.Добавить(Реквизит_ДокументУУ);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		Форма.ДокументУУ = Параметры.ДокументУУ; 
		
	КонецЕсли;
КонецПроцедуры
