&НаСервере
Функция ПровестиДокумент(ПараметрКоманды)
	
	ДокументОбъект = ПараметрКоманды.ПолучитьОбъект();
	Попытка
		Если НЕ ДокументОбъект.ПроверитьЗаполнение() Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

&НаСервере
Функция ПолучитьПараметрыДокумента(Ссылка)
	
	МетаданныеДокумента	= Ссылка.Метаданные();
	
	ЕстьРучнаяКорректировка	= сабОбщегоНазначения.ЕстьРеквизитИлиОбщийРеквизитДокумента("РучнаяКорректировка", МетаданныеДокумента);
	
	ИменаРеквизитов	= "Проведен, ПометкаУдаления";
	Если ЕстьРучнаяКорректировка Тогда
		ИменаРеквизитов	= ИменаРеквизитов + ", РучнаяКорректировка";
	КонецЕсли;
	
	Результат	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	Если НЕ ЕстьРучнаяКорректировка Тогда
		Результат.Вставить("РучнаяКорректировка", Ложь);
	КонецЕсли;
	
	//вставляем предприятие
	Попытка
		Предприятие = Ссылка.Предприятие;
	Исключение
		Предприятие = Неопределено;
	КонецПопытки;
	
	Результат.Вставить("Предприятие",	Предприятие);
	Результат.Вставить("РегОперация",	Ложь);
	Результат.Вставить("ОперацияБух",	Ложь);
	Результат.Вставить("ЕстьРучнаяКорректировка", ЕстьРучнаяКорректировка);
	Результат.Вставить("ПравоДоступа", ПравоДоступа("Использование", Метаданные.Обработки.КорректировкаДвижений));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыДокумента = ПолучитьПараметрыДокумента(ПараметрКоманды);
	
	//проверка на просмотр зарплатных типов документов
	Если НЕ ПроверитьДоступностьЗарплатныхДанных(ПараметрыДокумента, ПараметрКоманды) Тогда
		Сообщить("Нет прав на просмотр проводок зарплатного документа.");
		Возврат;
	КонецЕсли;
	
	ВозможностьКорректировки = ПараметрыДокумента.ПравоДоступа
		И ПараметрыДокумента.ЕстьРучнаяКорректировка; //предусмотрена возможность ручной корректировки
			
		Если НЕ ПараметрыДокумента.ПометкаУдаления И НЕ ПараметрыДокумента.ОперацияБух И
			НЕ ПараметрыДокумента.РегОперация И НЕ ПараметрыДокумента.РучнаяКорректировка И
			НЕ ПараметрыДокумента.Проведен Тогда
			
			Кнопки = Новый СписокЗначений;
			Кнопки.Вставить(0, КодВозвратаДиалога.Да, "Провести");
			Кнопки.Вставить(1, КодВозвратаДиалога.Нет, "Отмена");
			Ответ = Вопрос(НСтр("ru = 'Перед просмотром проводок документ следует провести'"), Кнопки,, КодВозвратаДиалога.Да);
			Если Ответ <> КодВозвратаДиалога.Да Тогда
				Возврат;
			Иначе
				ДокументПроведен = ПровестиДокумент(ПараметрКоманды);
				Если ДокументПроведен Тогда
					ОповеститьОбИзменении(ПараметрКоманды);
					Оповестить("ВыполненаЗаписьДокумента",Новый Структура("ДокументСсылка", ПараметрКоманды));
				Иначе
					Сообщить(НСтр("ru = 'Не удалось провести документ'"), СтатусСообщения.Важное);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ДокументСсылка", ПараметрКоманды);
		ТекФорма = ПолучитьФорму("Обработка.саб_КорректировкаДвижений.Форма", 
			ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрКоманды);
		ТекФорма.Элементы.РучнаяКорректировка.Доступность = ВозможностьКорректировки;
		ТекФорма.Открыть();
			
	//иначе    //не предусмотрена ручная корректировка
	//		
	//	Парам = Новый Структура("Регистратор",ПараметрКоманды);
	//	ОткрытьФорму("РегистрБухгалтерии.Учетный.Форма.ФормаПроводок",Парам,, ПараметрКоманды);
		
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДоступностьЗарплатныхДанных(ПараметрыДокумента, ПараметрКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.УЧ_НачислениеЗП") ИЛИ ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.УЧ_ВыплатаЗП") Тогда
		Возврат БюджетныйНаСервере.ПроверкаДоступностиЗП(ПараметрыДокумента.Предприятие);
	КонецЕсли;
	Возврат Истина;
КонецФункции



