
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("", );
	ТекФорма = ПолучитьФорму("Документ.УЧ_ПоступлениеТоваров.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "РеализацииОС", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	НовыйОтбор = ТекФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации");
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализация.ОсновныеСредства");
	
	//ТекФорма.ВидОперацийДвиженияДС = НовыйОтбор.ПравоеЗначение;
	
	ТекФорма.Заголовок = "Основные средства";
	
	ТекФорма.Открыть();
КонецПроцедуры
