
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЕСТЬ23 = Ложь;
	
	Счет20 = ПланыСчетов.Учетный.НайтиПоКоду("20");
	Счет23 = ПланыСчетов.Учетный.НайтиПоКоду("23");
	Счет25 = ПланыСчетов.Учетный.НайтиПоКоду("25");
	
	Если Счет23 <> ПланыСчетов.Учетный.ПустаяСсылка() и Счет23 <> Неопределено И Счет23 <> NULL тогда
		ЕСТЬ23 = Истина;	
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
    
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕСТЬ23", ЕСТЬ23);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Счет20", Счет20);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Счет23", Счет23);
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Счет25", Счет25);
	
    КомпоновщикНастроек.ЗагрузитьНастройки(Настройки); 
	
КонецПроцедуры
