
&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
	
	//Синхронизация серий
	Если сабОбщегоНазначенияПовтИсп.ПолучитьСерийныйУчет() Тогда 
		Если Не ЭтоНовый() Тогда 
			сабОперОбщегоНазначения.СинхронизацияНомераСтрокиОсновнойТЧССериямиБух(Товары,Ссылка.Товары,СерииНоменклатуры,ЭтотОбъект);
		КонецЕсли;
		
		сабОперОбщегоНазначения.ПерезаполнитьТЧСерииНоменклатурыПередЗаписью(Товары,СерииНоменклатуры,Истина);
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура УУ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		Если ЭтотОбъект.Метаданные().ТабличныеЧасти.Найти("СерииНоменклатуры") <> Неопределено И ДанныеЗаполнения.Метаданные().ТабличныеЧасти.Найти("СерииНоменклатуры") <> Неопределено Тогда
			
			Для Каждого ТекСтрокаСерии Из ДанныеЗаполнения.СерииНоменклатуры Цикл
				НоваяСтрокаСерии = ЭтотОбъект.СерииНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСерии, ТекСтрокаСерии);
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УЧ_ВозвратТоваровПоставщику") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Номер, Проведен");
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровПоставщику.ПокупкаКомиссия;
		ЭтотОбъект.СуммаВключаетНДС = Истина;
		ЭтотОбъект.ДокументБезНДС = Ложь;
		ЭтотОбъект.ДоговорКонтрагента = ДанныеЗаполнения.Договор;
		ЭтотОбъект.ТипЦен = ЭтотОбъект.ДоговорКонтрагента.ТипЦен;
		ЭтотОбъект.ВалютаДокумента = ДанныеЗаполнения.Валюта;
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ВалютаДокумента) Тогда
			ЭтотОбъект.ВалютаДокумента = УЧ_Сервер.НациональнаяВалюта();		
		КонецЕсли;
		//ОбособПодразделение = ДанныеЗаполнения.ПодразделениеКонтрагента.ОбособленноеПодразделение;
		//Если ЗначениеЗаполнено(ОбособПодразделение) Тогда
		//	ЭтотОбъект.Грузополучатель = ОбособПодразделение;
		//КонецЕсли;
		Для каждого ТекСтрока Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.СтавкаНДС = сабОбщегоНазначенияБУХПовтИсп.СоотвСтавокНДСУУБУХ().Получить(ТекСтрока.СтавкаНДС);
			Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
				Если ЗначениеЗаполнено(ТекСтрока.Склад) Тогда
					ЭтотОбъект.Склад = ТекСтрока.Склад;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		НовОбъект = Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовОбъект, ДанныеЗаполнения,,"Дата, Номер");
		НовОбъект.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.Товары;
		НовОбъект.СуммаВключаетНДС = Истина;
		НовОбъект.ДокументБезНДС = Ложь;
		Для каждого ТекСтрока Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = НовОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.СтавкаНДС = сабОбщегоНазначенияБУХПовтИсп.СоотвСтавокНДСУУБУХ().Получить(ТекСтрока.СтавкаНДС);
			Если Не ЗначениеЗаполнено(НовОбъект.Склад) Тогда
				Если ЗначениеЗаполнено(ТекСтрока.Склад) Тогда
					НовОбъект.Склад = ТекСтрока.Склад;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЗаполнениеДокументов.Заполнить(НовОбъект, ДанныеЗаполнения, Истина);
		
		ЭтотОбъект.Товары.Очистить();
		
		МассивНоменклатуры = Новый Массив;
		
		Для каждого ТекСтрока Из НовОбъект.Товары Цикл
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			МассивНоменклатуры.Добавить(НоваяСтрока.Номенклатура);
			Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
				Если ЗначениеЗаполнено(ТекСтрока.Склад) Тогда
					ЭтотОбъект.Склад = ТекСтрока.Склад;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ДокОснование) И ТипЗнч(ДанныеЗаполнения.ДокОснование) = Тип("ДокументСсылка.УЧ_ПоступлениеТоваров") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	сабОбработкаДокументов.ДокументБУ КАК ДокументБУ
			|ИЗ
			|	РегистрСведений.сабОбработкаДокументов КАК сабОбработкаДокументов
			|ГДЕ
			|	сабОбработкаДокументов.ДокументУУ = &ДокументУУ";
			
			Запрос.УстановитьПараметр("ДокументУУ", ДанныеЗаполнения.ДокОснование);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Сделка = Выборка.ДокументБУ;				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура УУ_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Модифицированность() Тогда
		Если ДополнительныеСвойства.Свойство("НеДобавлятьЗаписьВРегистрИзмененных") Тогда
			Если Не ДополнительныеСвойства.НеДобавлятьЗаписьВРегистрИзмененных Тогда
				сабОбщегоНазначенияБУХ.УстановитьМодифицированностьБУДокумента(ЭтотОбъект, Ссылка, РежимЗаписи);
			КонецЕсли;
		Иначе
			сабОбщегоНазначенияБУХ.УстановитьМодифицированностьБУДокумента(ЭтотОбъект, Ссылка, РежимЗаписи);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда
		Если (ОбменДанными.Загрузка Или ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоОбмен")) И АвтообновленияЗаблокированы Тогда
			ИгнорироватьБлокАвтообновления = Справочники.сабМониторВнедрения.ПолучитьЗначениеНастройки("сабИгнорироватьБлокировкуАвтообновленийДокументов");
			Если Не ИгнорироватьБлокАвтообновления Тогда
				ЭтотОбъект.Прочитать();
				ОбменДанными.Загрузка = Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоОбмен");   
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

