Функция ФормаВыполненияСправочники(ЗадачаСсылка, ТочкаМаршрутаСсылка, Выборка) Экспорт
	
	Если ТочкаМаршрутаСсылка = Перечисления.ЗаявкиАдминистраторуТочкиМаршрута.Действие1 Тогда 
		ИмяФормы = "Справочник.ЗаявкиАдминистратору.Форма.ФормаПодготовки";
		
	ИначеЕсли ТочкаМаршрутаСсылка = Перечисления.ЗаявкиАдминистраторуТочкиМаршрута.Действие3 Тогда 
		ИмяФормы = "Справочник.ЗаявкиАдминистратору.Форма.ФормаКонтроля";
	ИначеЕсли ТочкаМаршрутаСсылка = Перечисления.ЗаявкиАдминистраторуТочкиМаршрута.Действие4 Тогда 
		ИмяФормы = "Справочник.ЗаявкиАдминистратору.Форма.ФормаВыполнения";
	ИначеЕсли ТочкаМаршрутаСсылка = Перечисления.ЗаявкиАдминистраторуТочкиМаршрута.Действие5 ИЛИ ТочкаМаршрутаСсылка = Перечисления.ЗаявкиАдминистраторуТочкиМаршрута.Действие6 Тогда 
		ИмяФормы = "Справочник.ЗаявкиАдминистратору.Форма.ФормаОплаты";
	Иначе
		ИмяФормы = "Справочник.ЗаявкиАдминистратору.Форма.ФормаСогласования";		
	КонецЕсли;	
		
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ, ТочкаМаршрута, Исполнитель, Должность",
			ЗадачаСсылка, ТочкаМаршрутаСсылка.Имя, Выборка.Исполнитель, Выборка.Должность));
	Результат.Вставить("ИмяФормы", ИмяФормы);
	Возврат Результат;
	
КонецФункции

Функция ИмяФормыВыполненияСправочники(ТочкаМаршрутаСсылка) Экспорт
	
	Возврат	"";
	
КонецФункции
