&После("ПередЗаписью")
Процедура УУ_ПередЗаписью(Отказ, Замещение)
	
	//суммаОплатыВЗАявки (по хорошему перевести статус в регистр состояние банк доков)
	УстановитьПривилегированныйРежим(Истина);
	СостояниеОплачено = Перечисления.СостоянияБанковскихДокументов.Оплачено;
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
		Если ТипЗнч(ТекЗапись.СсылкаНаОбъект) = Тип("ДокументСсылка.ПлатежноеПоручение") И ЗначениеЗаполнено(ТекЗапись.СсылкаНаОбъект.Заявка) Тогда
			ТекЗаявка = ТекЗапись.СсылкаНаОбъект.Заявка;
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПлатежноеПоручение.Ссылка КАК Ссылка,
			               |	СостоянияБанковскихДокументов.Состояние КАК Состояние,
			               |	ПлатежноеПоручение.СуммаДокумента КАК СуммаДокумента
			               |ИЗ
			               |	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
			               |		ПО ПлатежноеПоручение.Ссылка = СостоянияБанковскихДокументов.СсылкаНаОбъект
			               |			И (СостоянияБанковскихДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБанковскихДокументов.Оплачено))
			               |ГДЕ
			               |	ПлатежноеПоручение.Заявка = &Заявка
			               |	И ПлатежноеПоручение.ПометкаУдаления = ЛОЖЬ";
			
			
			Запрос.УстановитьПараметр("Заявка", ТекЗаявка);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Об = ТекЗаявка.ПолучитьОбъект();
			ТекСумма = ?(ТекЗапись.СсылкаНаОбъект.ПометкаУдаления ИЛИ Не ТекЗапись.Состояние = СостояниеОплачено, 0, ТекЗапись.СсылкаНаОбъект.СуммаДокумента);
			Пока Выборка.Следующий() Цикл
				Если Выборка.Ссылка = ТекЗапись.СсылкаНаОбъект Тогда
					Продолжить;				
				КонецЕсли;
				Если Не Выборка.Состояние = СостояниеОплачено Тогда
					Продолжить;
				КонецЕсли;					
				ТекСумма = ТекСумма + Выборка.СуммаДокумента; 
			КонецЦикла;
			Об.СуммаОплачено = ТекСумма;
			Об.Записать();
		КонецЕсли;
	КонецЦикла; 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
