

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Адрес") Тогда
		Адрес = "https://yandex.ru/maps/?text=" + Параметры.Адрес;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИЗаполнитьАдресКоординаты(Команда)
	
	Если ВладелецФормы = Неопределено Тогда
		ОписаниеОповещенияНетФормыВладельца = Новый ОписаниеОповещения("ВыполнитьПослеОтветаНетФормыВладельца",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияНетФормыВладельца, "Форма подразделения контрагента была закрыта. Невозможно заполнить адрес и координаты для подразделения. Закрыть форму без заполнения?",РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ТекстВопроса = "";
		//Если ЗначениеЗаполнено(ВладелецФормы.Объект.Адрес) И  ЗначениеЗаполнено(ВладелецФормы.Объект.Координаты) Тогда
		//	ТекстВопроса = "Поля адрес и координаты заполнены для текущего подразделения. Данные будут перезаполнены. Продолжить?";
		//ИначеЕсли ЗначениеЗаполнено(ВладелецФормы.Объект.Адрес) Тогда 
		//	ТекстВопроса = "Поле адрес заполнено для текущего подразделения. Данные будут перезаполнены. Продолжить?";
		Если ЗначениеЗаполнено(ВладелецФормы.Объект.Координаты) Тогда 
			ТекстВопроса = "Поле координаты заполнено для текущего подразделения. Данные будут перезаполнены. Продолжить?";
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстВопроса) Тогда
			ОписаниеОповещенияДанныеЗаполнены = Новый ОписаниеОповещения("ВыполнитьПослеОтветаДанныеЗаполнены",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияДанныеЗаполнены,ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена);
		Иначе
			ЗаполнитьКоординатыПодразделения();
		КонецЕсли;   
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОтветаДанныеЗаполнены(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьКоординатыПодразделения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОтветаНетФормыВладельца(Результат,ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьКоординатыПодразделения()
	
	Чтение = Новый ЧтениеHTML;
	Чтение.УстановитьСтроку(Элементы.Адрес.Документ.documentElement.innerHTML);
	ОбъектыDOM = Новый ПостроительDOM;
	Данные = ОбъектыDOM.Прочитать(Чтение);
	ТекстСайта = Данные.ИзвлечьТолькоТекст();
	ПервыйСимвол = СтрНайти(ТекстСайта,"Координаты:");
	Если ПервыйСимвол > 0 Тогда
		ПервыйСимвол = ПервыйСимвол + 11;
	КонецЕсли;
	КрайнийСимвол = ПервыйСимвол + 20;
	Если ПервыйСимвол > 0 И КрайнийСимвол > ПервыйСимвол Тогда
		Координаты = Сред(ТекстСайта,ПервыйСимвол,КрайнийСимвол - ПервыйСимвол);
		СтруктураДляВозврата = Новый Структура("Координаты",Координаты);
		Закрыть(СтруктураДляВозврата);
	Иначе
		Сообщить("Кординаты не распознаны");   
	КонецЕсли;
	
	//Адрес = "/maps/?text=" + Координаты;
	//ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	//БезопасноеСоединение = Новый HTTPСоединение("yandex.ru",443,,,,,ЗащищенноеСоединение);
	//Ответ = БезопасноеСоединение.Получить(Новый HTTPЗапрос(Адрес));
	//Если Ответ.КодСостояния = 200 Тогда
	//	Результат = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	//	Чтение = Новый ЧтениеHTML;
	//	
	//	Чтение.УстановитьСтроку(Результат);
	//	ОбъектыDOM = Новый ПостроительDOM;
	//	Данные = ОбъектыDOM.Прочитать(Чтение);
	//	ТекстКарты = Данные.ИзвлечьТолькоТекст();
	//	ПервыйСимвол = СтрНайти(ТекстКарты,"Координаты:");
	//	СтрАдреса = Лев(ТекстСайта,ПервыйСимвол-1);
	//	МассивПолейАдреса = СтрРазделить(СтрАдреса,","); 
	//	ПервоеПолеАдреса = МассивПолейАдреса[МассивПолейАдреса.Количество()-1];
	//	Если ЭтоИндекс(ПервоеПолеАдреса) Тогда
	//		Индекс = МассивПолейАдреса[МассивПолейАдреса.Количество()-1];
	//		Город = МассивПолейАдреса[МассивПолейАдреса.Количество()-2];
	//		Улица = МассивПолейАдреса[0];
	//		Дом = МассивПолейАдреса[МассивПолейАдреса.Количество()-3]; 
	//	Иначе
	//		Город = МассивПолейАдреса[МассивПолейАдреса.Количество()-1];
	//		Улица = МассивПолейАдреса[0];
	//		Дом = МассивПолейАдреса[МассивПолейАдреса.Количество()-2]; 
	//	КонецЕсли;
	//	//Рябиновая улица, 13Рябиновая улица, 13Рябиновая улица, 13, Белгород, 308012Координаты
	//	Сообщить("индекс " + Индекс + " Город " + Город + " Улица " + Улица + " Дом " + Дом);
	//Иначе
	//	Сообщить("Кординаты не подобраны. Ошибка ответа сервера (" + Ответ.КодСостояния + ")");
	//КонецЕсли;
	//
	//
	
	
КонецПроцедуры 

&НаКлиенте
Функция ЭтоИндекс(ЧастьАдреса)

	ЭтоИндекс = Истина;
	Если СтрДлина(СокрЛП(ЧастьАдреса)) <> 6 Тогда
		ЭтоИндекс = Ложь;
	Иначе                               
		Для Сч = 1 По 6 Цикл 
			СимволСтроки = Сред(ЧастьАдреса,Сч,1);
			Если СимволСтроки = "0" ИЛИ
				СимволСтроки = "1" ИЛИ
				СимволСтроки = "2" ИЛИ
				СимволСтроки = "3" ИЛИ
				СимволСтроки = "4" ИЛИ
				СимволСтроки = "5" ИЛИ
				СимволСтроки = "6" ИЛИ
				СимволСтроки = "7" ИЛИ
				СимволСтроки = "8" ИЛИ
				СимволСтроки = "9"  Тогда
			Иначе
				ЭтоИндекс = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	Возврат ЭтоИндекс;
КонецФункции     

&НаКлиенте
Функция ЭтоНомерДома(ЧастьАдреса,СледующаяЧастьАдреса)

	ЭтоДом = Ложь;
	ДлинаСтроки = СтрДлина(ЧастьАдреса); 
	Если ДлинаСтроки > 5 Тогда
		Возврат ЭтоДом;
	Иначе                               
		Для Сч = 1 По ДлинаСтроки Цикл 
			СимволСтроки = Сред(ЧастьАдреса,Сч,1);
			Если СимволСтроки = "1" ИЛИ
				СимволСтроки = "2" ИЛИ
				СимволСтроки = "3" ИЛИ
				СимволСтроки = "4" ИЛИ
				СимволСтроки = "5" ИЛИ
				СимволСтроки = "6" ИЛИ
				СимволСтроки = "7" ИЛИ
				СимволСтроки = "8" ИЛИ
				СимволСтроки = "9"  Тогда 
				ЭтоДом = Истина; 
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		Если ЭтоДом Тогда
			Если СтрНайти(СледующаяЧастьАдреса,ЧастьАдреса) > 0	Тогда
			Иначе
				ЭтоДом = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ЭтоДом;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПреобразоватьАдрес(ПолученныйАдрес) 
	
	Результат = Неопределено;
	ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(ПолученныйАдрес,
	Перечисления.ТипыКонтактнойИнформации.Адрес); 
	Если Не ПустаяСтрока(ЗначенияПолей) Тогда
		Результат = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ЗначенияПолей); 
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьАдрес(Команда)
	
	Чтение = Новый ЧтениеHTML;
	Чтение.УстановитьСтроку(Элементы.Адрес.Документ.documentElement.innerHTML);
	ОбъектыDOM = Новый ПостроительDOM;
	Данные = ОбъектыDOM.Прочитать(Чтение);
	ТекстСайта = Данные.ИзвлечьТолькоТекст();
	ПервыйСимвол = СтрНайти(ТекстСайта,"Координаты:");
	СтрАдреса = Лев(ТекстСайта,ПервыйСимвол-1);  
	// Привольная улица, 12Привольная улица, 12Привольная улица, 12, деревня Берёзовка, Верхнематрёнский сельсовет, Добринский район, Липецкая область
	МассивПолейАдреса = СтрРазделить(СтрАдреса,",");
	ПолученныйАдрес = ""; 
	КоличествоЭлементовМассива = МассивПолейАдреса.Количество();
	Если КоличествоЭлементовМассива < 1 Тогда
		Сообщить("Не удалось обработать адрес.");
	Иначе
		Для сч=1 по КоличествоЭлементовМассива Цикл
			индекс = КоличествоЭлементовМассива - сч;
			Если Индекс <> 0 И ЭтоНомерДома(СокрЛП(МассивПолейАдреса[индекс]),МассивПолейАдреса[индекс-1]) Тогда 
				Улица = СтрЗаменить(МассивПолейАдреса[индекс-1],СокрЛП(МассивПолейАдреса[индекс]),"");
				ПолученныйАдрес = ПолученныйАдрес + ", " + СокрЛП(Улица);
				ПолученныйАдрес = ПолученныйАдрес + ", дом " + СокрЛП(МассивПолейАдреса[индекс]);
				Прервать;
			Иначе
				Если сч = 1 Тогда
					ПолученныйАдрес = ПолученныйАдрес  + СокрЛП(МассивПолейАдреса[индекс]);	
				ИначеЕсли сч = КоличествоЭлементовМассива Тогда
					ВидНаселенногоПункта = Лев(СокрЛП(МассивПолейАдреса[Индекс]), СтрНайти(СокрЛП(МассивПолейАдреса[Индекс])," ")-1);
					ОбработаннаяСтрокаНаселенногоПункта = Лев(СокрЛП(МассивПолейАдреса[Индекс]), СтрНайти(СокрЛП(МассивПолейАдреса[Индекс]),ВидНаселенногоПункта,,3)-1);
					ПолученныйАдрес = ПолученныйАдрес + ", " + ОбработаннаяСтрокаНаселенногоПункта;
				Иначе
					ПолученныйАдрес = ПолученныйАдрес + ", " + СокрЛП(МассивПолейАдреса[индекс]);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПолученныйАдрес = СокрЛП(ПолученныйАдрес);
	КонецЕсли;
		
	//ПервоеПолеАдреса = СокрЛП(МассивПолейАдреса[МассивПолейАдреса.Количество()-1]);
	//Если ЭтоИндекс(ПервоеПолеАдреса) Тогда
	//	Если МассивПолейАдреса.Количество() < 4 Тогда
	//		Сообщить("Не удалось обработать адрес.");
	//		ПолученныйАдрес = "";
	//	Иначе
	//		Индекс = МассивПолейАдреса[МассивПолейАдреса.Количество()-1];
	//		Город = МассивПолейАдреса[МассивПолейАдреса.Количество()-2];
	//		Улица = МассивПолейАдреса[0];
	//		Дом = МассивПолейАдреса[МассивПолейАдреса.Количество()-3];
	//		ПолученныйАдрес = Индекс + ", г. " + Город + ", " + Улица + ", дом " + СокрЛП(Дом); 
	//	КонецЕсли;
	//Иначе
	//	Если МассивПолейАдреса.Количество() < 3 Тогда
	//		Сообщить("Не удалось обработать адрес.");
	//		ПолученныйАдрес = "";
	//	Иначе
	//		Город = МассивПолейАдреса[МассивПолейАдреса.Количество()-1];
	//		Улица = МассивПолейАдреса[0];
	//		Дом = МассивПолейАдреса[МассивПолейАдреса.Количество()-2]; 
	//		ПолученныйАдрес = "г. " + Город + ", " + Улица + ", дом " + СокрЛП(Дом);
	//	КонецЕсли;
	//КонецЕсли;
	Если ПолученныйАдрес <> "" Тогда
		ПреобразованныйАдрес = ПреобразоватьАдрес(ПолученныйАдрес);
		Если ПреобразованныйАдрес = Неопределено Тогда
			ПреобразованныйАдрес = ПолученныйАдрес;
		КонецЕсли; 
		АдресМеста = СокрЛП(ПреобразованныйАдрес); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрыитьИЗаполнитьАдресИКоординаты(Команда) 
	
	Если ВладелецФормы = Неопределено Тогда
		ОписаниеОповещенияНетФормыВладельца = Новый ОписаниеОповещения("ВыполнитьПослеОтветаНетФормыВладельца",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияНетФормыВладельца, "Форма подразделения контрагента была закрыта. Невозможно заполнить адрес и координаты для подразделения. Закрыть форму без заполнения?",РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ТекстВопроса = "";
		Если ЗначениеЗаполнено(ВладелецФормы.Объект.Адрес) И  ЗначениеЗаполнено(ВладелецФормы.Объект.Координаты) Тогда
			ТекстВопроса = "Поля адрес и координаты заполнены для текущего подразделения. Данные будут перезаполнены. Продолжить?";
		ИначеЕсли ЗначениеЗаполнено(ВладелецФормы.Объект.Адрес) Тогда 
			ТекстВопроса = "Поле адрес заполнено для текущего подразделения. Данные будут перезаполнены. Продолжить?";
		ИначеЕсли ЗначениеЗаполнено(ВладелецФормы.Объект.Координаты) Тогда 
			ТекстВопроса = "Поле координаты заполнено для текущего подразделения. Данные будут перезаполнены. Продолжить?";
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстВопроса) Тогда
			ОписаниеОповещенияДанныеЗаполнены = Новый ОписаниеОповещения("ВыполнитьПослеОтветаДанныеЗаполненыАдресИКоординаты",ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияДанныеЗаполнены,ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена);
		Иначе
			ВыполнитьЗакрытиеФормыИЗаполнениеАдресаИКоординат();
		КонецЕсли;   
	КонецЕсли;	
		
КонецПроцедуры  


&НаКлиенте
Процедура ВыполнитьПослеОтветаДанныеЗаполненыАдресИКоординаты(Результат, ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗакрытиеФормыИЗаполнениеАдресаИКоординат();
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьЗакрытиеФормыИЗаполнениеАдресаИКоординат()
	
	Чтение = Новый ЧтениеHTML;
	Чтение.УстановитьСтроку(Элементы.Адрес.Документ.documentElement.innerHTML);
	ОбъектыDOM = Новый ПостроительDOM;
	Данные = ОбъектыDOM.Прочитать(Чтение);
	ТекстСайта = Данные.ИзвлечьТолькоТекст();
	ПервыйСимвол = СтрНайти(ТекстСайта,"Координаты:");
	Если ПервыйСимвол > 0 Тогда
		ПервыйСимвол = ПервыйСимвол + 11;
	КонецЕсли;
	КрайнийСимвол = ПервыйСимвол + 20;
	Если ПервыйСимвол > 0 И КрайнийСимвол > ПервыйСимвол Тогда
		Координаты = Сред(ТекстСайта,ПервыйСимвол,КрайнийСимвол - ПервыйСимвол);
		СтруктураДляВозврата = Новый Структура("Координаты, Адрес",Координаты, АдресМеста);
		Закрыть(СтруктураДляВозврата); 
	Иначе
		Сообщить("Кординаты не распознаны");   
	КонецЕсли; 

КонецПроцедуры

